espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** ISP_VER_DATE_REG register
 *  version control register
 */
#define ISP_VER_DATE_REG (DR_REG_ISP_BASE + 0x0)
/** ISP_VER_DATA : R/W; bitpos: [31:0]; default: 539035144;
 *  csv version
 */
#define ISP_VER_DATA    0xFFFFFFFFU
#define ISP_VER_DATA_M  (ISP_VER_DATA_V << ISP_VER_DATA_S)
#define ISP_VER_DATA_V  0xFFFFFFFFU
#define ISP_VER_DATA_S  0

/** ISP_CLK_EN_REG register
 *  isp clk control register
 */
#define ISP_CLK_EN_REG (DR_REG_ISP_BASE + 0x4)
/** ISP_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  this bit configures the clk force on of isp reg. 0: disable, 1: enable
 */
#define ISP_CLK_EN    (BIT(0))
#define ISP_CLK_EN_M  (ISP_CLK_EN_V << ISP_CLK_EN_S)
#define ISP_CLK_EN_V  0x00000001U
#define ISP_CLK_EN_S  0
/** ISP_CLK_BLC_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  this bit configures the clk force on of blc. 0: disable, 1: enable
 */
#define ISP_CLK_BLC_FORCE_ON    (BIT(1))
#define ISP_CLK_BLC_FORCE_ON_M  (ISP_CLK_BLC_FORCE_ON_V << ISP_CLK_BLC_FORCE_ON_S)
#define ISP_CLK_BLC_FORCE_ON_V  0x00000001U
#define ISP_CLK_BLC_FORCE_ON_S  1
/** ISP_CLK_DPC_FORCE_ON : R/W; bitpos: [2]; default: 0;
 *  this bit configures the clk force on of dpc. 0: disable, 1: enable
 */
#define ISP_CLK_DPC_FORCE_ON    (BIT(2))
#define ISP_CLK_DPC_FORCE_ON_M  (ISP_CLK_DPC_FORCE_ON_V << ISP_CLK_DPC_FORCE_ON_S)
#define ISP_CLK_DPC_FORCE_ON_V  0x00000001U
#define ISP_CLK_DPC_FORCE_ON_S  2
/** ISP_CLK_BF_FORCE_ON : R/W; bitpos: [3]; default: 0;
 *  this bit configures the clk force on of bf. 0: disable, 1: enable
 */
#define ISP_CLK_BF_FORCE_ON    (BIT(3))
#define ISP_CLK_BF_FORCE_ON_M  (ISP_CLK_BF_FORCE_ON_V << ISP_CLK_BF_FORCE_ON_S)
#define ISP_CLK_BF_FORCE_ON_V  0x00000001U
#define ISP_CLK_BF_FORCE_ON_S  3
/** ISP_CLK_LSC_FORCE_ON : R/W; bitpos: [4]; default: 0;
 *  this bit configures the clk force on of lsc. 0: disable, 1: enable
 */
#define ISP_CLK_LSC_FORCE_ON    (BIT(4))
#define ISP_CLK_LSC_FORCE_ON_M  (ISP_CLK_LSC_FORCE_ON_V << ISP_CLK_LSC_FORCE_ON_S)
#define ISP_CLK_LSC_FORCE_ON_V  0x00000001U
#define ISP_CLK_LSC_FORCE_ON_S  4
/** ISP_CLK_DEMOSAIC_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  this bit configures the clk force on of demosaic. 0: disable, 1: enable
 */
#define ISP_CLK_DEMOSAIC_FORCE_ON    (BIT(5))
#define ISP_CLK_DEMOSAIC_FORCE_ON_M  (ISP_CLK_DEMOSAIC_FORCE_ON_V << ISP_CLK_DEMOSAIC_FORCE_ON_S)
#define ISP_CLK_DEMOSAIC_FORCE_ON_V  0x00000001U
#define ISP_CLK_DEMOSAIC_FORCE_ON_S  5
/** ISP_CLK_MEDIAN_FORCE_ON : R/W; bitpos: [6]; default: 0;
 *  this bit configures the clk force on of median. 0: disable, 1: enable
 */
#define ISP_CLK_MEDIAN_FORCE_ON    (BIT(6))
#define ISP_CLK_MEDIAN_FORCE_ON_M  (ISP_CLK_MEDIAN_FORCE_ON_V << ISP_CLK_MEDIAN_FORCE_ON_S)
#define ISP_CLK_MEDIAN_FORCE_ON_V  0x00000001U
#define ISP_CLK_MEDIAN_FORCE_ON_S  6
/** ISP_CLK_CCM_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  this bit configures the clk force on of ccm. 0: disable, 1: enable
 */
#define ISP_CLK_CCM_FORCE_ON    (BIT(7))
#define ISP_CLK_CCM_FORCE_ON_M  (ISP_CLK_CCM_FORCE_ON_V << ISP_CLK_CCM_FORCE_ON_S)
#define ISP_CLK_CCM_FORCE_ON_V  0x00000001U
#define ISP_CLK_CCM_FORCE_ON_S  7
/** ISP_CLK_GAMMA_FORCE_ON : R/W; bitpos: [8]; default: 0;
 *  this bit configures the clk force on of gamma. 0: disable, 1: enable
 */
#define ISP_CLK_GAMMA_FORCE_ON    (BIT(8))
#define ISP_CLK_GAMMA_FORCE_ON_M  (ISP_CLK_GAMMA_FORCE_ON_V << ISP_CLK_GAMMA_FORCE_ON_S)
#define ISP_CLK_GAMMA_FORCE_ON_V  0x00000001U
#define ISP_CLK_GAMMA_FORCE_ON_S  8
/** ISP_CLK_RGB2YUV_FORCE_ON : R/W; bitpos: [9]; default: 0;
 *  this bit configures the clk force on of rgb2yuv. 0: disable, 1: enable
 */
#define ISP_CLK_RGB2YUV_FORCE_ON    (BIT(9))
#define ISP_CLK_RGB2YUV_FORCE_ON_M  (ISP_CLK_RGB2YUV_FORCE_ON_V << ISP_CLK_RGB2YUV_FORCE_ON_S)
#define ISP_CLK_RGB2YUV_FORCE_ON_V  0x00000001U
#define ISP_CLK_RGB2YUV_FORCE_ON_S  9
/** ISP_CLK_SHARP_FORCE_ON : R/W; bitpos: [10]; default: 0;
 *  this bit configures the clk force on of sharp. 0: disable, 1: enable
 */
#define ISP_CLK_SHARP_FORCE_ON    (BIT(10))
#define ISP_CLK_SHARP_FORCE_ON_M  (ISP_CLK_SHARP_FORCE_ON_V << ISP_CLK_SHARP_FORCE_ON_S)
#define ISP_CLK_SHARP_FORCE_ON_V  0x00000001U
#define ISP_CLK_SHARP_FORCE_ON_S  10
/** ISP_CLK_COLOR_FORCE_ON : R/W; bitpos: [11]; default: 0;
 *  this bit configures the clk force on of color. 0: disable, 1: enable
 */
#define ISP_CLK_COLOR_FORCE_ON    (BIT(11))
#define ISP_CLK_COLOR_FORCE_ON_M  (ISP_CLK_COLOR_FORCE_ON_V << ISP_CLK_COLOR_FORCE_ON_S)
#define ISP_CLK_COLOR_FORCE_ON_V  0x00000001U
#define ISP_CLK_COLOR_FORCE_ON_S  11
/** ISP_CLK_YUV2RGB_FORCE_ON : R/W; bitpos: [12]; default: 0;
 *  this bit configures the clk force on of yuv2rgb. 0: disable, 1: enable
 */
#define ISP_CLK_YUV2RGB_FORCE_ON    (BIT(12))
#define ISP_CLK_YUV2RGB_FORCE_ON_M  (ISP_CLK_YUV2RGB_FORCE_ON_V << ISP_CLK_YUV2RGB_FORCE_ON_S)
#define ISP_CLK_YUV2RGB_FORCE_ON_V  0x00000001U
#define ISP_CLK_YUV2RGB_FORCE_ON_S  12
/** ISP_CLK_AE_FORCE_ON : R/W; bitpos: [13]; default: 0;
 *  this bit configures the clk force on of ae. 0: disable, 1: enable
 */
#define ISP_CLK_AE_FORCE_ON    (BIT(13))
#define ISP_CLK_AE_FORCE_ON_M  (ISP_CLK_AE_FORCE_ON_V << ISP_CLK_AE_FORCE_ON_S)
#define ISP_CLK_AE_FORCE_ON_V  0x00000001U
#define ISP_CLK_AE_FORCE_ON_S  13
/** ISP_CLK_AF_FORCE_ON : R/W; bitpos: [14]; default: 0;
 *  this bit configures the clk force on of af. 0: disable, 1: enable
 */
#define ISP_CLK_AF_FORCE_ON    (BIT(14))
#define ISP_CLK_AF_FORCE_ON_M  (ISP_CLK_AF_FORCE_ON_V << ISP_CLK_AF_FORCE_ON_S)
#define ISP_CLK_AF_FORCE_ON_V  0x00000001U
#define ISP_CLK_AF_FORCE_ON_S  14
/** ISP_CLK_AWB_FORCE_ON : R/W; bitpos: [15]; default: 0;
 *  this bit configures the clk force on of awb. 0: disable, 1: enable
 */
#define ISP_CLK_AWB_FORCE_ON    (BIT(15))
#define ISP_CLK_AWB_FORCE_ON_M  (ISP_CLK_AWB_FORCE_ON_V << ISP_CLK_AWB_FORCE_ON_S)
#define ISP_CLK_AWB_FORCE_ON_V  0x00000001U
#define ISP_CLK_AWB_FORCE_ON_S  15
/** ISP_CLK_HIST_FORCE_ON : R/W; bitpos: [16]; default: 0;
 *  this bit configures the clk force on of hist. 0: disable, 1: enable
 */
#define ISP_CLK_HIST_FORCE_ON    (BIT(16))
#define ISP_CLK_HIST_FORCE_ON_M  (ISP_CLK_HIST_FORCE_ON_V << ISP_CLK_HIST_FORCE_ON_S)
#define ISP_CLK_HIST_FORCE_ON_V  0x00000001U
#define ISP_CLK_HIST_FORCE_ON_S  16
/** ISP_CLK_MIPI_IDI_FORCE_ON : R/W; bitpos: [17]; default: 0;
 *  this bit configures the clk force on of mipi idi input. 0: disable, 1: enable
 */
#define ISP_CLK_MIPI_IDI_FORCE_ON    (BIT(17))
#define ISP_CLK_MIPI_IDI_FORCE_ON_M  (ISP_CLK_MIPI_IDI_FORCE_ON_V << ISP_CLK_MIPI_IDI_FORCE_ON_S)
#define ISP_CLK_MIPI_IDI_FORCE_ON_V  0x00000001U
#define ISP_CLK_MIPI_IDI_FORCE_ON_S  17
/** ISP_ISP_MEM_CLK_FORCE_ON : R/W; bitpos: [18]; default: 0;
 *  this bit configures the clk force on of all isp memory. 0: disable, 1: enable
 */
#define ISP_ISP_MEM_CLK_FORCE_ON    (BIT(18))
#define ISP_ISP_MEM_CLK_FORCE_ON_M  (ISP_ISP_MEM_CLK_FORCE_ON_V << ISP_ISP_MEM_CLK_FORCE_ON_S)
#define ISP_ISP_MEM_CLK_FORCE_ON_V  0x00000001U
#define ISP_ISP_MEM_CLK_FORCE_ON_S  18

