espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_CNTL_REG register
 *  isp module enable control register
 */
#define ISP_CNTL_REG (DR_REG_ISP_BASE + 0x8)
/** ISP_MIPI_DATA_EN : R/W; bitpos: [0]; default: 0;
 *  this bit configures mipi input data enable. 0: disable, 1: enable
 */
#define ISP_MIPI_DATA_EN    (BIT(0))
#define ISP_MIPI_DATA_EN_M  (ISP_MIPI_DATA_EN_V << ISP_MIPI_DATA_EN_S)
#define ISP_MIPI_DATA_EN_V  0x00000001U
#define ISP_MIPI_DATA_EN_S  0
/** ISP_ISP_EN : R/W; bitpos: [1]; default: 1;
 *  this bit configures isp global enable. 0: disable, 1: enable
 */
#define ISP_ISP_EN    (BIT(1))
#define ISP_ISP_EN_M  (ISP_ISP_EN_V << ISP_ISP_EN_S)
#define ISP_ISP_EN_V  0x00000001U
#define ISP_ISP_EN_S  1
/** ISP_BLC_EN : R/W; bitpos: [2]; default: 0;
 *  this bit configures blc enable. 0: disable, 1: enable
 */
#define ISP_BLC_EN    (BIT(2))
#define ISP_BLC_EN_M  (ISP_BLC_EN_V << ISP_BLC_EN_S)
#define ISP_BLC_EN_V  0x00000001U
#define ISP_BLC_EN_S  2
/** ISP_DPC_EN : R/W; bitpos: [3]; default: 0;
 *  this bit configures dpc enable. 0: disable, 1: enable
 */
#define ISP_DPC_EN    (BIT(3))
#define ISP_DPC_EN_M  (ISP_DPC_EN_V << ISP_DPC_EN_S)
#define ISP_DPC_EN_V  0x00000001U
#define ISP_DPC_EN_S  3
/** ISP_BF_EN : R/W; bitpos: [4]; default: 0;
 *  this bit configures bf enable. 0: disable, 1: enable
 */
#define ISP_BF_EN    (BIT(4))
#define ISP_BF_EN_M  (ISP_BF_EN_V << ISP_BF_EN_S)
#define ISP_BF_EN_V  0x00000001U
#define ISP_BF_EN_S  4
/** ISP_LSC_EN : R/W; bitpos: [5]; default: 0;
 *  this bit configures lsc enable. 0: disable, 1: enable
 */
#define ISP_LSC_EN    (BIT(5))
#define ISP_LSC_EN_M  (ISP_LSC_EN_V << ISP_LSC_EN_S)
#define ISP_LSC_EN_V  0x00000001U
#define ISP_LSC_EN_S  5
/** ISP_DEMOSAIC_EN : R/W; bitpos: [6]; default: 1;
 *  this bit configures demosaic enable. 0: disable, 1: enable
 */
#define ISP_DEMOSAIC_EN    (BIT(6))
#define ISP_DEMOSAIC_EN_M  (ISP_DEMOSAIC_EN_V << ISP_DEMOSAIC_EN_S)
#define ISP_DEMOSAIC_EN_V  0x00000001U
#define ISP_DEMOSAIC_EN_S  6
/** ISP_MEDIAN_EN : R/W; bitpos: [7]; default: 0;
 *  this bit configures median enable. 0: disable, 1: enable
 */
#define ISP_MEDIAN_EN    (BIT(7))
#define ISP_MEDIAN_EN_M  (ISP_MEDIAN_EN_V << ISP_MEDIAN_EN_S)
#define ISP_MEDIAN_EN_V  0x00000001U
#define ISP_MEDIAN_EN_S  7
/** ISP_CCM_EN : R/W; bitpos: [8]; default: 0;
 *  this bit configures ccm enable. 0: disable, 1: enable
 */
#define ISP_CCM_EN    (BIT(8))
#define ISP_CCM_EN_M  (ISP_CCM_EN_V << ISP_CCM_EN_S)
#define ISP_CCM_EN_V  0x00000001U
#define ISP_CCM_EN_S  8
/** ISP_GAMMA_EN : R/W; bitpos: [9]; default: 0;
 *  this bit configures gamma enable. 0: disable, 1: enable
 */
#define ISP_GAMMA_EN    (BIT(9))
#define ISP_GAMMA_EN_M  (ISP_GAMMA_EN_V << ISP_GAMMA_EN_S)
#define ISP_GAMMA_EN_V  0x00000001U
#define ISP_GAMMA_EN_S  9
/** ISP_RGB2YUV_EN : R/W; bitpos: [10]; default: 1;
 *  this bit configures rgb2yuv enable. 0: disable, 1: enable
 */
#define ISP_RGB2YUV_EN    (BIT(10))
#define ISP_RGB2YUV_EN_M  (ISP_RGB2YUV_EN_V << ISP_RGB2YUV_EN_S)
#define ISP_RGB2YUV_EN_V  0x00000001U
#define ISP_RGB2YUV_EN_S  10
/** ISP_SHARP_EN : R/W; bitpos: [11]; default: 0;
 *  this bit configures sharp enable. 0: disable, 1: enable
 */
#define ISP_SHARP_EN    (BIT(11))
#define ISP_SHARP_EN_M  (ISP_SHARP_EN_V << ISP_SHARP_EN_S)
#define ISP_SHARP_EN_V  0x00000001U
#define ISP_SHARP_EN_S  11
/** ISP_COLOR_EN : R/W; bitpos: [12]; default: 0;
 *  this bit configures color enable. 0: disable, 1: enable
 */
#define ISP_COLOR_EN    (BIT(12))
#define ISP_COLOR_EN_M  (ISP_COLOR_EN_V << ISP_COLOR_EN_S)
#define ISP_COLOR_EN_V  0x00000001U
#define ISP_COLOR_EN_S  12
/** ISP_YUV2RGB_EN : R/W; bitpos: [13]; default: 1;
 *  this bit configures yuv2rgb enable. 0: disable, 1: enable
 */
#define ISP_YUV2RGB_EN    (BIT(13))
#define ISP_YUV2RGB_EN_M  (ISP_YUV2RGB_EN_V << ISP_YUV2RGB_EN_S)
#define ISP_YUV2RGB_EN_V  0x00000001U
#define ISP_YUV2RGB_EN_S  13
/** ISP_AE_EN : R/W; bitpos: [14]; default: 0;
 *  this bit configures ae enable. 0: disable, 1: enable
 */
#define ISP_AE_EN    (BIT(14))
#define ISP_AE_EN_M  (ISP_AE_EN_V << ISP_AE_EN_S)
#define ISP_AE_EN_V  0x00000001U
#define ISP_AE_EN_S  14
/** ISP_AF_EN : R/W; bitpos: [15]; default: 0;
 *  this bit configures af enable. 0: disable, 1: enable
 */
#define ISP_AF_EN    (BIT(15))
#define ISP_AF_EN_M  (ISP_AF_EN_V << ISP_AF_EN_S)
#define ISP_AF_EN_V  0x00000001U
#define ISP_AF_EN_S  15
/** ISP_AWB_EN : R/W; bitpos: [16]; default: 0;
 *  this bit configures awb enable. 0: disable, 1: enable
 */
#define ISP_AWB_EN    (BIT(16))
#define ISP_AWB_EN_M  (ISP_AWB_EN_V << ISP_AWB_EN_S)
#define ISP_AWB_EN_V  0x00000001U
#define ISP_AWB_EN_S  16
/** ISP_HIST_EN : R/W; bitpos: [17]; default: 0;
 *  this bit configures hist enable. 0: disable, 1: enable
 */
#define ISP_HIST_EN    (BIT(17))
#define ISP_HIST_EN_M  (ISP_HIST_EN_V << ISP_HIST_EN_S)
#define ISP_HIST_EN_V  0x00000001U
#define ISP_HIST_EN_S  17
/** ISP_BYTE_ENDIAN_ORDER : R/W; bitpos: [24]; default: 0;
 *  select input idi data byte_endian_order when isp is bypass, 0: csi_data[31:0], 1:
 *  {[7:0], [15:8], [23:16], [31:24]}
 */
#define ISP_BYTE_ENDIAN_ORDER    (BIT(24))
#define ISP_BYTE_ENDIAN_ORDER_M  (ISP_BYTE_ENDIAN_ORDER_V << ISP_BYTE_ENDIAN_ORDER_S)
#define ISP_BYTE_ENDIAN_ORDER_V  0x00000001U
#define ISP_BYTE_ENDIAN_ORDER_S  24
/** ISP_ISP_DATA_TYPE : R/W; bitpos: [26:25]; default: 0;
 *  this field configures input data type, 0:RAW8 1:RAW10 2:RAW12
 */
#define ISP_ISP_DATA_TYPE    0x00000003U
#define ISP_ISP_DATA_TYPE_M  (ISP_ISP_DATA_TYPE_V << ISP_ISP_DATA_TYPE_S)
#define ISP_ISP_DATA_TYPE_V  0x00000003U
#define ISP_ISP_DATA_TYPE_S  25
/** ISP_ISP_IN_SRC : R/W; bitpos: [28:27]; default: 0;
 *  this field configures input data source, 0:CSI HOST 1:CAM 2:DMA
 */
#define ISP_ISP_IN_SRC    0x00000003U
#define ISP_ISP_IN_SRC_M  (ISP_ISP_IN_SRC_V << ISP_ISP_IN_SRC_S)
#define ISP_ISP_IN_SRC_V  0x00000003U
#define ISP_ISP_IN_SRC_S  27
/** ISP_ISP_OUT_TYPE : R/W; bitpos: [31:29]; default: 2;
 *  this field configures pixel output type, 0: RAW8 1: YUV422 2: RGB888 3: YUV420 4:
 *  RGB565
 */
#define ISP_ISP_OUT_TYPE    0x00000007U
#define ISP_ISP_OUT_TYPE_M  (ISP_ISP_OUT_TYPE_V << ISP_ISP_OUT_TYPE_S)
#define ISP_ISP_OUT_TYPE_V  0x00000007U
#define ISP_ISP_OUT_TYPE_S  29

