espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_HSYNC_CNT_REG register
 *  header hsync interval control register
 */
#define ISP_HSYNC_CNT_REG (DR_REG_ISP_BASE + 0xc)
/** ISP_HSYNC_CNT : R/W; bitpos: [7:0]; default: 7;
 *  this field configures the number of clock before hsync and after vsync and line_end
 *  when decodes pix data from idi to isp
 */
#define ISP_HSYNC_CNT    0x000000FFU
#define ISP_HSYNC_CNT_M  (ISP_HSYNC_CNT_V << ISP_HSYNC_CNT_S)
#define ISP_HSYNC_CNT_V  0x000000FFU
#define ISP_HSYNC_CNT_S  0

/** ISP_FRAME_CFG_REG register
 *  frame control parameter register
 */
#define ISP_FRAME_CFG_REG (DR_REG_ISP_BASE + 0x10)
/** ISP_VADR_NUM : R/W; bitpos: [11:0]; default: 480;
 *  this field configures input image size in y-direction, image row number - 1
 */
#define ISP_VADR_NUM    0x00000FFFU
#define ISP_VADR_NUM_M  (ISP_VADR_NUM_V << ISP_VADR_NUM_S)
#define ISP_VADR_NUM_V  0x00000FFFU
#define ISP_VADR_NUM_S  0
/** ISP_HADR_NUM : R/W; bitpos: [23:12]; default: 480;
 *  this field configures input image size in x-direction, image line number - 1
 */
#define ISP_HADR_NUM    0x00000FFFU
#define ISP_HADR_NUM_M  (ISP_HADR_NUM_V << ISP_HADR_NUM_S)
#define ISP_HADR_NUM_V  0x00000FFFU
#define ISP_HADR_NUM_S  12
/** ISP_BAYER_MODE : R/W; bitpos: [28:27]; default: 0;
 *  this field configures the bayer mode of input pixel. 00 : BG/GR    01 : GB/RG   10
 *  : GR/BG  11 : RG/GB
 */
#define ISP_BAYER_MODE    0x00000003U
#define ISP_BAYER_MODE_M  (ISP_BAYER_MODE_V << ISP_BAYER_MODE_S)
#define ISP_BAYER_MODE_V  0x00000003U
#define ISP_BAYER_MODE_S  27
/** ISP_HSYNC_START_EXIST : R/W; bitpos: [29]; default: 1;
 *  this bit configures the line end packet exist or not. 0: not exist, 1: exist
 */
#define ISP_HSYNC_START_EXIST    (BIT(29))
#define ISP_HSYNC_START_EXIST_M  (ISP_HSYNC_START_EXIST_V << ISP_HSYNC_START_EXIST_S)
#define ISP_HSYNC_START_EXIST_V  0x00000001U
#define ISP_HSYNC_START_EXIST_S  29
/** ISP_HSYNC_END_EXIST : R/W; bitpos: [30]; default: 1;
 *  this bit configures the line start packet exist or not. 0: not exist, 1: exist
 */
#define ISP_HSYNC_END_EXIST    (BIT(30))
#define ISP_HSYNC_END_EXIST_M  (ISP_HSYNC_END_EXIST_V << ISP_HSYNC_END_EXIST_S)
#define ISP_HSYNC_END_EXIST_V  0x00000001U
#define ISP_HSYNC_END_EXIST_S  30

/** ISP_CCM_COEF0_REG register
 *  ccm coef register 0
 */
#define ISP_CCM_COEF0_REG (DR_REG_ISP_BASE + 0x14)
/** ISP_CCM_RR : R/W; bitpos: [12:0]; default: 1856;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_RR    0x00001FFFU
#define ISP_CCM_RR_M  (ISP_CCM_RR_V << ISP_CCM_RR_S)
#define ISP_CCM_RR_V  0x00001FFFU
#define ISP_CCM_RR_S  0
/** ISP_CCM_RG : R/W; bitpos: [25:13]; default: 4736;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_RG    0x00001FFFU
#define ISP_CCM_RG_M  (ISP_CCM_RG_V << ISP_CCM_RG_S)
#define ISP_CCM_RG_V  0x00001FFFU
#define ISP_CCM_RG_S  13

/** ISP_CCM_COEF1_REG register
 *  ccm coef register 1
 */
#define ISP_CCM_COEF1_REG (DR_REG_ISP_BASE + 0x18)
/** ISP_CCM_RB : R/W; bitpos: [12:0]; default: 4288;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_RB    0x00001FFFU
#define ISP_CCM_RB_M  (ISP_CCM_RB_V << ISP_CCM_RB_S)
#define ISP_CCM_RB_V  0x00001FFFU
#define ISP_CCM_RB_S  0
/** ISP_CCM_GR : R/W; bitpos: [25:13]; default: 4416;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_GR    0x00001FFFU
#define ISP_CCM_GR_M  (ISP_CCM_GR_V << ISP_CCM_GR_S)
#define ISP_CCM_GR_V  0x00001FFFU
#define ISP_CCM_GR_S  13

/** ISP_CCM_COEF3_REG register
 *  ccm coef register 3
 */
#define ISP_CCM_COEF3_REG (DR_REG_ISP_BASE + 0x1c)
/** ISP_CCM_GG : R/W; bitpos: [12:0]; default: 1664;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_GG    0x00001FFFU
#define ISP_CCM_GG_M  (ISP_CCM_GG_V << ISP_CCM_GG_S)
#define ISP_CCM_GG_V  0x00001FFFU
#define ISP_CCM_GG_S  0
/** ISP_CCM_GB : R/W; bitpos: [25:13]; default: 4352;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_GB    0x00001FFFU
#define ISP_CCM_GB_M  (ISP_CCM_GB_V << ISP_CCM_GB_S)
#define ISP_CCM_GB_V  0x00001FFFU
#define ISP_CCM_GB_S  13

/** ISP_CCM_COEF4_REG register
 *  ccm coef register 4
 */
#define ISP_CCM_COEF4_REG (DR_REG_ISP_BASE + 0x20)
/** ISP_CCM_BR : R/W; bitpos: [12:0]; default: 4160;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_BR    0x00001FFFU
#define ISP_CCM_BR_M  (ISP_CCM_BR_V << ISP_CCM_BR_S)
#define ISP_CCM_BR_V  0x00001FFFU
#define ISP_CCM_BR_S  0
/** ISP_CCM_BG : R/W; bitpos: [25:13]; default: 4800;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_BG    0x00001FFFU
#define ISP_CCM_BG_M  (ISP_CCM_BG_V << ISP_CCM_BG_S)
#define ISP_CCM_BG_V  0x00001FFFU
#define ISP_CCM_BG_S  13

/** ISP_CCM_COEF5_REG register
 *  ccm coef register 5
 */
#define ISP_CCM_COEF5_REG (DR_REG_ISP_BASE + 0x24)
/** ISP_CCM_BB : R/W; bitpos: [12:0]; default: 1856;
 *  this field configures the color correction matrix coefficient
 */
#define ISP_CCM_BB    0x00001FFFU
#define ISP_CCM_BB_M  (ISP_CCM_BB_V << ISP_CCM_BB_S)
#define ISP_CCM_BB_V  0x00001FFFU
#define ISP_CCM_BB_S  0

/** ISP_BF_MATRIX_CTRL_REG register
 *  bf pix2matrix ctrl
 */
#define ISP_BF_MATRIX_CTRL_REG (DR_REG_ISP_BASE + 0x28)
/** ISP_BF_TAIL_PIXEN_PULSE_TL : R/W; bitpos: [7:0]; default: 0;
 *  matrix tail pixen low level threshold, should not to large to prevent expanding to
 *  next frame, only reg_bf_tail_pixen_pulse_th!=0 and reg_bf_tail_pixen_pulse_tl!=0
 *  and reg_bf_tail_pixen_pulse_th < reg_bf_tail_pixen_pulse_tl will enable tail pulse
 *  function
 */
#define ISP_BF_TAIL_PIXEN_PULSE_TL    0x000000FFU
#define ISP_BF_TAIL_PIXEN_PULSE_TL_M  (ISP_BF_TAIL_PIXEN_PULSE_TL_V << ISP_BF_TAIL_PIXEN_PULSE_TL_S)
#define ISP_BF_TAIL_PIXEN_PULSE_TL_V  0x000000FFU
#define ISP_BF_TAIL_PIXEN_PULSE_TL_S  0
/** ISP_BF_TAIL_PIXEN_PULSE_TH : R/W; bitpos: [15:8]; default: 0;
 *  matrix tail pixen high level threshold, must < hnum-1, only
 *  reg_bf_tail_pixen_pulse_th!=0 and reg_bf_tail_pixen_pulse_tl!=0 and
 *  reg_bf_tail_pixen_pulse_th < reg_bf_tail_pixen_pulse_tl will enable tail pulse
 *  function
 */
#define ISP_BF_TAIL_PIXEN_PULSE_TH    0x000000FFU
#define ISP_BF_TAIL_PIXEN_PULSE_TH_M  (ISP_BF_TAIL_PIXEN_PULSE_TH_V << ISP_BF_TAIL_PIXEN_PULSE_TH_S)
#define ISP_BF_TAIL_PIXEN_PULSE_TH_V  0x000000FFU
#define ISP_BF_TAIL_PIXEN_PULSE_TH_S  8
/** ISP_BF_PADDING_DATA : R/W; bitpos: [23:16]; default: 0;
 *  this field configures bf matrix padding data
 */
#define ISP_BF_PADDING_DATA    0x000000FFU
#define ISP_BF_PADDING_DATA_M  (ISP_BF_PADDING_DATA_V << ISP_BF_PADDING_DATA_S)
#define ISP_BF_PADDING_DATA_V  0x000000FFU
#define ISP_BF_PADDING_DATA_S  16
/** ISP_BF_PADDING_MODE : R/W; bitpos: [24]; default: 0;
 *  this bit configures the padding mode of bf matrix.  0: use pixel in image to do
 *  padding   1: use reg_padding_data to do padding
 */
#define ISP_BF_PADDING_MODE    (BIT(24))
#define ISP_BF_PADDING_MODE_M  (ISP_BF_PADDING_MODE_V << ISP_BF_PADDING_MODE_S)
#define ISP_BF_PADDING_MODE_V  0x00000001U
#define ISP_BF_PADDING_MODE_S  24

/** ISP_BF_SIGMA_REG register
 *  bf denoising level control register
 */
#define ISP_BF_SIGMA_REG (DR_REG_ISP_BASE + 0x2c)
/** ISP_SIGMA : R/W; bitpos: [5:0]; default: 2;
 *  this field configures the bayer denoising level, valid data from 2 to 20
 */
#define ISP_SIGMA    0x0000003FU
#define ISP_SIGMA_M  (ISP_SIGMA_V << ISP_SIGMA_S)
#define ISP_SIGMA_V  0x0000003FU
#define ISP_SIGMA_S  0

/** ISP_BF_GAU0_REG register
 *  bf gau template register 0
 */
#define ISP_BF_GAU0_REG (DR_REG_ISP_BASE + 0x30)
/** ISP_GAU_TEMPLATE21 : R/W; bitpos: [3:0]; default: 15;
 *  this field configures index 21 of gaussian template
 */
#define ISP_GAU_TEMPLATE21    0x0000000FU
#define ISP_GAU_TEMPLATE21_M  (ISP_GAU_TEMPLATE21_V << ISP_GAU_TEMPLATE21_S)
#define ISP_GAU_TEMPLATE21_V  0x0000000FU
#define ISP_GAU_TEMPLATE21_S  0
/** ISP_GAU_TEMPLATE20 : R/W; bitpos: [7:4]; default: 15;
 *  this field configures index 20 of gaussian template
 */
#define ISP_GAU_TEMPLATE20    0x0000000FU
#define ISP_GAU_TEMPLATE20_M  (ISP_GAU_TEMPLATE20_V << ISP_GAU_TEMPLATE20_S)
#define ISP_GAU_TEMPLATE20_V  0x0000000FU
#define ISP_GAU_TEMPLATE20_S  4
/** ISP_GAU_TEMPLATE12 : R/W; bitpos: [11:8]; default: 15;
 *  this field configures index 12 of gaussian template
 */
#define ISP_GAU_TEMPLATE12    0x0000000FU
#define ISP_GAU_TEMPLATE12_M  (ISP_GAU_TEMPLATE12_V << ISP_GAU_TEMPLATE12_S)
#define ISP_GAU_TEMPLATE12_V  0x0000000FU
#define ISP_GAU_TEMPLATE12_S  8
/** ISP_GAU_TEMPLATE11 : R/W; bitpos: [15:12]; default: 15;
 *  this field configures index 11 of gaussian template
 */
#define ISP_GAU_TEMPLATE11    0x0000000FU
#define ISP_GAU_TEMPLATE11_M  (ISP_GAU_TEMPLATE11_V << ISP_GAU_TEMPLATE11_S)
#define ISP_GAU_TEMPLATE11_V  0x0000000FU
#define ISP_GAU_TEMPLATE11_S  12
/** ISP_GAU_TEMPLATE10 : R/W; bitpos: [19:16]; default: 15;
 *  this field configures index 10 of gaussian template
 */
#define ISP_GAU_TEMPLATE10    0x0000000FU
#define ISP_GAU_TEMPLATE10_M  (ISP_GAU_TEMPLATE10_V << ISP_GAU_TEMPLATE10_S)
#define ISP_GAU_TEMPLATE10_V  0x0000000FU
#define ISP_GAU_TEMPLATE10_S  16
/** ISP_GAU_TEMPLATE02 : R/W; bitpos: [23:20]; default: 15;
 *  this field configures index 02 of gaussian template
 */
#define ISP_GAU_TEMPLATE02    0x0000000FU
#define ISP_GAU_TEMPLATE02_M  (ISP_GAU_TEMPLATE02_V << ISP_GAU_TEMPLATE02_S)
#define ISP_GAU_TEMPLATE02_V  0x0000000FU
#define ISP_GAU_TEMPLATE02_S  20
/** ISP_GAU_TEMPLATE01 : R/W; bitpos: [27:24]; default: 15;
 *  this field configures index 01 of gaussian template
 */
#define ISP_GAU_TEMPLATE01    0x0000000FU
#define ISP_GAU_TEMPLATE01_M  (ISP_GAU_TEMPLATE01_V << ISP_GAU_TEMPLATE01_S)
#define ISP_GAU_TEMPLATE01_V  0x0000000FU
#define ISP_GAU_TEMPLATE01_S  24
/** ISP_GAU_TEMPLATE00 : R/W; bitpos: [31:28]; default: 15;
 *  this field configures index 00 of gaussian template
 */
#define ISP_GAU_TEMPLATE00    0x0000000FU
#define ISP_GAU_TEMPLATE00_M  (ISP_GAU_TEMPLATE00_V << ISP_GAU_TEMPLATE00_S)
#define ISP_GAU_TEMPLATE00_V  0x0000000FU
#define ISP_GAU_TEMPLATE00_S  28

/** ISP_BF_GAU1_REG register
 *  bf gau template register 1
 */
#define ISP_BF_GAU1_REG (DR_REG_ISP_BASE + 0x34)
/** ISP_GAU_TEMPLATE22 : R/W; bitpos: [3:0]; default: 15;
 *  this field configures index 22 of gaussian template
 */
#define ISP_GAU_TEMPLATE22    0x0000000FU
#define ISP_GAU_TEMPLATE22_M  (ISP_GAU_TEMPLATE22_V << ISP_GAU_TEMPLATE22_S)
#define ISP_GAU_TEMPLATE22_V  0x0000000FU
#define ISP_GAU_TEMPLATE22_S  0

