espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_DPC_CTRL_REG register
 *  DPC mode control register
 */
#define ISP_DPC_CTRL_REG (DR_REG_ISP_BASE + 0x38)
/** ISP_DPC_CHECK_EN : R/W; bitpos: [0]; default: 0;
 *  this bit configures the check mode enable. 0: disable, 1: enable
 */
#define ISP_DPC_CHECK_EN    (BIT(0))
#define ISP_DPC_CHECK_EN_M  (ISP_DPC_CHECK_EN_V << ISP_DPC_CHECK_EN_S)
#define ISP_DPC_CHECK_EN_V  0x00000001U
#define ISP_DPC_CHECK_EN_S  0
/** ISP_STA_EN : R/W; bitpos: [1]; default: 0;
 *  this bit configures the sta dpc enable. 0: disable, 1: enable
 */
#define ISP_STA_EN    (BIT(1))
#define ISP_STA_EN_M  (ISP_STA_EN_V << ISP_STA_EN_S)
#define ISP_STA_EN_V  0x00000001U
#define ISP_STA_EN_S  1
/** ISP_DYN_EN : R/W; bitpos: [2]; default: 1;
 *  this bit configures the dyn dpc enable. 0: disable, 1: enable
 */
#define ISP_DYN_EN    (BIT(2))
#define ISP_DYN_EN_M  (ISP_DYN_EN_V << ISP_DYN_EN_S)
#define ISP_DYN_EN_V  0x00000001U
#define ISP_DYN_EN_S  2
/** ISP_DPC_BLACK_EN : R/W; bitpos: [3]; default: 0;
 *  this bit configures input image type select when in check mode, 0: white img, 1:
 *  black img
 */
#define ISP_DPC_BLACK_EN    (BIT(3))
#define ISP_DPC_BLACK_EN_M  (ISP_DPC_BLACK_EN_V << ISP_DPC_BLACK_EN_S)
#define ISP_DPC_BLACK_EN_V  0x00000001U
#define ISP_DPC_BLACK_EN_S  3
/** ISP_DPC_METHOD_SEL : R/W; bitpos: [4]; default: 0;
 *  this bit configures dyn dpc method select. 0: simple method, 1: hard method
 */
#define ISP_DPC_METHOD_SEL    (BIT(4))
#define ISP_DPC_METHOD_SEL_M  (ISP_DPC_METHOD_SEL_V << ISP_DPC_METHOD_SEL_S)
#define ISP_DPC_METHOD_SEL_V  0x00000001U
#define ISP_DPC_METHOD_SEL_S  4
/** ISP_DPC_CHECK_OD_EN : R/W; bitpos: [5]; default: 0;
 *  this bit configures output pixel data when in check mode or not. 0: no data output,
 *  1: data output
 */
#define ISP_DPC_CHECK_OD_EN    (BIT(5))
#define ISP_DPC_CHECK_OD_EN_M  (ISP_DPC_CHECK_OD_EN_V << ISP_DPC_CHECK_OD_EN_S)
#define ISP_DPC_CHECK_OD_EN_V  0x00000001U
#define ISP_DPC_CHECK_OD_EN_S  5

/** ISP_DPC_CONF_REG register
 *  DPC parameter config register
 */
#define ISP_DPC_CONF_REG (DR_REG_ISP_BASE + 0x3c)
/** ISP_DPC_THRESHOLD_L : R/W; bitpos: [7:0]; default: 48;
 *  this bit configures the threshold to detect black img in check mode, or the low
 *  threshold(use 8 bit 0~255) in dyn method 0, or the low threshold factor (use 5 bit
 *  10000-> 16/16, 00001->1/16, 0/16~16/16) in dyn method 1
 */
#define ISP_DPC_THRESHOLD_L    0x000000FFU
#define ISP_DPC_THRESHOLD_L_M  (ISP_DPC_THRESHOLD_L_V << ISP_DPC_THRESHOLD_L_S)
#define ISP_DPC_THRESHOLD_L_V  0x000000FFU
#define ISP_DPC_THRESHOLD_L_S  0
/** ISP_DPC_THRESHOLD_H : R/W; bitpos: [15:8]; default: 48;
 *  this bit configures the threshold to detect white img in check mode, or the high
 *  threshold(use 8 bit 0~255) in dyn method 0, or the high threshold factor (use 5 bit
 *  10000-> 16/16, 00001->1/16, 0/16~16/16) in dyn method 1
 */
#define ISP_DPC_THRESHOLD_H    0x000000FFU
#define ISP_DPC_THRESHOLD_H_M  (ISP_DPC_THRESHOLD_H_V << ISP_DPC_THRESHOLD_H_S)
#define ISP_DPC_THRESHOLD_H_V  0x000000FFU
#define ISP_DPC_THRESHOLD_H_S  8
/** ISP_DPC_FACTOR_DARK : R/W; bitpos: [21:16]; default: 16;
 *  this field configures the dynamic correction method 1 dark   factor
 */
#define ISP_DPC_FACTOR_DARK    0x0000003FU
#define ISP_DPC_FACTOR_DARK_M  (ISP_DPC_FACTOR_DARK_V << ISP_DPC_FACTOR_DARK_S)
#define ISP_DPC_FACTOR_DARK_V  0x0000003FU
#define ISP_DPC_FACTOR_DARK_S  16
/** ISP_DPC_FACTOR_BRIG : R/W; bitpos: [27:22]; default: 16;
 *  this field configures the dynamic correction method 1 bright factor
 */
#define ISP_DPC_FACTOR_BRIG    0x0000003FU
#define ISP_DPC_FACTOR_BRIG_M  (ISP_DPC_FACTOR_BRIG_V << ISP_DPC_FACTOR_BRIG_S)
#define ISP_DPC_FACTOR_BRIG_V  0x0000003FU
#define ISP_DPC_FACTOR_BRIG_S  22

/** ISP_DPC_MATRIX_CTRL_REG register
 *  dpc pix2matrix ctrl
 */
#define ISP_DPC_MATRIX_CTRL_REG (DR_REG_ISP_BASE + 0x40)
/** ISP_DPC_TAIL_PIXEN_PULSE_TL : R/W; bitpos: [7:0]; default: 0;
 *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
 *  next frame, only reg_dpc_tail_pixen_pulse_th!=0 and reg_dpc_tail_pixen_pulse_tl!=0
 *  and reg_dpc_tail_pixen_pulse_th < reg_dpc_tail_pixen_pulse_tl will enable tail
 *  pulse function
 */
#define ISP_DPC_TAIL_PIXEN_PULSE_TL    0x000000FFU
#define ISP_DPC_TAIL_PIXEN_PULSE_TL_M  (ISP_DPC_TAIL_PIXEN_PULSE_TL_V << ISP_DPC_TAIL_PIXEN_PULSE_TL_S)
#define ISP_DPC_TAIL_PIXEN_PULSE_TL_V  0x000000FFU
#define ISP_DPC_TAIL_PIXEN_PULSE_TL_S  0
/** ISP_DPC_TAIL_PIXEN_PULSE_TH : R/W; bitpos: [15:8]; default: 0;
 *  matrix tail pixen high level threshold, must < hnum-1, only
 *  reg_dpc_tail_pixen_pulse_th!=0 and reg_dpc_tail_pixen_pulse_tl!=0 and
 *  reg_dpc_tail_pixen_pulse_th < reg_dpc_tail_pixen_pulse_tl will enable tail pulse
 *  function
 */
#define ISP_DPC_TAIL_PIXEN_PULSE_TH    0x000000FFU
#define ISP_DPC_TAIL_PIXEN_PULSE_TH_M  (ISP_DPC_TAIL_PIXEN_PULSE_TH_V << ISP_DPC_TAIL_PIXEN_PULSE_TH_S)
#define ISP_DPC_TAIL_PIXEN_PULSE_TH_V  0x000000FFU
#define ISP_DPC_TAIL_PIXEN_PULSE_TH_S  8
/** ISP_DPC_PADDING_DATA : R/W; bitpos: [23:16]; default: 0;
 *  this field configures dpc matrix padding data
 */
#define ISP_DPC_PADDING_DATA    0x000000FFU
#define ISP_DPC_PADDING_DATA_M  (ISP_DPC_PADDING_DATA_V << ISP_DPC_PADDING_DATA_S)
#define ISP_DPC_PADDING_DATA_V  0x000000FFU
#define ISP_DPC_PADDING_DATA_S  16
/** ISP_DPC_PADDING_MODE : R/W; bitpos: [24]; default: 0;
 *  this bit configures the padding mode of dpc matrix.  0: use pixel in image to do
 *  padding   1: use reg_padding_data to do padding
 */
#define ISP_DPC_PADDING_MODE    (BIT(24))
#define ISP_DPC_PADDING_MODE_M  (ISP_DPC_PADDING_MODE_V << ISP_DPC_PADDING_MODE_S)
#define ISP_DPC_PADDING_MODE_V  0x00000001U
#define ISP_DPC_PADDING_MODE_S  24

/** ISP_DPC_DEADPIX_CNT_REG register
 *  DPC dead-pix number register
 */
#define ISP_DPC_DEADPIX_CNT_REG (DR_REG_ISP_BASE + 0x44)
/** ISP_DPC_DEADPIX_CNT : RO; bitpos: [9:0]; default: 0;
 *  this field represents the dead pixel count
 */
#define ISP_DPC_DEADPIX_CNT    0x000003FFU
#define ISP_DPC_DEADPIX_CNT_M  (ISP_DPC_DEADPIX_CNT_V << ISP_DPC_DEADPIX_CNT_S)
#define ISP_DPC_DEADPIX_CNT_V  0x000003FFU
#define ISP_DPC_DEADPIX_CNT_S  0

/** ISP_LUT_CMD_REG register
 *  LUT command register
 */
#define ISP_LUT_CMD_REG (DR_REG_ISP_BASE + 0x48)
/** ISP_LUT_ADDR : WT; bitpos: [11:0]; default: 0;
 *  this field configures the lut access addr, when select lsc lut, [11:10]:00 sel gb_b
 *  lut, 01 sel r_gr lut
 */
#define ISP_LUT_ADDR    0x00000FFFU
#define ISP_LUT_ADDR_M  (ISP_LUT_ADDR_V << ISP_LUT_ADDR_S)
#define ISP_LUT_ADDR_V  0x00000FFFU
#define ISP_LUT_ADDR_S  0
/** ISP_LUT_NUM : WT; bitpos: [15:12]; default: 0;
 *  this field configures the lut selection. 0000:LSC LUT 0001:DPC LUT
 */
#define ISP_LUT_NUM    0x0000000FU
#define ISP_LUT_NUM_M  (ISP_LUT_NUM_V << ISP_LUT_NUM_S)
#define ISP_LUT_NUM_V  0x0000000FU
#define ISP_LUT_NUM_S  12
/** ISP_LUT_CMD : WT; bitpos: [16]; default: 0;
 *  this bit configures the access event of lut. 0:rd 1: wr
 */
#define ISP_LUT_CMD    (BIT(16))
#define ISP_LUT_CMD_M  (ISP_LUT_CMD_V << ISP_LUT_CMD_S)
#define ISP_LUT_CMD_V  0x00000001U
#define ISP_LUT_CMD_S  16

/** ISP_LUT_WDATA_REG register
 *  LUT write data register
 */
#define ISP_LUT_WDATA_REG (DR_REG_ISP_BASE + 0x4c)
/** ISP_LUT_WDATA : R/W; bitpos: [31:0]; default: 0;
 *  this field configures the write data of lut. please initial ISP_LUT_WDATA before
 *  write ISP_LUT_CMD register
 */
#define ISP_LUT_WDATA    0xFFFFFFFFU
#define ISP_LUT_WDATA_M  (ISP_LUT_WDATA_V << ISP_LUT_WDATA_S)
#define ISP_LUT_WDATA_V  0xFFFFFFFFU
#define ISP_LUT_WDATA_S  0

