espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_LUT_RDATA_REG register
 *  LUT read data register
 */
#define ISP_LUT_RDATA_REG (DR_REG_ISP_BASE + 0x50)
/** ISP_LUT_RDATA : RO; bitpos: [31:0]; default: 0;
 *  this field represents the read data of lut. read ISP_LUT_RDATA after write
 *  ISP_LUT_CMD register
 */
#define ISP_LUT_RDATA    0xFFFFFFFFU
#define ISP_LUT_RDATA_M  (ISP_LUT_RDATA_V << ISP_LUT_RDATA_S)
#define ISP_LUT_RDATA_V  0xFFFFFFFFU
#define ISP_LUT_RDATA_S  0

/** ISP_LSC_TABLESIZE_REG register
 *  LSC point in x-direction
 */
#define ISP_LSC_TABLESIZE_REG (DR_REG_ISP_BASE + 0x54)
/** ISP_LSC_XTABLESIZE : R/W; bitpos: [4:0]; default: 31;
 *  this field configures lsc table size in x-direction
 */
#define ISP_LSC_XTABLESIZE    0x0000001FU
#define ISP_LSC_XTABLESIZE_M  (ISP_LSC_XTABLESIZE_V << ISP_LSC_XTABLESIZE_S)
#define ISP_LSC_XTABLESIZE_V  0x0000001FU
#define ISP_LSC_XTABLESIZE_S  0

/** ISP_DEMOSAIC_MATRIX_CTRL_REG register
 *  demosaic pix2matrix ctrl
 */
#define ISP_DEMOSAIC_MATRIX_CTRL_REG (DR_REG_ISP_BASE + 0x58)
/** ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL : R/W; bitpos: [7:0]; default: 0;
 *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
 *  next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and
 *  reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th <
 *  reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function
 */
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL    0x000000FFU
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL_M  (ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL_V << ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL_S)
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL_V  0x000000FFU
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TL_S  0
/** ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH : R/W; bitpos: [15:8]; default: 0;
 *  matrix tail pixen high level threshold, must < hnum-1, only
 *  reg_demosaic_tail_pixen_pulse_th!=0 and reg_demosaic_tail_pixen_pulse_tl!=0 and
 *  reg_demosaic_tail_pixen_pulse_th < reg_demosaic_tail_pixen_pulse_tl will enable
 *  tail pulse function
 */
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH    0x000000FFU
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH_M  (ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH_V << ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH_S)
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH_V  0x000000FFU
#define ISP_DEMOSAIC_TAIL_PIXEN_PULSE_TH_S  8
/** ISP_DEMOSAIC_PADDING_DATA : R/W; bitpos: [23:16]; default: 0;
 *  this field configures demosaic matrix padding data
 */
#define ISP_DEMOSAIC_PADDING_DATA    0x000000FFU
#define ISP_DEMOSAIC_PADDING_DATA_M  (ISP_DEMOSAIC_PADDING_DATA_V << ISP_DEMOSAIC_PADDING_DATA_S)
#define ISP_DEMOSAIC_PADDING_DATA_V  0x000000FFU
#define ISP_DEMOSAIC_PADDING_DATA_S  16
/** ISP_DEMOSAIC_PADDING_MODE : R/W; bitpos: [24]; default: 0;
 *  this bit configures the padding mode of demosaic matrix.  0: use pixel in image to
 *  do padding   1: use reg_padding_data to do padding
 */
#define ISP_DEMOSAIC_PADDING_MODE    (BIT(24))
#define ISP_DEMOSAIC_PADDING_MODE_M  (ISP_DEMOSAIC_PADDING_MODE_V << ISP_DEMOSAIC_PADDING_MODE_S)
#define ISP_DEMOSAIC_PADDING_MODE_V  0x00000001U
#define ISP_DEMOSAIC_PADDING_MODE_S  24

/** ISP_DEMOSAIC_GRAD_RATIO_REG register
 *  demosaic gradient select ratio
 */
#define ISP_DEMOSAIC_GRAD_RATIO_REG (DR_REG_ISP_BASE + 0x5c)
/** ISP_DEMOSAIC_GRAD_RATIO : R/W; bitpos: [5:0]; default: 16;
 *  this field configures demosaic gradient select ratio
 */
#define ISP_DEMOSAIC_GRAD_RATIO    0x0000003FU
#define ISP_DEMOSAIC_GRAD_RATIO_M  (ISP_DEMOSAIC_GRAD_RATIO_V << ISP_DEMOSAIC_GRAD_RATIO_S)
#define ISP_DEMOSAIC_GRAD_RATIO_V  0x0000003FU
#define ISP_DEMOSAIC_GRAD_RATIO_S  0

/** ISP_MEDIAN_MATRIX_CTRL_REG register
 *  median pix2matrix ctrl
 */
#define ISP_MEDIAN_MATRIX_CTRL_REG (DR_REG_ISP_BASE + 0x60)
/** ISP_MEDIAN_PADDING_DATA : R/W; bitpos: [7:0]; default: 0;
 *  this field configures median matrix padding data
 */
#define ISP_MEDIAN_PADDING_DATA    0x000000FFU
#define ISP_MEDIAN_PADDING_DATA_M  (ISP_MEDIAN_PADDING_DATA_V << ISP_MEDIAN_PADDING_DATA_S)
#define ISP_MEDIAN_PADDING_DATA_V  0x000000FFU
#define ISP_MEDIAN_PADDING_DATA_S  0
/** ISP_MEDIAN_PADDING_MODE : R/W; bitpos: [8]; default: 0;
 *  this bit configures the padding mode of median matrix.  0: use pixel in image to do
 *  padding   1: use reg_padding_data to do padding
 */
#define ISP_MEDIAN_PADDING_MODE    (BIT(8))
#define ISP_MEDIAN_PADDING_MODE_M  (ISP_MEDIAN_PADDING_MODE_V << ISP_MEDIAN_PADDING_MODE_S)
#define ISP_MEDIAN_PADDING_MODE_V  0x00000001U
#define ISP_MEDIAN_PADDING_MODE_S  8

/** ISP_INT_RAW_REG register
 *  raw interrupt register
 */
#define ISP_INT_RAW_REG (DR_REG_ISP_BASE + 0x64)
/** ISP_ISP_DATA_TYPE_ERR_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  the raw interrupt status of input data type error. isp only support RGB bayer data
 *  type, other type will report type_err_int
 */
#define ISP_ISP_DATA_TYPE_ERR_INT_RAW    (BIT(0))
#define ISP_ISP_DATA_TYPE_ERR_INT_RAW_M  (ISP_ISP_DATA_TYPE_ERR_INT_RAW_V << ISP_ISP_DATA_TYPE_ERR_INT_RAW_S)
#define ISP_ISP_DATA_TYPE_ERR_INT_RAW_V  0x00000001U
#define ISP_ISP_DATA_TYPE_ERR_INT_RAW_S  0
/** ISP_ISP_ASYNC_FIFO_OVF_INT_RAW : R/SS/WTC; bitpos: [1]; default: 0;
 *  the raw interrupt status of isp input fifo overflow
 */
#define ISP_ISP_ASYNC_FIFO_OVF_INT_RAW    (BIT(1))
#define ISP_ISP_ASYNC_FIFO_OVF_INT_RAW_M  (ISP_ISP_ASYNC_FIFO_OVF_INT_RAW_V << ISP_ISP_ASYNC_FIFO_OVF_INT_RAW_S)
#define ISP_ISP_ASYNC_FIFO_OVF_INT_RAW_V  0x00000001U
#define ISP_ISP_ASYNC_FIFO_OVF_INT_RAW_S  1
/** ISP_ISP_BUF_FULL_INT_RAW : R/SS/WTC; bitpos: [2]; default: 0;
 *  the raw interrupt status of isp input buffer full
 */
#define ISP_ISP_BUF_FULL_INT_RAW    (BIT(2))
#define ISP_ISP_BUF_FULL_INT_RAW_M  (ISP_ISP_BUF_FULL_INT_RAW_V << ISP_ISP_BUF_FULL_INT_RAW_S)
#define ISP_ISP_BUF_FULL_INT_RAW_V  0x00000001U
#define ISP_ISP_BUF_FULL_INT_RAW_S  2
/** ISP_ISP_HVNUM_SETTING_ERR_INT_RAW : R/SS/WTC; bitpos: [3]; default: 0;
 *  the raw interrupt status of hnum and vnum setting format error
 */
#define ISP_ISP_HVNUM_SETTING_ERR_INT_RAW    (BIT(3))
#define ISP_ISP_HVNUM_SETTING_ERR_INT_RAW_M  (ISP_ISP_HVNUM_SETTING_ERR_INT_RAW_V << ISP_ISP_HVNUM_SETTING_ERR_INT_RAW_S)
#define ISP_ISP_HVNUM_SETTING_ERR_INT_RAW_V  0x00000001U
#define ISP_ISP_HVNUM_SETTING_ERR_INT_RAW_S  3
/** ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW : R/SS/WTC; bitpos: [4]; default: 0;
 *  the raw interrupt status of setting invalid reg_data_type
 */
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW    (BIT(4))
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW_M  (ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW_V << ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW_S)
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW_V  0x00000001U
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_RAW_S  4
/** ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW : R/SS/WTC; bitpos: [5]; default: 0;
 *  the raw interrupt status of hnum setting unmatch with mipi input
 */
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW    (BIT(5))
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW_M  (ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW_V << ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW_S)
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW_V  0x00000001U
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_RAW_S  5
/** ISP_DPC_CHECK_DONE_INT_RAW : R/SS/WTC; bitpos: [6]; default: 0;
 *  the raw interrupt status of dpc check done
 */
#define ISP_DPC_CHECK_DONE_INT_RAW    (BIT(6))
#define ISP_DPC_CHECK_DONE_INT_RAW_M  (ISP_DPC_CHECK_DONE_INT_RAW_V << ISP_DPC_CHECK_DONE_INT_RAW_S)
#define ISP_DPC_CHECK_DONE_INT_RAW_V  0x00000001U
#define ISP_DPC_CHECK_DONE_INT_RAW_S  6
/** ISP_GAMMA_XCOORD_ERR_INT_RAW : R/SS/WTC; bitpos: [7]; default: 0;
 *  the raw interrupt status of gamma setting error. it report the sum of the lengths
 *  represented by reg_gamma_x00~x0F isn't equal to 256
 */
#define ISP_GAMMA_XCOORD_ERR_INT_RAW    (BIT(7))
#define ISP_GAMMA_XCOORD_ERR_INT_RAW_M  (ISP_GAMMA_XCOORD_ERR_INT_RAW_V << ISP_GAMMA_XCOORD_ERR_INT_RAW_S)
#define ISP_GAMMA_XCOORD_ERR_INT_RAW_V  0x00000001U
#define ISP_GAMMA_XCOORD_ERR_INT_RAW_S  7
/** ISP_AE_MONITOR_INT_RAW : R/SS/WTC; bitpos: [8]; default: 0;
 *  the raw interrupt status of ae monitor
 */
#define ISP_AE_MONITOR_INT_RAW    (BIT(8))
#define ISP_AE_MONITOR_INT_RAW_M  (ISP_AE_MONITOR_INT_RAW_V << ISP_AE_MONITOR_INT_RAW_S)
#define ISP_AE_MONITOR_INT_RAW_V  0x00000001U
#define ISP_AE_MONITOR_INT_RAW_S  8
/** ISP_AE_FRAME_DONE_INT_RAW : R/SS/WTC; bitpos: [9]; default: 0;
 *  the raw interrupt status of ae.
 */
#define ISP_AE_FRAME_DONE_INT_RAW    (BIT(9))
#define ISP_AE_FRAME_DONE_INT_RAW_M  (ISP_AE_FRAME_DONE_INT_RAW_V << ISP_AE_FRAME_DONE_INT_RAW_S)
#define ISP_AE_FRAME_DONE_INT_RAW_V  0x00000001U
#define ISP_AE_FRAME_DONE_INT_RAW_S  9
/** ISP_AF_FDONE_INT_RAW : R/SS/WTC; bitpos: [10]; default: 0;
 *  the raw interrupt status of af statistic. when auto_update enable, each frame done
 *  will send one int pulse when manual_update, each time when write 1 to
 *  reg_manual_update will send a int pulse when next frame done
 */
#define ISP_AF_FDONE_INT_RAW    (BIT(10))
#define ISP_AF_FDONE_INT_RAW_M  (ISP_AF_FDONE_INT_RAW_V << ISP_AF_FDONE_INT_RAW_S)
#define ISP_AF_FDONE_INT_RAW_V  0x00000001U
#define ISP_AF_FDONE_INT_RAW_S  10
/** ISP_AF_ENV_INT_RAW : R/SS/WTC; bitpos: [11]; default: 0;
 *  the raw interrupt status of af monitor. send a int pulse when env_det function
 *  enabled and environment changes detected
 */
#define ISP_AF_ENV_INT_RAW    (BIT(11))
#define ISP_AF_ENV_INT_RAW_M  (ISP_AF_ENV_INT_RAW_V << ISP_AF_ENV_INT_RAW_S)
#define ISP_AF_ENV_INT_RAW_V  0x00000001U
#define ISP_AF_ENV_INT_RAW_S  11
/** ISP_AWB_FDONE_INT_RAW : R/SS/WTC; bitpos: [12]; default: 0;
 *  the raw interrupt status of awb. send a int pulse when statistic of one awb frame
 *  done
 */
#define ISP_AWB_FDONE_INT_RAW    (BIT(12))
#define ISP_AWB_FDONE_INT_RAW_M  (ISP_AWB_FDONE_INT_RAW_V << ISP_AWB_FDONE_INT_RAW_S)
#define ISP_AWB_FDONE_INT_RAW_V  0x00000001U
#define ISP_AWB_FDONE_INT_RAW_S  12
/** ISP_HIST_FDONE_INT_RAW : R/SS/WTC; bitpos: [13]; default: 0;
 *  the raw interrupt status of histogram. send a int pulse when statistic of one frame
 *  histogram done
 */
#define ISP_HIST_FDONE_INT_RAW    (BIT(13))
#define ISP_HIST_FDONE_INT_RAW_M  (ISP_HIST_FDONE_INT_RAW_V << ISP_HIST_FDONE_INT_RAW_S)
#define ISP_HIST_FDONE_INT_RAW_V  0x00000001U
#define ISP_HIST_FDONE_INT_RAW_S  13
/** ISP_FRAME_INT_RAW : R/SS/WTC; bitpos: [14]; default: 0;
 *  the raw interrupt status of isp frame end
 */
#define ISP_FRAME_INT_RAW    (BIT(14))
#define ISP_FRAME_INT_RAW_M  (ISP_FRAME_INT_RAW_V << ISP_FRAME_INT_RAW_S)
#define ISP_FRAME_INT_RAW_V  0x00000001U
#define ISP_FRAME_INT_RAW_S  14
/** ISP_BLC_FRAME_INT_RAW : R/SS/WTC; bitpos: [15]; default: 0;
 *  the raw interrupt status of blc frame done
 */
#define ISP_BLC_FRAME_INT_RAW    (BIT(15))
#define ISP_BLC_FRAME_INT_RAW_M  (ISP_BLC_FRAME_INT_RAW_V << ISP_BLC_FRAME_INT_RAW_S)
#define ISP_BLC_FRAME_INT_RAW_V  0x00000001U
#define ISP_BLC_FRAME_INT_RAW_S  15
/** ISP_LSC_FRAME_INT_RAW : R/SS/WTC; bitpos: [16]; default: 0;
 *  the raw interrupt status of lsc frame done
 */
#define ISP_LSC_FRAME_INT_RAW    (BIT(16))
#define ISP_LSC_FRAME_INT_RAW_M  (ISP_LSC_FRAME_INT_RAW_V << ISP_LSC_FRAME_INT_RAW_S)
#define ISP_LSC_FRAME_INT_RAW_V  0x00000001U
#define ISP_LSC_FRAME_INT_RAW_S  16
/** ISP_DPC_FRAME_INT_RAW : R/SS/WTC; bitpos: [17]; default: 0;
 *  the raw interrupt status of dpc frame done
 */
#define ISP_DPC_FRAME_INT_RAW    (BIT(17))
#define ISP_DPC_FRAME_INT_RAW_M  (ISP_DPC_FRAME_INT_RAW_V << ISP_DPC_FRAME_INT_RAW_S)
#define ISP_DPC_FRAME_INT_RAW_V  0x00000001U
#define ISP_DPC_FRAME_INT_RAW_S  17
/** ISP_BF_FRAME_INT_RAW : R/SS/WTC; bitpos: [18]; default: 0;
 *  the raw interrupt status of bf frame done
 */
#define ISP_BF_FRAME_INT_RAW    (BIT(18))
#define ISP_BF_FRAME_INT_RAW_M  (ISP_BF_FRAME_INT_RAW_V << ISP_BF_FRAME_INT_RAW_S)
#define ISP_BF_FRAME_INT_RAW_V  0x00000001U
#define ISP_BF_FRAME_INT_RAW_S  18
/** ISP_DEMOSAIC_FRAME_INT_RAW : R/SS/WTC; bitpos: [19]; default: 0;
 *  the raw interrupt status of demosaic frame done
 */
#define ISP_DEMOSAIC_FRAME_INT_RAW    (BIT(19))
#define ISP_DEMOSAIC_FRAME_INT_RAW_M  (ISP_DEMOSAIC_FRAME_INT_RAW_V << ISP_DEMOSAIC_FRAME_INT_RAW_S)
#define ISP_DEMOSAIC_FRAME_INT_RAW_V  0x00000001U
#define ISP_DEMOSAIC_FRAME_INT_RAW_S  19
/** ISP_MEDIAN_FRAME_INT_RAW : R/SS/WTC; bitpos: [20]; default: 0;
 *  the raw interrupt status of median frame done
 */
#define ISP_MEDIAN_FRAME_INT_RAW    (BIT(20))
#define ISP_MEDIAN_FRAME_INT_RAW_M  (ISP_MEDIAN_FRAME_INT_RAW_V << ISP_MEDIAN_FRAME_INT_RAW_S)
#define ISP_MEDIAN_FRAME_INT_RAW_V  0x00000001U
#define ISP_MEDIAN_FRAME_INT_RAW_S  20
/** ISP_CCM_FRAME_INT_RAW : R/SS/WTC; bitpos: [21]; default: 0;
 *  the raw interrupt status of ccm frame done
 */
#define ISP_CCM_FRAME_INT_RAW    (BIT(21))
#define ISP_CCM_FRAME_INT_RAW_M  (ISP_CCM_FRAME_INT_RAW_V << ISP_CCM_FRAME_INT_RAW_S)
#define ISP_CCM_FRAME_INT_RAW_V  0x00000001U
#define ISP_CCM_FRAME_INT_RAW_S  21
/** ISP_GAMMA_FRAME_INT_RAW : R/SS/WTC; bitpos: [22]; default: 0;
 *  the raw interrupt status of gamma frame done
 */
#define ISP_GAMMA_FRAME_INT_RAW    (BIT(22))
#define ISP_GAMMA_FRAME_INT_RAW_M  (ISP_GAMMA_FRAME_INT_RAW_V << ISP_GAMMA_FRAME_INT_RAW_S)
#define ISP_GAMMA_FRAME_INT_RAW_V  0x00000001U
#define ISP_GAMMA_FRAME_INT_RAW_S  22
/** ISP_RGB2YUV_FRAME_INT_RAW : R/SS/WTC; bitpos: [23]; default: 0;
 *  the raw interrupt status of rgb2yuv frame done
 */
#define ISP_RGB2YUV_FRAME_INT_RAW    (BIT(23))
#define ISP_RGB2YUV_FRAME_INT_RAW_M  (ISP_RGB2YUV_FRAME_INT_RAW_V << ISP_RGB2YUV_FRAME_INT_RAW_S)
#define ISP_RGB2YUV_FRAME_INT_RAW_V  0x00000001U
#define ISP_RGB2YUV_FRAME_INT_RAW_S  23
/** ISP_SHARP_FRAME_INT_RAW : R/SS/WTC; bitpos: [24]; default: 0;
 *  the raw interrupt status of sharp frame done
 */
#define ISP_SHARP_FRAME_INT_RAW    (BIT(24))
#define ISP_SHARP_FRAME_INT_RAW_M  (ISP_SHARP_FRAME_INT_RAW_V << ISP_SHARP_FRAME_INT_RAW_S)
#define ISP_SHARP_FRAME_INT_RAW_V  0x00000001U
#define ISP_SHARP_FRAME_INT_RAW_S  24
/** ISP_COLOR_FRAME_INT_RAW : R/SS/WTC; bitpos: [25]; default: 0;
 *  the raw interrupt status of color frame done
 */
#define ISP_COLOR_FRAME_INT_RAW    (BIT(25))
#define ISP_COLOR_FRAME_INT_RAW_M  (ISP_COLOR_FRAME_INT_RAW_V << ISP_COLOR_FRAME_INT_RAW_S)
#define ISP_COLOR_FRAME_INT_RAW_V  0x00000001U
#define ISP_COLOR_FRAME_INT_RAW_S  25
/** ISP_YUV2RGB_FRAME_INT_RAW : R/SS/WTC; bitpos: [26]; default: 0;
 *  the raw interrupt status of yuv2rgb frame done
 */
#define ISP_YUV2RGB_FRAME_INT_RAW    (BIT(26))
#define ISP_YUV2RGB_FRAME_INT_RAW_M  (ISP_YUV2RGB_FRAME_INT_RAW_V << ISP_YUV2RGB_FRAME_INT_RAW_S)
#define ISP_YUV2RGB_FRAME_INT_RAW_V  0x00000001U
#define ISP_YUV2RGB_FRAME_INT_RAW_S  26
/** ISP_TAIL_IDI_FRAME_INT_RAW : R/SS/WTC; bitpos: [27]; default: 0;
 *  the raw interrupt status of isp_tail idi frame_end
 */
#define ISP_TAIL_IDI_FRAME_INT_RAW    (BIT(27))
#define ISP_TAIL_IDI_FRAME_INT_RAW_M  (ISP_TAIL_IDI_FRAME_INT_RAW_V << ISP_TAIL_IDI_FRAME_INT_RAW_S)
#define ISP_TAIL_IDI_FRAME_INT_RAW_V  0x00000001U
#define ISP_TAIL_IDI_FRAME_INT_RAW_S  27
/** ISP_HEADER_IDI_FRAME_INT_RAW : R/SS/WTC; bitpos: [28]; default: 0;
 *  the raw interrupt status of real input frame end of isp_input
 */
#define ISP_HEADER_IDI_FRAME_INT_RAW    (BIT(28))
#define ISP_HEADER_IDI_FRAME_INT_RAW_M  (ISP_HEADER_IDI_FRAME_INT_RAW_V << ISP_HEADER_IDI_FRAME_INT_RAW_S)
#define ISP_HEADER_IDI_FRAME_INT_RAW_V  0x00000001U
#define ISP_HEADER_IDI_FRAME_INT_RAW_S  28

