espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_INT_ST_REG register
 *  masked interrupt register
 */
#define ISP_INT_ST_REG (DR_REG_ISP_BASE + 0x68)
/** ISP_ISP_DATA_TYPE_ERR_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of input data type error
 */
#define ISP_ISP_DATA_TYPE_ERR_INT_ST    (BIT(0))
#define ISP_ISP_DATA_TYPE_ERR_INT_ST_M  (ISP_ISP_DATA_TYPE_ERR_INT_ST_V << ISP_ISP_DATA_TYPE_ERR_INT_ST_S)
#define ISP_ISP_DATA_TYPE_ERR_INT_ST_V  0x00000001U
#define ISP_ISP_DATA_TYPE_ERR_INT_ST_S  0
/** ISP_ISP_ASYNC_FIFO_OVF_INT_ST : RO; bitpos: [1]; default: 0;
 *  the masked interrupt status of isp input fifo overflow
 */
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ST    (BIT(1))
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ST_M  (ISP_ISP_ASYNC_FIFO_OVF_INT_ST_V << ISP_ISP_ASYNC_FIFO_OVF_INT_ST_S)
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ST_V  0x00000001U
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ST_S  1
/** ISP_ISP_BUF_FULL_INT_ST : RO; bitpos: [2]; default: 0;
 *  the masked interrupt status of isp input buffer full
 */
#define ISP_ISP_BUF_FULL_INT_ST    (BIT(2))
#define ISP_ISP_BUF_FULL_INT_ST_M  (ISP_ISP_BUF_FULL_INT_ST_V << ISP_ISP_BUF_FULL_INT_ST_S)
#define ISP_ISP_BUF_FULL_INT_ST_V  0x00000001U
#define ISP_ISP_BUF_FULL_INT_ST_S  2
/** ISP_ISP_HVNUM_SETTING_ERR_INT_ST : RO; bitpos: [3]; default: 0;
 *  the masked interrupt status of hnum and vnum setting format error
 */
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ST    (BIT(3))
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ST_M  (ISP_ISP_HVNUM_SETTING_ERR_INT_ST_V << ISP_ISP_HVNUM_SETTING_ERR_INT_ST_S)
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ST_V  0x00000001U
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ST_S  3
/** ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST : RO; bitpos: [4]; default: 0;
 *  the masked interrupt status of setting invalid reg_data_type
 */
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST    (BIT(4))
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST_M  (ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST_V << ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST_S)
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST_V  0x00000001U
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ST_S  4
/** ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST : RO; bitpos: [5]; default: 0;
 *  the masked interrupt status of hnum setting unmatch with mipi input
 */
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST    (BIT(5))
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST_M  (ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST_V << ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST_S)
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST_V  0x00000001U
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ST_S  5
/** ISP_DPC_CHECK_DONE_INT_ST : RO; bitpos: [6]; default: 0;
 *  the masked interrupt status of dpc check done
 */
#define ISP_DPC_CHECK_DONE_INT_ST    (BIT(6))
#define ISP_DPC_CHECK_DONE_INT_ST_M  (ISP_DPC_CHECK_DONE_INT_ST_V << ISP_DPC_CHECK_DONE_INT_ST_S)
#define ISP_DPC_CHECK_DONE_INT_ST_V  0x00000001U
#define ISP_DPC_CHECK_DONE_INT_ST_S  6
/** ISP_GAMMA_XCOORD_ERR_INT_ST : RO; bitpos: [7]; default: 0;
 *  the masked interrupt status of gamma setting error
 */
#define ISP_GAMMA_XCOORD_ERR_INT_ST    (BIT(7))
#define ISP_GAMMA_XCOORD_ERR_INT_ST_M  (ISP_GAMMA_XCOORD_ERR_INT_ST_V << ISP_GAMMA_XCOORD_ERR_INT_ST_S)
#define ISP_GAMMA_XCOORD_ERR_INT_ST_V  0x00000001U
#define ISP_GAMMA_XCOORD_ERR_INT_ST_S  7
/** ISP_AE_MONITOR_INT_ST : RO; bitpos: [8]; default: 0;
 *  the masked interrupt status of ae monitor
 */
#define ISP_AE_MONITOR_INT_ST    (BIT(8))
#define ISP_AE_MONITOR_INT_ST_M  (ISP_AE_MONITOR_INT_ST_V << ISP_AE_MONITOR_INT_ST_S)
#define ISP_AE_MONITOR_INT_ST_V  0x00000001U
#define ISP_AE_MONITOR_INT_ST_S  8
/** ISP_AE_FRAME_DONE_INT_ST : RO; bitpos: [9]; default: 0;
 *  the masked interrupt status of ae
 */
#define ISP_AE_FRAME_DONE_INT_ST    (BIT(9))
#define ISP_AE_FRAME_DONE_INT_ST_M  (ISP_AE_FRAME_DONE_INT_ST_V << ISP_AE_FRAME_DONE_INT_ST_S)
#define ISP_AE_FRAME_DONE_INT_ST_V  0x00000001U
#define ISP_AE_FRAME_DONE_INT_ST_S  9
/** ISP_AF_FDONE_INT_ST : RO; bitpos: [10]; default: 0;
 *  the masked interrupt status of af statistic
 */
#define ISP_AF_FDONE_INT_ST    (BIT(10))
#define ISP_AF_FDONE_INT_ST_M  (ISP_AF_FDONE_INT_ST_V << ISP_AF_FDONE_INT_ST_S)
#define ISP_AF_FDONE_INT_ST_V  0x00000001U
#define ISP_AF_FDONE_INT_ST_S  10
/** ISP_AF_ENV_INT_ST : RO; bitpos: [11]; default: 0;
 *  the masked interrupt status of af monitor
 */
#define ISP_AF_ENV_INT_ST    (BIT(11))
#define ISP_AF_ENV_INT_ST_M  (ISP_AF_ENV_INT_ST_V << ISP_AF_ENV_INT_ST_S)
#define ISP_AF_ENV_INT_ST_V  0x00000001U
#define ISP_AF_ENV_INT_ST_S  11
/** ISP_AWB_FDONE_INT_ST : RO; bitpos: [12]; default: 0;
 *  the masked interrupt status of awb
 */
#define ISP_AWB_FDONE_INT_ST    (BIT(12))
#define ISP_AWB_FDONE_INT_ST_M  (ISP_AWB_FDONE_INT_ST_V << ISP_AWB_FDONE_INT_ST_S)
#define ISP_AWB_FDONE_INT_ST_V  0x00000001U
#define ISP_AWB_FDONE_INT_ST_S  12
/** ISP_HIST_FDONE_INT_ST : RO; bitpos: [13]; default: 0;
 *  the masked interrupt status of histogram
 */
#define ISP_HIST_FDONE_INT_ST    (BIT(13))
#define ISP_HIST_FDONE_INT_ST_M  (ISP_HIST_FDONE_INT_ST_V << ISP_HIST_FDONE_INT_ST_S)
#define ISP_HIST_FDONE_INT_ST_V  0x00000001U
#define ISP_HIST_FDONE_INT_ST_S  13
/** ISP_FRAME_INT_ST : RO; bitpos: [14]; default: 0;
 *  the masked interrupt status of isp frame end
 */
#define ISP_FRAME_INT_ST    (BIT(14))
#define ISP_FRAME_INT_ST_M  (ISP_FRAME_INT_ST_V << ISP_FRAME_INT_ST_S)
#define ISP_FRAME_INT_ST_V  0x00000001U
#define ISP_FRAME_INT_ST_S  14
/** ISP_BLC_FRAME_INT_ST : RO; bitpos: [15]; default: 0;
 *  the masked interrupt status of blc frame done
 */
#define ISP_BLC_FRAME_INT_ST    (BIT(15))
#define ISP_BLC_FRAME_INT_ST_M  (ISP_BLC_FRAME_INT_ST_V << ISP_BLC_FRAME_INT_ST_S)
#define ISP_BLC_FRAME_INT_ST_V  0x00000001U
#define ISP_BLC_FRAME_INT_ST_S  15
/** ISP_LSC_FRAME_INT_ST : RO; bitpos: [16]; default: 0;
 *  the masked interrupt status of lsc frame done
 */
#define ISP_LSC_FRAME_INT_ST    (BIT(16))
#define ISP_LSC_FRAME_INT_ST_M  (ISP_LSC_FRAME_INT_ST_V << ISP_LSC_FRAME_INT_ST_S)
#define ISP_LSC_FRAME_INT_ST_V  0x00000001U
#define ISP_LSC_FRAME_INT_ST_S  16
/** ISP_DPC_FRAME_INT_ST : RO; bitpos: [17]; default: 0;
 *  the masked interrupt status of dpc frame done
 */
#define ISP_DPC_FRAME_INT_ST    (BIT(17))
#define ISP_DPC_FRAME_INT_ST_M  (ISP_DPC_FRAME_INT_ST_V << ISP_DPC_FRAME_INT_ST_S)
#define ISP_DPC_FRAME_INT_ST_V  0x00000001U
#define ISP_DPC_FRAME_INT_ST_S  17
/** ISP_BF_FRAME_INT_ST : RO; bitpos: [18]; default: 0;
 *  the masked interrupt status of bf frame done
 */
#define ISP_BF_FRAME_INT_ST    (BIT(18))
#define ISP_BF_FRAME_INT_ST_M  (ISP_BF_FRAME_INT_ST_V << ISP_BF_FRAME_INT_ST_S)
#define ISP_BF_FRAME_INT_ST_V  0x00000001U
#define ISP_BF_FRAME_INT_ST_S  18
/** ISP_DEMOSAIC_FRAME_INT_ST : RO; bitpos: [19]; default: 0;
 *  the masked interrupt status of demosaic frame done
 */
#define ISP_DEMOSAIC_FRAME_INT_ST    (BIT(19))
#define ISP_DEMOSAIC_FRAME_INT_ST_M  (ISP_DEMOSAIC_FRAME_INT_ST_V << ISP_DEMOSAIC_FRAME_INT_ST_S)
#define ISP_DEMOSAIC_FRAME_INT_ST_V  0x00000001U
#define ISP_DEMOSAIC_FRAME_INT_ST_S  19
/** ISP_MEDIAN_FRAME_INT_ST : RO; bitpos: [20]; default: 0;
 *  the masked interrupt status of median frame done
 */
#define ISP_MEDIAN_FRAME_INT_ST    (BIT(20))
#define ISP_MEDIAN_FRAME_INT_ST_M  (ISP_MEDIAN_FRAME_INT_ST_V << ISP_MEDIAN_FRAME_INT_ST_S)
#define ISP_MEDIAN_FRAME_INT_ST_V  0x00000001U
#define ISP_MEDIAN_FRAME_INT_ST_S  20
/** ISP_CCM_FRAME_INT_ST : RO; bitpos: [21]; default: 0;
 *  the masked interrupt status of ccm frame done
 */
#define ISP_CCM_FRAME_INT_ST    (BIT(21))
#define ISP_CCM_FRAME_INT_ST_M  (ISP_CCM_FRAME_INT_ST_V << ISP_CCM_FRAME_INT_ST_S)
#define ISP_CCM_FRAME_INT_ST_V  0x00000001U
#define ISP_CCM_FRAME_INT_ST_S  21
/** ISP_GAMMA_FRAME_INT_ST : RO; bitpos: [22]; default: 0;
 *  the masked interrupt status of gamma frame done
 */
#define ISP_GAMMA_FRAME_INT_ST    (BIT(22))
#define ISP_GAMMA_FRAME_INT_ST_M  (ISP_GAMMA_FRAME_INT_ST_V << ISP_GAMMA_FRAME_INT_ST_S)
#define ISP_GAMMA_FRAME_INT_ST_V  0x00000001U
#define ISP_GAMMA_FRAME_INT_ST_S  22
/** ISP_RGB2YUV_FRAME_INT_ST : RO; bitpos: [23]; default: 0;
 *  the masked interrupt status of rgb2yuv frame done
 */
#define ISP_RGB2YUV_FRAME_INT_ST    (BIT(23))
#define ISP_RGB2YUV_FRAME_INT_ST_M  (ISP_RGB2YUV_FRAME_INT_ST_V << ISP_RGB2YUV_FRAME_INT_ST_S)
#define ISP_RGB2YUV_FRAME_INT_ST_V  0x00000001U
#define ISP_RGB2YUV_FRAME_INT_ST_S  23
/** ISP_SHARP_FRAME_INT_ST : RO; bitpos: [24]; default: 0;
 *  the masked interrupt status of sharp frame done
 */
#define ISP_SHARP_FRAME_INT_ST    (BIT(24))
#define ISP_SHARP_FRAME_INT_ST_M  (ISP_SHARP_FRAME_INT_ST_V << ISP_SHARP_FRAME_INT_ST_S)
#define ISP_SHARP_FRAME_INT_ST_V  0x00000001U
#define ISP_SHARP_FRAME_INT_ST_S  24
/** ISP_COLOR_FRAME_INT_ST : RO; bitpos: [25]; default: 0;
 *  the masked interrupt status of color frame done
 */
#define ISP_COLOR_FRAME_INT_ST    (BIT(25))
#define ISP_COLOR_FRAME_INT_ST_M  (ISP_COLOR_FRAME_INT_ST_V << ISP_COLOR_FRAME_INT_ST_S)
#define ISP_COLOR_FRAME_INT_ST_V  0x00000001U
#define ISP_COLOR_FRAME_INT_ST_S  25
/** ISP_YUV2RGB_FRAME_INT_ST : RO; bitpos: [26]; default: 0;
 *  the masked interrupt status of yuv2rgb frame done
 */
#define ISP_YUV2RGB_FRAME_INT_ST    (BIT(26))
#define ISP_YUV2RGB_FRAME_INT_ST_M  (ISP_YUV2RGB_FRAME_INT_ST_V << ISP_YUV2RGB_FRAME_INT_ST_S)
#define ISP_YUV2RGB_FRAME_INT_ST_V  0x00000001U
#define ISP_YUV2RGB_FRAME_INT_ST_S  26
/** ISP_TAIL_IDI_FRAME_INT_ST : RO; bitpos: [27]; default: 0;
 *  the masked interrupt status of isp_tail idi frame_end
 */
#define ISP_TAIL_IDI_FRAME_INT_ST    (BIT(27))
#define ISP_TAIL_IDI_FRAME_INT_ST_M  (ISP_TAIL_IDI_FRAME_INT_ST_V << ISP_TAIL_IDI_FRAME_INT_ST_S)
#define ISP_TAIL_IDI_FRAME_INT_ST_V  0x00000001U
#define ISP_TAIL_IDI_FRAME_INT_ST_S  27
/** ISP_HEADER_IDI_FRAME_INT_ST : RO; bitpos: [28]; default: 0;
 *  the masked interrupt status of real input frame end of isp_input
 */
#define ISP_HEADER_IDI_FRAME_INT_ST    (BIT(28))
#define ISP_HEADER_IDI_FRAME_INT_ST_M  (ISP_HEADER_IDI_FRAME_INT_ST_V << ISP_HEADER_IDI_FRAME_INT_ST_S)
#define ISP_HEADER_IDI_FRAME_INT_ST_V  0x00000001U
#define ISP_HEADER_IDI_FRAME_INT_ST_S  28

/** ISP_INT_ENA_REG register
 *  interrupt enable register
 */
#define ISP_INT_ENA_REG (DR_REG_ISP_BASE + 0x6c)
/** ISP_ISP_DATA_TYPE_ERR_INT_ENA : R/W; bitpos: [0]; default: 1;
 *  write 1 to enable input data type error
 */
#define ISP_ISP_DATA_TYPE_ERR_INT_ENA    (BIT(0))
#define ISP_ISP_DATA_TYPE_ERR_INT_ENA_M  (ISP_ISP_DATA_TYPE_ERR_INT_ENA_V << ISP_ISP_DATA_TYPE_ERR_INT_ENA_S)
#define ISP_ISP_DATA_TYPE_ERR_INT_ENA_V  0x00000001U
#define ISP_ISP_DATA_TYPE_ERR_INT_ENA_S  0
/** ISP_ISP_ASYNC_FIFO_OVF_INT_ENA : R/W; bitpos: [1]; default: 1;
 *  write 1 to enable isp input fifo overflow
 */
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ENA    (BIT(1))
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ENA_M  (ISP_ISP_ASYNC_FIFO_OVF_INT_ENA_V << ISP_ISP_ASYNC_FIFO_OVF_INT_ENA_S)
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ENA_V  0x00000001U
#define ISP_ISP_ASYNC_FIFO_OVF_INT_ENA_S  1
/** ISP_ISP_BUF_FULL_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  write 1 to enable isp input buffer full
 */
#define ISP_ISP_BUF_FULL_INT_ENA    (BIT(2))
#define ISP_ISP_BUF_FULL_INT_ENA_M  (ISP_ISP_BUF_FULL_INT_ENA_V << ISP_ISP_BUF_FULL_INT_ENA_S)
#define ISP_ISP_BUF_FULL_INT_ENA_V  0x00000001U
#define ISP_ISP_BUF_FULL_INT_ENA_S  2
/** ISP_ISP_HVNUM_SETTING_ERR_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  write 1 to enable hnum and vnum setting format error
 */
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ENA    (BIT(3))
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ENA_M  (ISP_ISP_HVNUM_SETTING_ERR_INT_ENA_V << ISP_ISP_HVNUM_SETTING_ERR_INT_ENA_S)
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ENA_V  0x00000001U
#define ISP_ISP_HVNUM_SETTING_ERR_INT_ENA_S  3
/** ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  write 1 to enable setting invalid reg_data_type
 */
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA    (BIT(4))
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA_M  (ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA_V << ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA_S)
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA_V  0x00000001U
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_ENA_S  4
/** ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  write 1 to enable hnum setting unmatch with mipi input
 */
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA    (BIT(5))
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA_M  (ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA_V << ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA_S)
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA_V  0x00000001U
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_ENA_S  5
/** ISP_DPC_CHECK_DONE_INT_ENA : R/W; bitpos: [6]; default: 1;
 *  write 1 to enable dpc check done
 */
#define ISP_DPC_CHECK_DONE_INT_ENA    (BIT(6))
#define ISP_DPC_CHECK_DONE_INT_ENA_M  (ISP_DPC_CHECK_DONE_INT_ENA_V << ISP_DPC_CHECK_DONE_INT_ENA_S)
#define ISP_DPC_CHECK_DONE_INT_ENA_V  0x00000001U
#define ISP_DPC_CHECK_DONE_INT_ENA_S  6
/** ISP_GAMMA_XCOORD_ERR_INT_ENA : R/W; bitpos: [7]; default: 1;
 *  write 1 to enable gamma setting error
 */
#define ISP_GAMMA_XCOORD_ERR_INT_ENA    (BIT(7))
#define ISP_GAMMA_XCOORD_ERR_INT_ENA_M  (ISP_GAMMA_XCOORD_ERR_INT_ENA_V << ISP_GAMMA_XCOORD_ERR_INT_ENA_S)
#define ISP_GAMMA_XCOORD_ERR_INT_ENA_V  0x00000001U
#define ISP_GAMMA_XCOORD_ERR_INT_ENA_S  7
/** ISP_AE_MONITOR_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  write 1 to enable ae monitor
 */
#define ISP_AE_MONITOR_INT_ENA    (BIT(8))
#define ISP_AE_MONITOR_INT_ENA_M  (ISP_AE_MONITOR_INT_ENA_V << ISP_AE_MONITOR_INT_ENA_S)
#define ISP_AE_MONITOR_INT_ENA_V  0x00000001U
#define ISP_AE_MONITOR_INT_ENA_S  8
/** ISP_AE_FRAME_DONE_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  write 1 to enable ae
 */
#define ISP_AE_FRAME_DONE_INT_ENA    (BIT(9))
#define ISP_AE_FRAME_DONE_INT_ENA_M  (ISP_AE_FRAME_DONE_INT_ENA_V << ISP_AE_FRAME_DONE_INT_ENA_S)
#define ISP_AE_FRAME_DONE_INT_ENA_V  0x00000001U
#define ISP_AE_FRAME_DONE_INT_ENA_S  9
/** ISP_AF_FDONE_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  write 1 to enable af statistic
 */
#define ISP_AF_FDONE_INT_ENA    (BIT(10))
#define ISP_AF_FDONE_INT_ENA_M  (ISP_AF_FDONE_INT_ENA_V << ISP_AF_FDONE_INT_ENA_S)
#define ISP_AF_FDONE_INT_ENA_V  0x00000001U
#define ISP_AF_FDONE_INT_ENA_S  10
/** ISP_AF_ENV_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  write 1 to enable af monitor
 */
#define ISP_AF_ENV_INT_ENA    (BIT(11))
#define ISP_AF_ENV_INT_ENA_M  (ISP_AF_ENV_INT_ENA_V << ISP_AF_ENV_INT_ENA_S)
#define ISP_AF_ENV_INT_ENA_V  0x00000001U
#define ISP_AF_ENV_INT_ENA_S  11
/** ISP_AWB_FDONE_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  write 1 to enable awb
 */
#define ISP_AWB_FDONE_INT_ENA    (BIT(12))
#define ISP_AWB_FDONE_INT_ENA_M  (ISP_AWB_FDONE_INT_ENA_V << ISP_AWB_FDONE_INT_ENA_S)
#define ISP_AWB_FDONE_INT_ENA_V  0x00000001U
#define ISP_AWB_FDONE_INT_ENA_S  12
/** ISP_HIST_FDONE_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  write 1 to enable histogram
 */
#define ISP_HIST_FDONE_INT_ENA    (BIT(13))
#define ISP_HIST_FDONE_INT_ENA_M  (ISP_HIST_FDONE_INT_ENA_V << ISP_HIST_FDONE_INT_ENA_S)
#define ISP_HIST_FDONE_INT_ENA_V  0x00000001U
#define ISP_HIST_FDONE_INT_ENA_S  13
/** ISP_FRAME_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  write 1 to enable isp frame end
 */
#define ISP_FRAME_INT_ENA    (BIT(14))
#define ISP_FRAME_INT_ENA_M  (ISP_FRAME_INT_ENA_V << ISP_FRAME_INT_ENA_S)
#define ISP_FRAME_INT_ENA_V  0x00000001U
#define ISP_FRAME_INT_ENA_S  14
/** ISP_BLC_FRAME_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  write 1 to enable blc frame done
 */
#define ISP_BLC_FRAME_INT_ENA    (BIT(15))
#define ISP_BLC_FRAME_INT_ENA_M  (ISP_BLC_FRAME_INT_ENA_V << ISP_BLC_FRAME_INT_ENA_S)
#define ISP_BLC_FRAME_INT_ENA_V  0x00000001U
#define ISP_BLC_FRAME_INT_ENA_S  15
/** ISP_LSC_FRAME_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  write 1 to enable lsc frame done
 */
#define ISP_LSC_FRAME_INT_ENA    (BIT(16))
#define ISP_LSC_FRAME_INT_ENA_M  (ISP_LSC_FRAME_INT_ENA_V << ISP_LSC_FRAME_INT_ENA_S)
#define ISP_LSC_FRAME_INT_ENA_V  0x00000001U
#define ISP_LSC_FRAME_INT_ENA_S  16
/** ISP_DPC_FRAME_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  write 1 to enable dpc frame done
 */
#define ISP_DPC_FRAME_INT_ENA    (BIT(17))
#define ISP_DPC_FRAME_INT_ENA_M  (ISP_DPC_FRAME_INT_ENA_V << ISP_DPC_FRAME_INT_ENA_S)
#define ISP_DPC_FRAME_INT_ENA_V  0x00000001U
#define ISP_DPC_FRAME_INT_ENA_S  17
/** ISP_BF_FRAME_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  write 1 to enable bf frame done
 */
#define ISP_BF_FRAME_INT_ENA    (BIT(18))
#define ISP_BF_FRAME_INT_ENA_M  (ISP_BF_FRAME_INT_ENA_V << ISP_BF_FRAME_INT_ENA_S)
#define ISP_BF_FRAME_INT_ENA_V  0x00000001U
#define ISP_BF_FRAME_INT_ENA_S  18
/** ISP_DEMOSAIC_FRAME_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  write 1 to enable demosaic frame done
 */
#define ISP_DEMOSAIC_FRAME_INT_ENA    (BIT(19))
#define ISP_DEMOSAIC_FRAME_INT_ENA_M  (ISP_DEMOSAIC_FRAME_INT_ENA_V << ISP_DEMOSAIC_FRAME_INT_ENA_S)
#define ISP_DEMOSAIC_FRAME_INT_ENA_V  0x00000001U
#define ISP_DEMOSAIC_FRAME_INT_ENA_S  19
/** ISP_MEDIAN_FRAME_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  write 1 to enable median frame done
 */
#define ISP_MEDIAN_FRAME_INT_ENA    (BIT(20))
#define ISP_MEDIAN_FRAME_INT_ENA_M  (ISP_MEDIAN_FRAME_INT_ENA_V << ISP_MEDIAN_FRAME_INT_ENA_S)
#define ISP_MEDIAN_FRAME_INT_ENA_V  0x00000001U
#define ISP_MEDIAN_FRAME_INT_ENA_S  20
/** ISP_CCM_FRAME_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  write 1 to enable ccm frame done
 */
#define ISP_CCM_FRAME_INT_ENA    (BIT(21))
#define ISP_CCM_FRAME_INT_ENA_M  (ISP_CCM_FRAME_INT_ENA_V << ISP_CCM_FRAME_INT_ENA_S)
#define ISP_CCM_FRAME_INT_ENA_V  0x00000001U
#define ISP_CCM_FRAME_INT_ENA_S  21
/** ISP_GAMMA_FRAME_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  write 1 to enable gamma frame done
 */
#define ISP_GAMMA_FRAME_INT_ENA    (BIT(22))
#define ISP_GAMMA_FRAME_INT_ENA_M  (ISP_GAMMA_FRAME_INT_ENA_V << ISP_GAMMA_FRAME_INT_ENA_S)
#define ISP_GAMMA_FRAME_INT_ENA_V  0x00000001U
#define ISP_GAMMA_FRAME_INT_ENA_S  22
/** ISP_RGB2YUV_FRAME_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  write 1 to enable rgb2yuv frame done
 */
#define ISP_RGB2YUV_FRAME_INT_ENA    (BIT(23))
#define ISP_RGB2YUV_FRAME_INT_ENA_M  (ISP_RGB2YUV_FRAME_INT_ENA_V << ISP_RGB2YUV_FRAME_INT_ENA_S)
#define ISP_RGB2YUV_FRAME_INT_ENA_V  0x00000001U
#define ISP_RGB2YUV_FRAME_INT_ENA_S  23
/** ISP_SHARP_FRAME_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  write 1 to enable sharp frame done
 */
#define ISP_SHARP_FRAME_INT_ENA    (BIT(24))
#define ISP_SHARP_FRAME_INT_ENA_M  (ISP_SHARP_FRAME_INT_ENA_V << ISP_SHARP_FRAME_INT_ENA_S)
#define ISP_SHARP_FRAME_INT_ENA_V  0x00000001U
#define ISP_SHARP_FRAME_INT_ENA_S  24
/** ISP_COLOR_FRAME_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  write 1 to enable color frame done
 */
#define ISP_COLOR_FRAME_INT_ENA    (BIT(25))
#define ISP_COLOR_FRAME_INT_ENA_M  (ISP_COLOR_FRAME_INT_ENA_V << ISP_COLOR_FRAME_INT_ENA_S)
#define ISP_COLOR_FRAME_INT_ENA_V  0x00000001U
#define ISP_COLOR_FRAME_INT_ENA_S  25
/** ISP_YUV2RGB_FRAME_INT_ENA : R/W; bitpos: [26]; default: 0;
 *  write 1 to enable yuv2rgb frame done
 */
#define ISP_YUV2RGB_FRAME_INT_ENA    (BIT(26))
#define ISP_YUV2RGB_FRAME_INT_ENA_M  (ISP_YUV2RGB_FRAME_INT_ENA_V << ISP_YUV2RGB_FRAME_INT_ENA_S)
#define ISP_YUV2RGB_FRAME_INT_ENA_V  0x00000001U
#define ISP_YUV2RGB_FRAME_INT_ENA_S  26
/** ISP_TAIL_IDI_FRAME_INT_ENA : R/W; bitpos: [27]; default: 0;
 *  write 1 to enable isp_tail idi frame_end
 */
#define ISP_TAIL_IDI_FRAME_INT_ENA    (BIT(27))
#define ISP_TAIL_IDI_FRAME_INT_ENA_M  (ISP_TAIL_IDI_FRAME_INT_ENA_V << ISP_TAIL_IDI_FRAME_INT_ENA_S)
#define ISP_TAIL_IDI_FRAME_INT_ENA_V  0x00000001U
#define ISP_TAIL_IDI_FRAME_INT_ENA_S  27
/** ISP_HEADER_IDI_FRAME_INT_ENA : R/W; bitpos: [28]; default: 0;
 *  write 1 to enable real input frame end of isp_input
 */
#define ISP_HEADER_IDI_FRAME_INT_ENA    (BIT(28))
#define ISP_HEADER_IDI_FRAME_INT_ENA_M  (ISP_HEADER_IDI_FRAME_INT_ENA_V << ISP_HEADER_IDI_FRAME_INT_ENA_S)
#define ISP_HEADER_IDI_FRAME_INT_ENA_V  0x00000001U
#define ISP_HEADER_IDI_FRAME_INT_ENA_S  28

