espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_INT_CLR_REG register
 *  interrupt clear register
 */
#define ISP_INT_CLR_REG (DR_REG_ISP_BASE + 0x70)
/** ISP_ISP_DATA_TYPE_ERR_INT_CLR : WT; bitpos: [0]; default: 0;
 *  write 1 to clear input data type error
 */
#define ISP_ISP_DATA_TYPE_ERR_INT_CLR    (BIT(0))
#define ISP_ISP_DATA_TYPE_ERR_INT_CLR_M  (ISP_ISP_DATA_TYPE_ERR_INT_CLR_V << ISP_ISP_DATA_TYPE_ERR_INT_CLR_S)
#define ISP_ISP_DATA_TYPE_ERR_INT_CLR_V  0x00000001U
#define ISP_ISP_DATA_TYPE_ERR_INT_CLR_S  0
/** ISP_ISP_ASYNC_FIFO_OVF_INT_CLR : WT; bitpos: [1]; default: 0;
 *  write 1 to clear isp input fifo overflow
 */
#define ISP_ISP_ASYNC_FIFO_OVF_INT_CLR    (BIT(1))
#define ISP_ISP_ASYNC_FIFO_OVF_INT_CLR_M  (ISP_ISP_ASYNC_FIFO_OVF_INT_CLR_V << ISP_ISP_ASYNC_FIFO_OVF_INT_CLR_S)
#define ISP_ISP_ASYNC_FIFO_OVF_INT_CLR_V  0x00000001U
#define ISP_ISP_ASYNC_FIFO_OVF_INT_CLR_S  1
/** ISP_ISP_BUF_FULL_INT_CLR : WT; bitpos: [2]; default: 0;
 *  write 1 to clear isp input buffer full
 */
#define ISP_ISP_BUF_FULL_INT_CLR    (BIT(2))
#define ISP_ISP_BUF_FULL_INT_CLR_M  (ISP_ISP_BUF_FULL_INT_CLR_V << ISP_ISP_BUF_FULL_INT_CLR_S)
#define ISP_ISP_BUF_FULL_INT_CLR_V  0x00000001U
#define ISP_ISP_BUF_FULL_INT_CLR_S  2
/** ISP_ISP_HVNUM_SETTING_ERR_INT_CLR : WT; bitpos: [3]; default: 0;
 *  write 1 to clear hnum and vnum setting format error
 */
#define ISP_ISP_HVNUM_SETTING_ERR_INT_CLR    (BIT(3))
#define ISP_ISP_HVNUM_SETTING_ERR_INT_CLR_M  (ISP_ISP_HVNUM_SETTING_ERR_INT_CLR_V << ISP_ISP_HVNUM_SETTING_ERR_INT_CLR_S)
#define ISP_ISP_HVNUM_SETTING_ERR_INT_CLR_V  0x00000001U
#define ISP_ISP_HVNUM_SETTING_ERR_INT_CLR_S  3
/** ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR : WT; bitpos: [4]; default: 0;
 *  write 1 to clear setting invalid reg_data_type
 */
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR    (BIT(4))
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR_M  (ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR_V << ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR_S)
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR_V  0x00000001U
#define ISP_ISP_DATA_TYPE_SETTING_ERR_INT_CLR_S  4
/** ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR : WT; bitpos: [5]; default: 0;
 *  write 1 to clear hnum setting unmatch with mipi input
 */
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR    (BIT(5))
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR_M  (ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR_V << ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR_S)
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR_V  0x00000001U
#define ISP_ISP_MIPI_HNUM_UNMATCH_INT_CLR_S  5
/** ISP_DPC_CHECK_DONE_INT_CLR : WT; bitpos: [6]; default: 0;
 *  write 1 to clear dpc check done
 */
#define ISP_DPC_CHECK_DONE_INT_CLR    (BIT(6))
#define ISP_DPC_CHECK_DONE_INT_CLR_M  (ISP_DPC_CHECK_DONE_INT_CLR_V << ISP_DPC_CHECK_DONE_INT_CLR_S)
#define ISP_DPC_CHECK_DONE_INT_CLR_V  0x00000001U
#define ISP_DPC_CHECK_DONE_INT_CLR_S  6
/** ISP_GAMMA_XCOORD_ERR_INT_CLR : WT; bitpos: [7]; default: 0;
 *  write 1 to clear gamma setting error
 */
#define ISP_GAMMA_XCOORD_ERR_INT_CLR    (BIT(7))
#define ISP_GAMMA_XCOORD_ERR_INT_CLR_M  (ISP_GAMMA_XCOORD_ERR_INT_CLR_V << ISP_GAMMA_XCOORD_ERR_INT_CLR_S)
#define ISP_GAMMA_XCOORD_ERR_INT_CLR_V  0x00000001U
#define ISP_GAMMA_XCOORD_ERR_INT_CLR_S  7
/** ISP_AE_MONITOR_INT_CLR : WT; bitpos: [8]; default: 0;
 *  write 1 to clear ae monitor
 */
#define ISP_AE_MONITOR_INT_CLR    (BIT(8))
#define ISP_AE_MONITOR_INT_CLR_M  (ISP_AE_MONITOR_INT_CLR_V << ISP_AE_MONITOR_INT_CLR_S)
#define ISP_AE_MONITOR_INT_CLR_V  0x00000001U
#define ISP_AE_MONITOR_INT_CLR_S  8
/** ISP_AE_FRAME_DONE_INT_CLR : WT; bitpos: [9]; default: 0;
 *  write 1 to clear ae
 */
#define ISP_AE_FRAME_DONE_INT_CLR    (BIT(9))
#define ISP_AE_FRAME_DONE_INT_CLR_M  (ISP_AE_FRAME_DONE_INT_CLR_V << ISP_AE_FRAME_DONE_INT_CLR_S)
#define ISP_AE_FRAME_DONE_INT_CLR_V  0x00000001U
#define ISP_AE_FRAME_DONE_INT_CLR_S  9
/** ISP_AF_FDONE_INT_CLR : WT; bitpos: [10]; default: 0;
 *  write 1 to clear af statistic
 */
#define ISP_AF_FDONE_INT_CLR    (BIT(10))
#define ISP_AF_FDONE_INT_CLR_M  (ISP_AF_FDONE_INT_CLR_V << ISP_AF_FDONE_INT_CLR_S)
#define ISP_AF_FDONE_INT_CLR_V  0x00000001U
#define ISP_AF_FDONE_INT_CLR_S  10
/** ISP_AF_ENV_INT_CLR : WT; bitpos: [11]; default: 0;
 *  write 1 to clear af monitor
 */
#define ISP_AF_ENV_INT_CLR    (BIT(11))
#define ISP_AF_ENV_INT_CLR_M  (ISP_AF_ENV_INT_CLR_V << ISP_AF_ENV_INT_CLR_S)
#define ISP_AF_ENV_INT_CLR_V  0x00000001U
#define ISP_AF_ENV_INT_CLR_S  11
/** ISP_AWB_FDONE_INT_CLR : WT; bitpos: [12]; default: 0;
 *  write 1 to clear awb
 */
#define ISP_AWB_FDONE_INT_CLR    (BIT(12))
#define ISP_AWB_FDONE_INT_CLR_M  (ISP_AWB_FDONE_INT_CLR_V << ISP_AWB_FDONE_INT_CLR_S)
#define ISP_AWB_FDONE_INT_CLR_V  0x00000001U
#define ISP_AWB_FDONE_INT_CLR_S  12
/** ISP_HIST_FDONE_INT_CLR : WT; bitpos: [13]; default: 0;
 *  write 1 to clear histogram
 */
#define ISP_HIST_FDONE_INT_CLR    (BIT(13))
#define ISP_HIST_FDONE_INT_CLR_M  (ISP_HIST_FDONE_INT_CLR_V << ISP_HIST_FDONE_INT_CLR_S)
#define ISP_HIST_FDONE_INT_CLR_V  0x00000001U
#define ISP_HIST_FDONE_INT_CLR_S  13
/** ISP_FRAME_INT_CLR : WT; bitpos: [14]; default: 0;
 *  write 1 to clear isp frame end
 */
#define ISP_FRAME_INT_CLR    (BIT(14))
#define ISP_FRAME_INT_CLR_M  (ISP_FRAME_INT_CLR_V << ISP_FRAME_INT_CLR_S)
#define ISP_FRAME_INT_CLR_V  0x00000001U
#define ISP_FRAME_INT_CLR_S  14
/** ISP_BLC_FRAME_INT_CLR : WT; bitpos: [15]; default: 0;
 *  write 1 to clear blc frame done
 */
#define ISP_BLC_FRAME_INT_CLR    (BIT(15))
#define ISP_BLC_FRAME_INT_CLR_M  (ISP_BLC_FRAME_INT_CLR_V << ISP_BLC_FRAME_INT_CLR_S)
#define ISP_BLC_FRAME_INT_CLR_V  0x00000001U
#define ISP_BLC_FRAME_INT_CLR_S  15
/** ISP_LSC_FRAME_INT_CLR : WT; bitpos: [16]; default: 0;
 *  write 1 to clear lsc frame done
 */
#define ISP_LSC_FRAME_INT_CLR    (BIT(16))
#define ISP_LSC_FRAME_INT_CLR_M  (ISP_LSC_FRAME_INT_CLR_V << ISP_LSC_FRAME_INT_CLR_S)
#define ISP_LSC_FRAME_INT_CLR_V  0x00000001U
#define ISP_LSC_FRAME_INT_CLR_S  16
/** ISP_DPC_FRAME_INT_CLR : WT; bitpos: [17]; default: 0;
 *  write 1 to clear dpc frame done
 */
#define ISP_DPC_FRAME_INT_CLR    (BIT(17))
#define ISP_DPC_FRAME_INT_CLR_M  (ISP_DPC_FRAME_INT_CLR_V << ISP_DPC_FRAME_INT_CLR_S)
#define ISP_DPC_FRAME_INT_CLR_V  0x00000001U
#define ISP_DPC_FRAME_INT_CLR_S  17
/** ISP_BF_FRAME_INT_CLR : WT; bitpos: [18]; default: 0;
 *  write 1 to clear bf frame done
 */
#define ISP_BF_FRAME_INT_CLR    (BIT(18))
#define ISP_BF_FRAME_INT_CLR_M  (ISP_BF_FRAME_INT_CLR_V << ISP_BF_FRAME_INT_CLR_S)
#define ISP_BF_FRAME_INT_CLR_V  0x00000001U
#define ISP_BF_FRAME_INT_CLR_S  18
/** ISP_DEMOSAIC_FRAME_INT_CLR : WT; bitpos: [19]; default: 0;
 *  write 1 to clear demosaic frame done
 */
#define ISP_DEMOSAIC_FRAME_INT_CLR    (BIT(19))
#define ISP_DEMOSAIC_FRAME_INT_CLR_M  (ISP_DEMOSAIC_FRAME_INT_CLR_V << ISP_DEMOSAIC_FRAME_INT_CLR_S)
#define ISP_DEMOSAIC_FRAME_INT_CLR_V  0x00000001U
#define ISP_DEMOSAIC_FRAME_INT_CLR_S  19
/** ISP_MEDIAN_FRAME_INT_CLR : WT; bitpos: [20]; default: 0;
 *  write 1 to clear median frame done
 */
#define ISP_MEDIAN_FRAME_INT_CLR    (BIT(20))
#define ISP_MEDIAN_FRAME_INT_CLR_M  (ISP_MEDIAN_FRAME_INT_CLR_V << ISP_MEDIAN_FRAME_INT_CLR_S)
#define ISP_MEDIAN_FRAME_INT_CLR_V  0x00000001U
#define ISP_MEDIAN_FRAME_INT_CLR_S  20
/** ISP_CCM_FRAME_INT_CLR : WT; bitpos: [21]; default: 0;
 *  write 1 to clear ccm frame done
 */
#define ISP_CCM_FRAME_INT_CLR    (BIT(21))
#define ISP_CCM_FRAME_INT_CLR_M  (ISP_CCM_FRAME_INT_CLR_V << ISP_CCM_FRAME_INT_CLR_S)
#define ISP_CCM_FRAME_INT_CLR_V  0x00000001U
#define ISP_CCM_FRAME_INT_CLR_S  21
/** ISP_GAMMA_FRAME_INT_CLR : WT; bitpos: [22]; default: 0;
 *  write 1 to clear gamma frame done
 */
#define ISP_GAMMA_FRAME_INT_CLR    (BIT(22))
#define ISP_GAMMA_FRAME_INT_CLR_M  (ISP_GAMMA_FRAME_INT_CLR_V << ISP_GAMMA_FRAME_INT_CLR_S)
#define ISP_GAMMA_FRAME_INT_CLR_V  0x00000001U
#define ISP_GAMMA_FRAME_INT_CLR_S  22
/** ISP_RGB2YUV_FRAME_INT_CLR : WT; bitpos: [23]; default: 0;
 *  write 1 to clear rgb2yuv frame done
 */
#define ISP_RGB2YUV_FRAME_INT_CLR    (BIT(23))
#define ISP_RGB2YUV_FRAME_INT_CLR_M  (ISP_RGB2YUV_FRAME_INT_CLR_V << ISP_RGB2YUV_FRAME_INT_CLR_S)
#define ISP_RGB2YUV_FRAME_INT_CLR_V  0x00000001U
#define ISP_RGB2YUV_FRAME_INT_CLR_S  23
/** ISP_SHARP_FRAME_INT_CLR : WT; bitpos: [24]; default: 0;
 *  write 1 to clear sharp frame done
 */
#define ISP_SHARP_FRAME_INT_CLR    (BIT(24))
#define ISP_SHARP_FRAME_INT_CLR_M  (ISP_SHARP_FRAME_INT_CLR_V << ISP_SHARP_FRAME_INT_CLR_S)
#define ISP_SHARP_FRAME_INT_CLR_V  0x00000001U
#define ISP_SHARP_FRAME_INT_CLR_S  24
/** ISP_COLOR_FRAME_INT_CLR : WT; bitpos: [25]; default: 0;
 *  write 1 to clear color frame done
 */
#define ISP_COLOR_FRAME_INT_CLR    (BIT(25))
#define ISP_COLOR_FRAME_INT_CLR_M  (ISP_COLOR_FRAME_INT_CLR_V << ISP_COLOR_FRAME_INT_CLR_S)
#define ISP_COLOR_FRAME_INT_CLR_V  0x00000001U
#define ISP_COLOR_FRAME_INT_CLR_S  25
/** ISP_YUV2RGB_FRAME_INT_CLR : WT; bitpos: [26]; default: 0;
 *  write 1 to clear yuv2rgb frame done
 */
#define ISP_YUV2RGB_FRAME_INT_CLR    (BIT(26))
#define ISP_YUV2RGB_FRAME_INT_CLR_M  (ISP_YUV2RGB_FRAME_INT_CLR_V << ISP_YUV2RGB_FRAME_INT_CLR_S)
#define ISP_YUV2RGB_FRAME_INT_CLR_V  0x00000001U
#define ISP_YUV2RGB_FRAME_INT_CLR_S  26
/** ISP_TAIL_IDI_FRAME_INT_CLR : WT; bitpos: [27]; default: 0;
 *  write 1 to clear isp_tail idi frame_end
 */
#define ISP_TAIL_IDI_FRAME_INT_CLR    (BIT(27))
#define ISP_TAIL_IDI_FRAME_INT_CLR_M  (ISP_TAIL_IDI_FRAME_INT_CLR_V << ISP_TAIL_IDI_FRAME_INT_CLR_S)
#define ISP_TAIL_IDI_FRAME_INT_CLR_V  0x00000001U
#define ISP_TAIL_IDI_FRAME_INT_CLR_S  27
/** ISP_HEADER_IDI_FRAME_INT_CLR : WT; bitpos: [28]; default: 0;
 *  write 1 to clear real input frame end of isp_input
 */
#define ISP_HEADER_IDI_FRAME_INT_CLR    (BIT(28))
#define ISP_HEADER_IDI_FRAME_INT_CLR_M  (ISP_HEADER_IDI_FRAME_INT_CLR_V << ISP_HEADER_IDI_FRAME_INT_CLR_S)
#define ISP_HEADER_IDI_FRAME_INT_CLR_V  0x00000001U
#define ISP_HEADER_IDI_FRAME_INT_CLR_S  28

