espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_GAMMA_CTRL_REG register
 *  gamma control register
 */
#define ISP_GAMMA_CTRL_REG (DR_REG_ISP_BASE + 0x74)
/** ISP_GAMMA_UPDATE : R/W; bitpos: [0]; default: 0;
 *  Indicates that gamma register configuration is complete
 */
#define ISP_GAMMA_UPDATE    (BIT(0))
#define ISP_GAMMA_UPDATE_M  (ISP_GAMMA_UPDATE_V << ISP_GAMMA_UPDATE_S)
#define ISP_GAMMA_UPDATE_V  0x00000001U
#define ISP_GAMMA_UPDATE_S  0
/** ISP_GAMMA_B_LAST_CORRECT : R/W; bitpos: [1]; default: 1;
 *  this bit configures enable of last b segment correcction. 0: disable, 1: enable
 */
#define ISP_GAMMA_B_LAST_CORRECT    (BIT(1))
#define ISP_GAMMA_B_LAST_CORRECT_M  (ISP_GAMMA_B_LAST_CORRECT_V << ISP_GAMMA_B_LAST_CORRECT_S)
#define ISP_GAMMA_B_LAST_CORRECT_V  0x00000001U
#define ISP_GAMMA_B_LAST_CORRECT_S  1
/** ISP_GAMMA_G_LAST_CORRECT : R/W; bitpos: [2]; default: 1;
 *  this bit configures enable of last g segment correcction. 0: disable, 1: enable
 */
#define ISP_GAMMA_G_LAST_CORRECT    (BIT(2))
#define ISP_GAMMA_G_LAST_CORRECT_M  (ISP_GAMMA_G_LAST_CORRECT_V << ISP_GAMMA_G_LAST_CORRECT_S)
#define ISP_GAMMA_G_LAST_CORRECT_V  0x00000001U
#define ISP_GAMMA_G_LAST_CORRECT_S  2
/** ISP_GAMMA_R_LAST_CORRECT : R/W; bitpos: [3]; default: 1;
 *  this bit configures enable of last r segment correcction. 0: disable, 1: enable
 */
#define ISP_GAMMA_R_LAST_CORRECT    (BIT(3))
#define ISP_GAMMA_R_LAST_CORRECT_M  (ISP_GAMMA_R_LAST_CORRECT_V << ISP_GAMMA_R_LAST_CORRECT_S)
#define ISP_GAMMA_R_LAST_CORRECT_V  0x00000001U
#define ISP_GAMMA_R_LAST_CORRECT_S  3

/** ISP_GAMMA_RY1_REG register
 *  point of Y-axis of r channel gamma curve register 1
 */
#define ISP_GAMMA_RY1_REG (DR_REG_ISP_BASE + 0x78)
/** ISP_GAMMA_R_Y03 : R/W; bitpos: [7:0]; default: 64;
 *  this field configures the point 3 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y03    0x000000FFU
#define ISP_GAMMA_R_Y03_M  (ISP_GAMMA_R_Y03_V << ISP_GAMMA_R_Y03_S)
#define ISP_GAMMA_R_Y03_V  0x000000FFU
#define ISP_GAMMA_R_Y03_S  0
/** ISP_GAMMA_R_Y02 : R/W; bitpos: [15:8]; default: 48;
 *  this field configures the point 2 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y02    0x000000FFU
#define ISP_GAMMA_R_Y02_M  (ISP_GAMMA_R_Y02_V << ISP_GAMMA_R_Y02_S)
#define ISP_GAMMA_R_Y02_V  0x000000FFU
#define ISP_GAMMA_R_Y02_S  8
/** ISP_GAMMA_R_Y01 : R/W; bitpos: [23:16]; default: 32;
 *  this field configures the point 1 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y01    0x000000FFU
#define ISP_GAMMA_R_Y01_M  (ISP_GAMMA_R_Y01_V << ISP_GAMMA_R_Y01_S)
#define ISP_GAMMA_R_Y01_V  0x000000FFU
#define ISP_GAMMA_R_Y01_S  16
/** ISP_GAMMA_R_Y00 : R/W; bitpos: [31:24]; default: 16;
 *  this field configures the point 0 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y00    0x000000FFU
#define ISP_GAMMA_R_Y00_M  (ISP_GAMMA_R_Y00_V << ISP_GAMMA_R_Y00_S)
#define ISP_GAMMA_R_Y00_V  0x000000FFU
#define ISP_GAMMA_R_Y00_S  24

/** ISP_GAMMA_RY2_REG register
 *  point of Y-axis of r channel gamma curve register 2
 */
#define ISP_GAMMA_RY2_REG (DR_REG_ISP_BASE + 0x7c)
/** ISP_GAMMA_R_Y07 : R/W; bitpos: [7:0]; default: 128;
 *  this field configures the point 7 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y07    0x000000FFU
#define ISP_GAMMA_R_Y07_M  (ISP_GAMMA_R_Y07_V << ISP_GAMMA_R_Y07_S)
#define ISP_GAMMA_R_Y07_V  0x000000FFU
#define ISP_GAMMA_R_Y07_S  0
/** ISP_GAMMA_R_Y06 : R/W; bitpos: [15:8]; default: 112;
 *  this field configures the point 6 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y06    0x000000FFU
#define ISP_GAMMA_R_Y06_M  (ISP_GAMMA_R_Y06_V << ISP_GAMMA_R_Y06_S)
#define ISP_GAMMA_R_Y06_V  0x000000FFU
#define ISP_GAMMA_R_Y06_S  8
/** ISP_GAMMA_R_Y05 : R/W; bitpos: [23:16]; default: 96;
 *  this field configures the point 5 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y05    0x000000FFU
#define ISP_GAMMA_R_Y05_M  (ISP_GAMMA_R_Y05_V << ISP_GAMMA_R_Y05_S)
#define ISP_GAMMA_R_Y05_V  0x000000FFU
#define ISP_GAMMA_R_Y05_S  16
/** ISP_GAMMA_R_Y04 : R/W; bitpos: [31:24]; default: 80;
 *  this field configures the point 4 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y04    0x000000FFU
#define ISP_GAMMA_R_Y04_M  (ISP_GAMMA_R_Y04_V << ISP_GAMMA_R_Y04_S)
#define ISP_GAMMA_R_Y04_V  0x000000FFU
#define ISP_GAMMA_R_Y04_S  24

/** ISP_GAMMA_RY3_REG register
 *  point of Y-axis of r channel gamma curve register 3
 */
#define ISP_GAMMA_RY3_REG (DR_REG_ISP_BASE + 0x80)
/** ISP_GAMMA_R_Y0B : R/W; bitpos: [7:0]; default: 192;
 *  this field configures the point 11 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y0B    0x000000FFU
#define ISP_GAMMA_R_Y0B_M  (ISP_GAMMA_R_Y0B_V << ISP_GAMMA_R_Y0B_S)
#define ISP_GAMMA_R_Y0B_V  0x000000FFU
#define ISP_GAMMA_R_Y0B_S  0
/** ISP_GAMMA_R_Y0A : R/W; bitpos: [15:8]; default: 176;
 *  this field configures the point 10 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y0A    0x000000FFU
#define ISP_GAMMA_R_Y0A_M  (ISP_GAMMA_R_Y0A_V << ISP_GAMMA_R_Y0A_S)
#define ISP_GAMMA_R_Y0A_V  0x000000FFU
#define ISP_GAMMA_R_Y0A_S  8
/** ISP_GAMMA_R_Y09 : R/W; bitpos: [23:16]; default: 160;
 *  this field configures the point 9 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y09    0x000000FFU
#define ISP_GAMMA_R_Y09_M  (ISP_GAMMA_R_Y09_V << ISP_GAMMA_R_Y09_S)
#define ISP_GAMMA_R_Y09_V  0x000000FFU
#define ISP_GAMMA_R_Y09_S  16
/** ISP_GAMMA_R_Y08 : R/W; bitpos: [31:24]; default: 144;
 *  this field configures the point 8 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y08    0x000000FFU
#define ISP_GAMMA_R_Y08_M  (ISP_GAMMA_R_Y08_V << ISP_GAMMA_R_Y08_S)
#define ISP_GAMMA_R_Y08_V  0x000000FFU
#define ISP_GAMMA_R_Y08_S  24

/** ISP_GAMMA_RY4_REG register
 *  point of Y-axis of r channel gamma curve register 4
 */
#define ISP_GAMMA_RY4_REG (DR_REG_ISP_BASE + 0x84)
/** ISP_GAMMA_R_Y0F : R/W; bitpos: [7:0]; default: 255;
 *  this field configures the point 15 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y0F    0x000000FFU
#define ISP_GAMMA_R_Y0F_M  (ISP_GAMMA_R_Y0F_V << ISP_GAMMA_R_Y0F_S)
#define ISP_GAMMA_R_Y0F_V  0x000000FFU
#define ISP_GAMMA_R_Y0F_S  0
/** ISP_GAMMA_R_Y0E : R/W; bitpos: [15:8]; default: 240;
 *  this field configures the point 14 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y0E    0x000000FFU
#define ISP_GAMMA_R_Y0E_M  (ISP_GAMMA_R_Y0E_V << ISP_GAMMA_R_Y0E_S)
#define ISP_GAMMA_R_Y0E_V  0x000000FFU
#define ISP_GAMMA_R_Y0E_S  8
/** ISP_GAMMA_R_Y0D : R/W; bitpos: [23:16]; default: 224;
 *  this field configures the point 13 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y0D    0x000000FFU
#define ISP_GAMMA_R_Y0D_M  (ISP_GAMMA_R_Y0D_V << ISP_GAMMA_R_Y0D_S)
#define ISP_GAMMA_R_Y0D_V  0x000000FFU
#define ISP_GAMMA_R_Y0D_S  16
/** ISP_GAMMA_R_Y0C : R/W; bitpos: [31:24]; default: 208;
 *  this field configures the point 12 of Y-axis of r channel gamma curve
 */
#define ISP_GAMMA_R_Y0C    0x000000FFU
#define ISP_GAMMA_R_Y0C_M  (ISP_GAMMA_R_Y0C_V << ISP_GAMMA_R_Y0C_S)
#define ISP_GAMMA_R_Y0C_V  0x000000FFU
#define ISP_GAMMA_R_Y0C_S  24

/** ISP_GAMMA_GY1_REG register
 *  point of Y-axis of g channel gamma curve register 1
 */
#define ISP_GAMMA_GY1_REG (DR_REG_ISP_BASE + 0x88)
/** ISP_GAMMA_G_Y03 : R/W; bitpos: [7:0]; default: 64;
 *  this field configures the point 3 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y03    0x000000FFU
#define ISP_GAMMA_G_Y03_M  (ISP_GAMMA_G_Y03_V << ISP_GAMMA_G_Y03_S)
#define ISP_GAMMA_G_Y03_V  0x000000FFU
#define ISP_GAMMA_G_Y03_S  0
/** ISP_GAMMA_G_Y02 : R/W; bitpos: [15:8]; default: 48;
 *  this field configures the point 2 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y02    0x000000FFU
#define ISP_GAMMA_G_Y02_M  (ISP_GAMMA_G_Y02_V << ISP_GAMMA_G_Y02_S)
#define ISP_GAMMA_G_Y02_V  0x000000FFU
#define ISP_GAMMA_G_Y02_S  8
/** ISP_GAMMA_G_Y01 : R/W; bitpos: [23:16]; default: 32;
 *  this field configures the point 1 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y01    0x000000FFU
#define ISP_GAMMA_G_Y01_M  (ISP_GAMMA_G_Y01_V << ISP_GAMMA_G_Y01_S)
#define ISP_GAMMA_G_Y01_V  0x000000FFU
#define ISP_GAMMA_G_Y01_S  16
/** ISP_GAMMA_G_Y00 : R/W; bitpos: [31:24]; default: 16;
 *  this field configures the point 0 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y00    0x000000FFU
#define ISP_GAMMA_G_Y00_M  (ISP_GAMMA_G_Y00_V << ISP_GAMMA_G_Y00_S)
#define ISP_GAMMA_G_Y00_V  0x000000FFU
#define ISP_GAMMA_G_Y00_S  24

/** ISP_GAMMA_GY2_REG register
 *  point of Y-axis of g channel gamma curve register 2
 */
#define ISP_GAMMA_GY2_REG (DR_REG_ISP_BASE + 0x8c)
/** ISP_GAMMA_G_Y07 : R/W; bitpos: [7:0]; default: 128;
 *  this field configures the point 7 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y07    0x000000FFU
#define ISP_GAMMA_G_Y07_M  (ISP_GAMMA_G_Y07_V << ISP_GAMMA_G_Y07_S)
#define ISP_GAMMA_G_Y07_V  0x000000FFU
#define ISP_GAMMA_G_Y07_S  0
/** ISP_GAMMA_G_Y06 : R/W; bitpos: [15:8]; default: 112;
 *  this field configures the point 6 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y06    0x000000FFU
#define ISP_GAMMA_G_Y06_M  (ISP_GAMMA_G_Y06_V << ISP_GAMMA_G_Y06_S)
#define ISP_GAMMA_G_Y06_V  0x000000FFU
#define ISP_GAMMA_G_Y06_S  8
/** ISP_GAMMA_G_Y05 : R/W; bitpos: [23:16]; default: 96;
 *  this field configures the point 5 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y05    0x000000FFU
#define ISP_GAMMA_G_Y05_M  (ISP_GAMMA_G_Y05_V << ISP_GAMMA_G_Y05_S)
#define ISP_GAMMA_G_Y05_V  0x000000FFU
#define ISP_GAMMA_G_Y05_S  16
/** ISP_GAMMA_G_Y04 : R/W; bitpos: [31:24]; default: 80;
 *  this field configures the point 4 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y04    0x000000FFU
#define ISP_GAMMA_G_Y04_M  (ISP_GAMMA_G_Y04_V << ISP_GAMMA_G_Y04_S)
#define ISP_GAMMA_G_Y04_V  0x000000FFU
#define ISP_GAMMA_G_Y04_S  24

