espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_GAMMA_GY3_REG register
 *  point of Y-axis of g channel gamma curve register 3
 */
#define ISP_GAMMA_GY3_REG (DR_REG_ISP_BASE + 0x90)
/** ISP_GAMMA_G_Y0B : R/W; bitpos: [7:0]; default: 192;
 *  this field configures the point 11 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y0B    0x000000FFU
#define ISP_GAMMA_G_Y0B_M  (ISP_GAMMA_G_Y0B_V << ISP_GAMMA_G_Y0B_S)
#define ISP_GAMMA_G_Y0B_V  0x000000FFU
#define ISP_GAMMA_G_Y0B_S  0
/** ISP_GAMMA_G_Y0A : R/W; bitpos: [15:8]; default: 176;
 *  this field configures the point 10 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y0A    0x000000FFU
#define ISP_GAMMA_G_Y0A_M  (ISP_GAMMA_G_Y0A_V << ISP_GAMMA_G_Y0A_S)
#define ISP_GAMMA_G_Y0A_V  0x000000FFU
#define ISP_GAMMA_G_Y0A_S  8
/** ISP_GAMMA_G_Y09 : R/W; bitpos: [23:16]; default: 160;
 *  this field configures the point 9 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y09    0x000000FFU
#define ISP_GAMMA_G_Y09_M  (ISP_GAMMA_G_Y09_V << ISP_GAMMA_G_Y09_S)
#define ISP_GAMMA_G_Y09_V  0x000000FFU
#define ISP_GAMMA_G_Y09_S  16
/** ISP_GAMMA_G_Y08 : R/W; bitpos: [31:24]; default: 144;
 *  this field configures the point 8 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y08    0x000000FFU
#define ISP_GAMMA_G_Y08_M  (ISP_GAMMA_G_Y08_V << ISP_GAMMA_G_Y08_S)
#define ISP_GAMMA_G_Y08_V  0x000000FFU
#define ISP_GAMMA_G_Y08_S  24

/** ISP_GAMMA_GY4_REG register
 *  point of Y-axis of g channel gamma curve register 4
 */
#define ISP_GAMMA_GY4_REG (DR_REG_ISP_BASE + 0x94)
/** ISP_GAMMA_G_Y0F : R/W; bitpos: [7:0]; default: 255;
 *  this field configures the point 15 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y0F    0x000000FFU
#define ISP_GAMMA_G_Y0F_M  (ISP_GAMMA_G_Y0F_V << ISP_GAMMA_G_Y0F_S)
#define ISP_GAMMA_G_Y0F_V  0x000000FFU
#define ISP_GAMMA_G_Y0F_S  0
/** ISP_GAMMA_G_Y0E : R/W; bitpos: [15:8]; default: 240;
 *  this field configures the point 14 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y0E    0x000000FFU
#define ISP_GAMMA_G_Y0E_M  (ISP_GAMMA_G_Y0E_V << ISP_GAMMA_G_Y0E_S)
#define ISP_GAMMA_G_Y0E_V  0x000000FFU
#define ISP_GAMMA_G_Y0E_S  8
/** ISP_GAMMA_G_Y0D : R/W; bitpos: [23:16]; default: 224;
 *  this field configures the point 13 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y0D    0x000000FFU
#define ISP_GAMMA_G_Y0D_M  (ISP_GAMMA_G_Y0D_V << ISP_GAMMA_G_Y0D_S)
#define ISP_GAMMA_G_Y0D_V  0x000000FFU
#define ISP_GAMMA_G_Y0D_S  16
/** ISP_GAMMA_G_Y0C : R/W; bitpos: [31:24]; default: 208;
 *  this field configures the point 12 of Y-axis of g channel gamma curve
 */
#define ISP_GAMMA_G_Y0C    0x000000FFU
#define ISP_GAMMA_G_Y0C_M  (ISP_GAMMA_G_Y0C_V << ISP_GAMMA_G_Y0C_S)
#define ISP_GAMMA_G_Y0C_V  0x000000FFU
#define ISP_GAMMA_G_Y0C_S  24

/** ISP_GAMMA_BY1_REG register
 *  point of Y-axis of b channel gamma curve register 1
 */
#define ISP_GAMMA_BY1_REG (DR_REG_ISP_BASE + 0x98)
/** ISP_GAMMA_B_Y03 : R/W; bitpos: [7:0]; default: 64;
 *  this field configures the point 3 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y03    0x000000FFU
#define ISP_GAMMA_B_Y03_M  (ISP_GAMMA_B_Y03_V << ISP_GAMMA_B_Y03_S)
#define ISP_GAMMA_B_Y03_V  0x000000FFU
#define ISP_GAMMA_B_Y03_S  0
/** ISP_GAMMA_B_Y02 : R/W; bitpos: [15:8]; default: 48;
 *  this field configures the point 2 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y02    0x000000FFU
#define ISP_GAMMA_B_Y02_M  (ISP_GAMMA_B_Y02_V << ISP_GAMMA_B_Y02_S)
#define ISP_GAMMA_B_Y02_V  0x000000FFU
#define ISP_GAMMA_B_Y02_S  8
/** ISP_GAMMA_B_Y01 : R/W; bitpos: [23:16]; default: 32;
 *  this field configures the point 1 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y01    0x000000FFU
#define ISP_GAMMA_B_Y01_M  (ISP_GAMMA_B_Y01_V << ISP_GAMMA_B_Y01_S)
#define ISP_GAMMA_B_Y01_V  0x000000FFU
#define ISP_GAMMA_B_Y01_S  16
/** ISP_GAMMA_B_Y00 : R/W; bitpos: [31:24]; default: 16;
 *  this field configures the point 0 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y00    0x000000FFU
#define ISP_GAMMA_B_Y00_M  (ISP_GAMMA_B_Y00_V << ISP_GAMMA_B_Y00_S)
#define ISP_GAMMA_B_Y00_V  0x000000FFU
#define ISP_GAMMA_B_Y00_S  24

/** ISP_GAMMA_BY2_REG register
 *  point of Y-axis of b channel gamma curve register 2
 */
#define ISP_GAMMA_BY2_REG (DR_REG_ISP_BASE + 0x9c)
/** ISP_GAMMA_B_Y07 : R/W; bitpos: [7:0]; default: 128;
 *  this field configures the point 7 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y07    0x000000FFU
#define ISP_GAMMA_B_Y07_M  (ISP_GAMMA_B_Y07_V << ISP_GAMMA_B_Y07_S)
#define ISP_GAMMA_B_Y07_V  0x000000FFU
#define ISP_GAMMA_B_Y07_S  0
/** ISP_GAMMA_B_Y06 : R/W; bitpos: [15:8]; default: 112;
 *  this field configures the point 6 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y06    0x000000FFU
#define ISP_GAMMA_B_Y06_M  (ISP_GAMMA_B_Y06_V << ISP_GAMMA_B_Y06_S)
#define ISP_GAMMA_B_Y06_V  0x000000FFU
#define ISP_GAMMA_B_Y06_S  8
/** ISP_GAMMA_B_Y05 : R/W; bitpos: [23:16]; default: 96;
 *  this field configures the point 5 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y05    0x000000FFU
#define ISP_GAMMA_B_Y05_M  (ISP_GAMMA_B_Y05_V << ISP_GAMMA_B_Y05_S)
#define ISP_GAMMA_B_Y05_V  0x000000FFU
#define ISP_GAMMA_B_Y05_S  16
/** ISP_GAMMA_B_Y04 : R/W; bitpos: [31:24]; default: 80;
 *  this field configures the point 4 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y04    0x000000FFU
#define ISP_GAMMA_B_Y04_M  (ISP_GAMMA_B_Y04_V << ISP_GAMMA_B_Y04_S)
#define ISP_GAMMA_B_Y04_V  0x000000FFU
#define ISP_GAMMA_B_Y04_S  24

/** ISP_GAMMA_BY3_REG register
 *  point of Y-axis of b channel gamma curve register 3
 */
#define ISP_GAMMA_BY3_REG (DR_REG_ISP_BASE + 0xa0)
/** ISP_GAMMA_B_Y0B : R/W; bitpos: [7:0]; default: 192;
 *  this field configures the point 11 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y0B    0x000000FFU
#define ISP_GAMMA_B_Y0B_M  (ISP_GAMMA_B_Y0B_V << ISP_GAMMA_B_Y0B_S)
#define ISP_GAMMA_B_Y0B_V  0x000000FFU
#define ISP_GAMMA_B_Y0B_S  0
/** ISP_GAMMA_B_Y0A : R/W; bitpos: [15:8]; default: 176;
 *  this field configures the point 10 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y0A    0x000000FFU
#define ISP_GAMMA_B_Y0A_M  (ISP_GAMMA_B_Y0A_V << ISP_GAMMA_B_Y0A_S)
#define ISP_GAMMA_B_Y0A_V  0x000000FFU
#define ISP_GAMMA_B_Y0A_S  8
/** ISP_GAMMA_B_Y09 : R/W; bitpos: [23:16]; default: 160;
 *  this field configures the point 9 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y09    0x000000FFU
#define ISP_GAMMA_B_Y09_M  (ISP_GAMMA_B_Y09_V << ISP_GAMMA_B_Y09_S)
#define ISP_GAMMA_B_Y09_V  0x000000FFU
#define ISP_GAMMA_B_Y09_S  16
/** ISP_GAMMA_B_Y08 : R/W; bitpos: [31:24]; default: 144;
 *  this field configures the point 8 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y08    0x000000FFU
#define ISP_GAMMA_B_Y08_M  (ISP_GAMMA_B_Y08_V << ISP_GAMMA_B_Y08_S)
#define ISP_GAMMA_B_Y08_V  0x000000FFU
#define ISP_GAMMA_B_Y08_S  24

/** ISP_GAMMA_BY4_REG register
 *  point of Y-axis of b channel gamma curve register 4
 */
#define ISP_GAMMA_BY4_REG (DR_REG_ISP_BASE + 0xa4)
/** ISP_GAMMA_B_Y0F : R/W; bitpos: [7:0]; default: 255;
 *  this field configures the point 15 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y0F    0x000000FFU
#define ISP_GAMMA_B_Y0F_M  (ISP_GAMMA_B_Y0F_V << ISP_GAMMA_B_Y0F_S)
#define ISP_GAMMA_B_Y0F_V  0x000000FFU
#define ISP_GAMMA_B_Y0F_S  0
/** ISP_GAMMA_B_Y0E : R/W; bitpos: [15:8]; default: 240;
 *  this field configures the point 14 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y0E    0x000000FFU
#define ISP_GAMMA_B_Y0E_M  (ISP_GAMMA_B_Y0E_V << ISP_GAMMA_B_Y0E_S)
#define ISP_GAMMA_B_Y0E_V  0x000000FFU
#define ISP_GAMMA_B_Y0E_S  8
/** ISP_GAMMA_B_Y0D : R/W; bitpos: [23:16]; default: 224;
 *  this field configures the point 13 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y0D    0x000000FFU
#define ISP_GAMMA_B_Y0D_M  (ISP_GAMMA_B_Y0D_V << ISP_GAMMA_B_Y0D_S)
#define ISP_GAMMA_B_Y0D_V  0x000000FFU
#define ISP_GAMMA_B_Y0D_S  16
/** ISP_GAMMA_B_Y0C : R/W; bitpos: [31:24]; default: 208;
 *  this field configures the point 12 of Y-axis of b channel gamma curve
 */
#define ISP_GAMMA_B_Y0C    0x000000FFU
#define ISP_GAMMA_B_Y0C_M  (ISP_GAMMA_B_Y0C_V << ISP_GAMMA_B_Y0C_S)
#define ISP_GAMMA_B_Y0C_V  0x000000FFU
#define ISP_GAMMA_B_Y0C_S  24

/** ISP_GAMMA_RX1_REG register
 *  point of X-axis of r channel gamma curve register 1
 */
#define ISP_GAMMA_RX1_REG (DR_REG_ISP_BASE + 0xa8)
/** ISP_GAMMA_R_X07 : R/W; bitpos: [2:0]; default: 4;
 *  this field configures the point 7 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X07    0x00000007U
#define ISP_GAMMA_R_X07_M  (ISP_GAMMA_R_X07_V << ISP_GAMMA_R_X07_S)
#define ISP_GAMMA_R_X07_V  0x00000007U
#define ISP_GAMMA_R_X07_S  0
/** ISP_GAMMA_R_X06 : R/W; bitpos: [5:3]; default: 4;
 *  this field configures the point 6 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X06    0x00000007U
#define ISP_GAMMA_R_X06_M  (ISP_GAMMA_R_X06_V << ISP_GAMMA_R_X06_S)
#define ISP_GAMMA_R_X06_V  0x00000007U
#define ISP_GAMMA_R_X06_S  3
/** ISP_GAMMA_R_X05 : R/W; bitpos: [8:6]; default: 4;
 *  this field configures the point 5 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X05    0x00000007U
#define ISP_GAMMA_R_X05_M  (ISP_GAMMA_R_X05_V << ISP_GAMMA_R_X05_S)
#define ISP_GAMMA_R_X05_V  0x00000007U
#define ISP_GAMMA_R_X05_S  6
/** ISP_GAMMA_R_X04 : R/W; bitpos: [11:9]; default: 4;
 *  this field configures the point 4 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X04    0x00000007U
#define ISP_GAMMA_R_X04_M  (ISP_GAMMA_R_X04_V << ISP_GAMMA_R_X04_S)
#define ISP_GAMMA_R_X04_V  0x00000007U
#define ISP_GAMMA_R_X04_S  9
/** ISP_GAMMA_R_X03 : R/W; bitpos: [14:12]; default: 4;
 *  this field configures the point 3 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X03    0x00000007U
#define ISP_GAMMA_R_X03_M  (ISP_GAMMA_R_X03_V << ISP_GAMMA_R_X03_S)
#define ISP_GAMMA_R_X03_V  0x00000007U
#define ISP_GAMMA_R_X03_S  12
/** ISP_GAMMA_R_X02 : R/W; bitpos: [17:15]; default: 4;
 *  this field configures the point 2 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X02    0x00000007U
#define ISP_GAMMA_R_X02_M  (ISP_GAMMA_R_X02_V << ISP_GAMMA_R_X02_S)
#define ISP_GAMMA_R_X02_V  0x00000007U
#define ISP_GAMMA_R_X02_S  15
/** ISP_GAMMA_R_X01 : R/W; bitpos: [20:18]; default: 4;
 *  this field configures the point 1 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X01    0x00000007U
#define ISP_GAMMA_R_X01_M  (ISP_GAMMA_R_X01_V << ISP_GAMMA_R_X01_S)
#define ISP_GAMMA_R_X01_V  0x00000007U
#define ISP_GAMMA_R_X01_S  18
/** ISP_GAMMA_R_X00 : R/W; bitpos: [23:21]; default: 4;
 *  this field configures the point 0 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X00    0x00000007U
#define ISP_GAMMA_R_X00_M  (ISP_GAMMA_R_X00_V << ISP_GAMMA_R_X00_S)
#define ISP_GAMMA_R_X00_V  0x00000007U
#define ISP_GAMMA_R_X00_S  21

/** ISP_GAMMA_RX2_REG register
 *  point of X-axis of r channel gamma curve register 2
 */
#define ISP_GAMMA_RX2_REG (DR_REG_ISP_BASE + 0xac)
/** ISP_GAMMA_R_X0F : R/W; bitpos: [2:0]; default: 4;
 *  this field configures the point 15 of X-axis of r channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X0F    0x00000007U
#define ISP_GAMMA_R_X0F_M  (ISP_GAMMA_R_X0F_V << ISP_GAMMA_R_X0F_S)
#define ISP_GAMMA_R_X0F_V  0x00000007U
#define ISP_GAMMA_R_X0F_S  0
/** ISP_GAMMA_R_X0E : R/W; bitpos: [5:3]; default: 4;
 *  this field configures the point 14 of X-axis of r channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X0E    0x00000007U
#define ISP_GAMMA_R_X0E_M  (ISP_GAMMA_R_X0E_V << ISP_GAMMA_R_X0E_S)
#define ISP_GAMMA_R_X0E_V  0x00000007U
#define ISP_GAMMA_R_X0E_S  3
/** ISP_GAMMA_R_X0D : R/W; bitpos: [8:6]; default: 4;
 *  this field configures the point 13 of X-axis of r channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X0D    0x00000007U
#define ISP_GAMMA_R_X0D_M  (ISP_GAMMA_R_X0D_V << ISP_GAMMA_R_X0D_S)
#define ISP_GAMMA_R_X0D_V  0x00000007U
#define ISP_GAMMA_R_X0D_S  6
/** ISP_GAMMA_R_X0C : R/W; bitpos: [11:9]; default: 4;
 *  this field configures the point 12 of X-axis of r channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X0C    0x00000007U
#define ISP_GAMMA_R_X0C_M  (ISP_GAMMA_R_X0C_V << ISP_GAMMA_R_X0C_S)
#define ISP_GAMMA_R_X0C_V  0x00000007U
#define ISP_GAMMA_R_X0C_S  9
/** ISP_GAMMA_R_X0B : R/W; bitpos: [14:12]; default: 4;
 *  this field configures the point 11 of X-axis of r channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X0B    0x00000007U
#define ISP_GAMMA_R_X0B_M  (ISP_GAMMA_R_X0B_V << ISP_GAMMA_R_X0B_S)
#define ISP_GAMMA_R_X0B_V  0x00000007U
#define ISP_GAMMA_R_X0B_S  12
/** ISP_GAMMA_R_X0A : R/W; bitpos: [17:15]; default: 4;
 *  this field configures the point 10 of X-axis of r channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X0A    0x00000007U
#define ISP_GAMMA_R_X0A_M  (ISP_GAMMA_R_X0A_V << ISP_GAMMA_R_X0A_S)
#define ISP_GAMMA_R_X0A_V  0x00000007U
#define ISP_GAMMA_R_X0A_S  15
/** ISP_GAMMA_R_X09 : R/W; bitpos: [20:18]; default: 4;
 *  this field configures the point 9 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X09    0x00000007U
#define ISP_GAMMA_R_X09_M  (ISP_GAMMA_R_X09_V << ISP_GAMMA_R_X09_S)
#define ISP_GAMMA_R_X09_V  0x00000007U
#define ISP_GAMMA_R_X09_S  18
/** ISP_GAMMA_R_X08 : R/W; bitpos: [23:21]; default: 4;
 *  this field configures the point 8 of X-axis of r channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_R_X08    0x00000007U
#define ISP_GAMMA_R_X08_M  (ISP_GAMMA_R_X08_V << ISP_GAMMA_R_X08_S)
#define ISP_GAMMA_R_X08_V  0x00000007U
#define ISP_GAMMA_R_X08_S  21

/** ISP_GAMMA_GX1_REG register
 *  point of X-axis of g channel gamma curve register 1
 */
#define ISP_GAMMA_GX1_REG (DR_REG_ISP_BASE + 0xb0)
/** ISP_GAMMA_G_X07 : R/W; bitpos: [2:0]; default: 4;
 *  this field configures the point 7 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X07    0x00000007U
#define ISP_GAMMA_G_X07_M  (ISP_GAMMA_G_X07_V << ISP_GAMMA_G_X07_S)
#define ISP_GAMMA_G_X07_V  0x00000007U
#define ISP_GAMMA_G_X07_S  0
/** ISP_GAMMA_G_X06 : R/W; bitpos: [5:3]; default: 4;
 *  this field configures the point 6 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X06    0x00000007U
#define ISP_GAMMA_G_X06_M  (ISP_GAMMA_G_X06_V << ISP_GAMMA_G_X06_S)
#define ISP_GAMMA_G_X06_V  0x00000007U
#define ISP_GAMMA_G_X06_S  3
/** ISP_GAMMA_G_X05 : R/W; bitpos: [8:6]; default: 4;
 *  this field configures the point 5 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X05    0x00000007U
#define ISP_GAMMA_G_X05_M  (ISP_GAMMA_G_X05_V << ISP_GAMMA_G_X05_S)
#define ISP_GAMMA_G_X05_V  0x00000007U
#define ISP_GAMMA_G_X05_S  6
/** ISP_GAMMA_G_X04 : R/W; bitpos: [11:9]; default: 4;
 *  this field configures the point 4 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X04    0x00000007U
#define ISP_GAMMA_G_X04_M  (ISP_GAMMA_G_X04_V << ISP_GAMMA_G_X04_S)
#define ISP_GAMMA_G_X04_V  0x00000007U
#define ISP_GAMMA_G_X04_S  9
/** ISP_GAMMA_G_X03 : R/W; bitpos: [14:12]; default: 4;
 *  this field configures the point 3 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X03    0x00000007U
#define ISP_GAMMA_G_X03_M  (ISP_GAMMA_G_X03_V << ISP_GAMMA_G_X03_S)
#define ISP_GAMMA_G_X03_V  0x00000007U
#define ISP_GAMMA_G_X03_S  12
/** ISP_GAMMA_G_X02 : R/W; bitpos: [17:15]; default: 4;
 *  this field configures the point 2 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X02    0x00000007U
#define ISP_GAMMA_G_X02_M  (ISP_GAMMA_G_X02_V << ISP_GAMMA_G_X02_S)
#define ISP_GAMMA_G_X02_V  0x00000007U
#define ISP_GAMMA_G_X02_S  15
/** ISP_GAMMA_G_X01 : R/W; bitpos: [20:18]; default: 4;
 *  this field configures the point 1 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X01    0x00000007U
#define ISP_GAMMA_G_X01_M  (ISP_GAMMA_G_X01_V << ISP_GAMMA_G_X01_S)
#define ISP_GAMMA_G_X01_V  0x00000007U
#define ISP_GAMMA_G_X01_S  18
/** ISP_GAMMA_G_X00 : R/W; bitpos: [23:21]; default: 4;
 *  this field configures the point 0 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X00    0x00000007U
#define ISP_GAMMA_G_X00_M  (ISP_GAMMA_G_X00_V << ISP_GAMMA_G_X00_S)
#define ISP_GAMMA_G_X00_V  0x00000007U
#define ISP_GAMMA_G_X00_S  21

/** ISP_GAMMA_GX2_REG register
 *  point of X-axis of g channel gamma curve register 2
 */
#define ISP_GAMMA_GX2_REG (DR_REG_ISP_BASE + 0xb4)
/** ISP_GAMMA_G_X0F : R/W; bitpos: [2:0]; default: 4;
 *  this field configures the point 15 of X-axis of g channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X0F    0x00000007U
#define ISP_GAMMA_G_X0F_M  (ISP_GAMMA_G_X0F_V << ISP_GAMMA_G_X0F_S)
#define ISP_GAMMA_G_X0F_V  0x00000007U
#define ISP_GAMMA_G_X0F_S  0
/** ISP_GAMMA_G_X0E : R/W; bitpos: [5:3]; default: 4;
 *  this field configures the point 14 of X-axis of g channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X0E    0x00000007U
#define ISP_GAMMA_G_X0E_M  (ISP_GAMMA_G_X0E_V << ISP_GAMMA_G_X0E_S)
#define ISP_GAMMA_G_X0E_V  0x00000007U
#define ISP_GAMMA_G_X0E_S  3
/** ISP_GAMMA_G_X0D : R/W; bitpos: [8:6]; default: 4;
 *  this field configures the point 13 of X-axis of g channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X0D    0x00000007U
#define ISP_GAMMA_G_X0D_M  (ISP_GAMMA_G_X0D_V << ISP_GAMMA_G_X0D_S)
#define ISP_GAMMA_G_X0D_V  0x00000007U
#define ISP_GAMMA_G_X0D_S  6
/** ISP_GAMMA_G_X0C : R/W; bitpos: [11:9]; default: 4;
 *  this field configures the point 12 of X-axis of g channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X0C    0x00000007U
#define ISP_GAMMA_G_X0C_M  (ISP_GAMMA_G_X0C_V << ISP_GAMMA_G_X0C_S)
#define ISP_GAMMA_G_X0C_V  0x00000007U
#define ISP_GAMMA_G_X0C_S  9
/** ISP_GAMMA_G_X0B : R/W; bitpos: [14:12]; default: 4;
 *  this field configures the point 11 of X-axis of g channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X0B    0x00000007U
#define ISP_GAMMA_G_X0B_M  (ISP_GAMMA_G_X0B_V << ISP_GAMMA_G_X0B_S)
#define ISP_GAMMA_G_X0B_V  0x00000007U
#define ISP_GAMMA_G_X0B_S  12
/** ISP_GAMMA_G_X0A : R/W; bitpos: [17:15]; default: 4;
 *  this field configures the point 10 of X-axis of g channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X0A    0x00000007U
#define ISP_GAMMA_G_X0A_M  (ISP_GAMMA_G_X0A_V << ISP_GAMMA_G_X0A_S)
#define ISP_GAMMA_G_X0A_V  0x00000007U
#define ISP_GAMMA_G_X0A_S  15
/** ISP_GAMMA_G_X09 : R/W; bitpos: [20:18]; default: 4;
 *  this field configures the point 9 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X09    0x00000007U
#define ISP_GAMMA_G_X09_M  (ISP_GAMMA_G_X09_V << ISP_GAMMA_G_X09_S)
#define ISP_GAMMA_G_X09_V  0x00000007U
#define ISP_GAMMA_G_X09_S  18
/** ISP_GAMMA_G_X08 : R/W; bitpos: [23:21]; default: 4;
 *  this field configures the point 8 of X-axis of g channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_G_X08    0x00000007U
#define ISP_GAMMA_G_X08_M  (ISP_GAMMA_G_X08_V << ISP_GAMMA_G_X08_S)
#define ISP_GAMMA_G_X08_V  0x00000007U
#define ISP_GAMMA_G_X08_S  21

