espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_GAMMA_BX1_REG register
 *  point of X-axis of b channel gamma curve register 1
 */
#define ISP_GAMMA_BX1_REG (DR_REG_ISP_BASE + 0xb8)
/** ISP_GAMMA_B_X07 : R/W; bitpos: [2:0]; default: 4;
 *  this field configures the point 7 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X07    0x00000007U
#define ISP_GAMMA_B_X07_M  (ISP_GAMMA_B_X07_V << ISP_GAMMA_B_X07_S)
#define ISP_GAMMA_B_X07_V  0x00000007U
#define ISP_GAMMA_B_X07_S  0
/** ISP_GAMMA_B_X06 : R/W; bitpos: [5:3]; default: 4;
 *  this field configures the point 6 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X06    0x00000007U
#define ISP_GAMMA_B_X06_M  (ISP_GAMMA_B_X06_V << ISP_GAMMA_B_X06_S)
#define ISP_GAMMA_B_X06_V  0x00000007U
#define ISP_GAMMA_B_X06_S  3
/** ISP_GAMMA_B_X05 : R/W; bitpos: [8:6]; default: 4;
 *  this field configures the point 5 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X05    0x00000007U
#define ISP_GAMMA_B_X05_M  (ISP_GAMMA_B_X05_V << ISP_GAMMA_B_X05_S)
#define ISP_GAMMA_B_X05_V  0x00000007U
#define ISP_GAMMA_B_X05_S  6
/** ISP_GAMMA_B_X04 : R/W; bitpos: [11:9]; default: 4;
 *  this field configures the point 4 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X04    0x00000007U
#define ISP_GAMMA_B_X04_M  (ISP_GAMMA_B_X04_V << ISP_GAMMA_B_X04_S)
#define ISP_GAMMA_B_X04_V  0x00000007U
#define ISP_GAMMA_B_X04_S  9
/** ISP_GAMMA_B_X03 : R/W; bitpos: [14:12]; default: 4;
 *  this field configures the point 3 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X03    0x00000007U
#define ISP_GAMMA_B_X03_M  (ISP_GAMMA_B_X03_V << ISP_GAMMA_B_X03_S)
#define ISP_GAMMA_B_X03_V  0x00000007U
#define ISP_GAMMA_B_X03_S  12
/** ISP_GAMMA_B_X02 : R/W; bitpos: [17:15]; default: 4;
 *  this field configures the point 2 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X02    0x00000007U
#define ISP_GAMMA_B_X02_M  (ISP_GAMMA_B_X02_V << ISP_GAMMA_B_X02_S)
#define ISP_GAMMA_B_X02_V  0x00000007U
#define ISP_GAMMA_B_X02_S  15
/** ISP_GAMMA_B_X01 : R/W; bitpos: [20:18]; default: 4;
 *  this field configures the point 1 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X01    0x00000007U
#define ISP_GAMMA_B_X01_M  (ISP_GAMMA_B_X01_V << ISP_GAMMA_B_X01_S)
#define ISP_GAMMA_B_X01_V  0x00000007U
#define ISP_GAMMA_B_X01_S  18
/** ISP_GAMMA_B_X00 : R/W; bitpos: [23:21]; default: 4;
 *  this field configures the point 0 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X00    0x00000007U
#define ISP_GAMMA_B_X00_M  (ISP_GAMMA_B_X00_V << ISP_GAMMA_B_X00_S)
#define ISP_GAMMA_B_X00_V  0x00000007U
#define ISP_GAMMA_B_X00_S  21

/** ISP_GAMMA_BX2_REG register
 *  point of X-axis of b channel gamma curve register 2
 */
#define ISP_GAMMA_BX2_REG (DR_REG_ISP_BASE + 0xbc)
/** ISP_GAMMA_B_X0F : R/W; bitpos: [2:0]; default: 4;
 *  this field configures the point 15 of X-axis of b channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X0F    0x00000007U
#define ISP_GAMMA_B_X0F_M  (ISP_GAMMA_B_X0F_V << ISP_GAMMA_B_X0F_S)
#define ISP_GAMMA_B_X0F_V  0x00000007U
#define ISP_GAMMA_B_X0F_S  0
/** ISP_GAMMA_B_X0E : R/W; bitpos: [5:3]; default: 4;
 *  this field configures the point 14 of X-axis of b channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X0E    0x00000007U
#define ISP_GAMMA_B_X0E_M  (ISP_GAMMA_B_X0E_V << ISP_GAMMA_B_X0E_S)
#define ISP_GAMMA_B_X0E_V  0x00000007U
#define ISP_GAMMA_B_X0E_S  3
/** ISP_GAMMA_B_X0D : R/W; bitpos: [8:6]; default: 4;
 *  this field configures the point 13 of X-axis of b channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X0D    0x00000007U
#define ISP_GAMMA_B_X0D_M  (ISP_GAMMA_B_X0D_V << ISP_GAMMA_B_X0D_S)
#define ISP_GAMMA_B_X0D_V  0x00000007U
#define ISP_GAMMA_B_X0D_S  6
/** ISP_GAMMA_B_X0C : R/W; bitpos: [11:9]; default: 4;
 *  this field configures the point 12 of X-axis of b channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X0C    0x00000007U
#define ISP_GAMMA_B_X0C_M  (ISP_GAMMA_B_X0C_V << ISP_GAMMA_B_X0C_S)
#define ISP_GAMMA_B_X0C_V  0x00000007U
#define ISP_GAMMA_B_X0C_S  9
/** ISP_GAMMA_B_X0B : R/W; bitpos: [14:12]; default: 4;
 *  this field configures the point 11 of X-axis of b channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X0B    0x00000007U
#define ISP_GAMMA_B_X0B_M  (ISP_GAMMA_B_X0B_V << ISP_GAMMA_B_X0B_S)
#define ISP_GAMMA_B_X0B_V  0x00000007U
#define ISP_GAMMA_B_X0B_S  12
/** ISP_GAMMA_B_X0A : R/W; bitpos: [17:15]; default: 4;
 *  this field configures the point 10 of X-axis of b channel gamma curve, it
 *  represents the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X0A    0x00000007U
#define ISP_GAMMA_B_X0A_M  (ISP_GAMMA_B_X0A_V << ISP_GAMMA_B_X0A_S)
#define ISP_GAMMA_B_X0A_V  0x00000007U
#define ISP_GAMMA_B_X0A_S  15
/** ISP_GAMMA_B_X09 : R/W; bitpos: [20:18]; default: 4;
 *  this field configures the point 9 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X09    0x00000007U
#define ISP_GAMMA_B_X09_M  (ISP_GAMMA_B_X09_V << ISP_GAMMA_B_X09_S)
#define ISP_GAMMA_B_X09_V  0x00000007U
#define ISP_GAMMA_B_X09_S  18
/** ISP_GAMMA_B_X08 : R/W; bitpos: [23:21]; default: 4;
 *  this field configures the point 8 of X-axis of b channel gamma curve, it represents
 *  the power of the distance from the previous point
 */
#define ISP_GAMMA_B_X08    0x00000007U
#define ISP_GAMMA_B_X08_M  (ISP_GAMMA_B_X08_V << ISP_GAMMA_B_X08_S)
#define ISP_GAMMA_B_X08_V  0x00000007U
#define ISP_GAMMA_B_X08_S  21

/** ISP_AE_CTRL_REG register
 *  ae control register
 */
#define ISP_AE_CTRL_REG (DR_REG_ISP_BASE + 0xc0)
/** ISP_AE_UPDATE : WT; bitpos: [0]; default: 0;
 *  write 1 to this bit triggers one statistic event
 */
#define ISP_AE_UPDATE    (BIT(0))
#define ISP_AE_UPDATE_M  (ISP_AE_UPDATE_V << ISP_AE_UPDATE_S)
#define ISP_AE_UPDATE_V  0x00000001U
#define ISP_AE_UPDATE_S  0
/** ISP_AE_SELECT : R/W; bitpos: [1]; default: 0;
 *  this field configures ae input data source, 0: data from median, 1: data from gama
 */
#define ISP_AE_SELECT    (BIT(1))
#define ISP_AE_SELECT_M  (ISP_AE_SELECT_V << ISP_AE_SELECT_S)
#define ISP_AE_SELECT_V  0x00000001U
#define ISP_AE_SELECT_S  1

/** ISP_AE_MONITOR_REG register
 *  ae monitor control register
 */
#define ISP_AE_MONITOR_REG (DR_REG_ISP_BASE + 0xc4)
/** ISP_AE_MONITOR_TL : R/W; bitpos: [7:0]; default: 0;
 *  this field configures the lower lum threshold of ae monitor
 */
#define ISP_AE_MONITOR_TL    0x000000FFU
#define ISP_AE_MONITOR_TL_M  (ISP_AE_MONITOR_TL_V << ISP_AE_MONITOR_TL_S)
#define ISP_AE_MONITOR_TL_V  0x000000FFU
#define ISP_AE_MONITOR_TL_S  0
/** ISP_AE_MONITOR_TH : R/W; bitpos: [15:8]; default: 0;
 *  this field configures the higher lum threshold of ae monitor
 */
#define ISP_AE_MONITOR_TH    0x000000FFU
#define ISP_AE_MONITOR_TH_M  (ISP_AE_MONITOR_TH_V << ISP_AE_MONITOR_TH_S)
#define ISP_AE_MONITOR_TH_V  0x000000FFU
#define ISP_AE_MONITOR_TH_S  8
/** ISP_AE_MONITOR_PERIOD : R/W; bitpos: [21:16]; default: 0;
 *  this field configures ae monitor frame period
 */
#define ISP_AE_MONITOR_PERIOD    0x0000003FU
#define ISP_AE_MONITOR_PERIOD_M  (ISP_AE_MONITOR_PERIOD_V << ISP_AE_MONITOR_PERIOD_S)
#define ISP_AE_MONITOR_PERIOD_V  0x0000003FU
#define ISP_AE_MONITOR_PERIOD_S  16

/** ISP_AE_BX_REG register
 *  ae window register in x-direction
 */
#define ISP_AE_BX_REG (DR_REG_ISP_BASE + 0xc8)
/** ISP_AE_X_BSIZE : R/W; bitpos: [10:0]; default: 384;
 *  this field configures every block x size
 */
#define ISP_AE_X_BSIZE    0x000007FFU
#define ISP_AE_X_BSIZE_M  (ISP_AE_X_BSIZE_V << ISP_AE_X_BSIZE_S)
#define ISP_AE_X_BSIZE_V  0x000007FFU
#define ISP_AE_X_BSIZE_S  0
/** ISP_AE_X_START : R/W; bitpos: [21:11]; default: 0;
 *  this field configures first block start x address
 */
#define ISP_AE_X_START    0x000007FFU
#define ISP_AE_X_START_M  (ISP_AE_X_START_V << ISP_AE_X_START_S)
#define ISP_AE_X_START_V  0x000007FFU
#define ISP_AE_X_START_S  11

/** ISP_AE_BY_REG register
 *  ae window register in y-direction
 */
#define ISP_AE_BY_REG (DR_REG_ISP_BASE + 0xcc)
/** ISP_AE_Y_BSIZE : R/W; bitpos: [10:0]; default: 216;
 *  this field configures every block y size
 */
#define ISP_AE_Y_BSIZE    0x000007FFU
#define ISP_AE_Y_BSIZE_M  (ISP_AE_Y_BSIZE_V << ISP_AE_Y_BSIZE_S)
#define ISP_AE_Y_BSIZE_V  0x000007FFU
#define ISP_AE_Y_BSIZE_S  0
/** ISP_AE_Y_START : R/W; bitpos: [21:11]; default: 0;
 *  this field configures first block start y address
 */
#define ISP_AE_Y_START    0x000007FFU
#define ISP_AE_Y_START_M  (ISP_AE_Y_START_V << ISP_AE_Y_START_S)
#define ISP_AE_Y_START_V  0x000007FFU
#define ISP_AE_Y_START_S  11

