espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_AE_WINPIXNUM_REG register
 *  ae sub-window pix num register
 */
#define ISP_AE_WINPIXNUM_REG (DR_REG_ISP_BASE + 0xd0)
/** ISP_AE_SUBWIN_PIXNUM : R/W; bitpos: [16:0]; default: 82944;
 *  this field configures the pixel number of each sub win
 */
#define ISP_AE_SUBWIN_PIXNUM    0x0001FFFFU
#define ISP_AE_SUBWIN_PIXNUM_M  (ISP_AE_SUBWIN_PIXNUM_V << ISP_AE_SUBWIN_PIXNUM_S)
#define ISP_AE_SUBWIN_PIXNUM_V  0x0001FFFFU
#define ISP_AE_SUBWIN_PIXNUM_S  0

/** ISP_AE_WIN_RECIPROCAL_REG register
 *  reciprocal of ae sub-window pixel number
 */
#define ISP_AE_WIN_RECIPROCAL_REG (DR_REG_ISP_BASE + 0xd4)
/** ISP_AE_SUBWIN_RECIP : R/W; bitpos: [19:0]; default: 0;
 *  this field configures the reciprocal of each subwin_pixnum, 20bit fraction
 */
#define ISP_AE_SUBWIN_RECIP    0x000FFFFFU
#define ISP_AE_SUBWIN_RECIP_M  (ISP_AE_SUBWIN_RECIP_V << ISP_AE_SUBWIN_RECIP_S)
#define ISP_AE_SUBWIN_RECIP_V  0x000FFFFFU
#define ISP_AE_SUBWIN_RECIP_S  0

/** ISP_AE_BLOCK_MEAN_0_REG register
 *  ae statistic result register 0
 */
#define ISP_AE_BLOCK_MEAN_0_REG (DR_REG_ISP_BASE + 0xd8)
/** ISP_AE_B03_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field configures block03 Y mean data
 */
#define ISP_AE_B03_MEAN    0x000000FFU
#define ISP_AE_B03_MEAN_M  (ISP_AE_B03_MEAN_V << ISP_AE_B03_MEAN_S)
#define ISP_AE_B03_MEAN_V  0x000000FFU
#define ISP_AE_B03_MEAN_S  0
/** ISP_AE_B02_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field configures block02 Y mean data
 */
#define ISP_AE_B02_MEAN    0x000000FFU
#define ISP_AE_B02_MEAN_M  (ISP_AE_B02_MEAN_V << ISP_AE_B02_MEAN_S)
#define ISP_AE_B02_MEAN_V  0x000000FFU
#define ISP_AE_B02_MEAN_S  8
/** ISP_AE_B01_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field configures block01 Y mean data
 */
#define ISP_AE_B01_MEAN    0x000000FFU
#define ISP_AE_B01_MEAN_M  (ISP_AE_B01_MEAN_V << ISP_AE_B01_MEAN_S)
#define ISP_AE_B01_MEAN_V  0x000000FFU
#define ISP_AE_B01_MEAN_S  16
/** ISP_AE_B00_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block00 Y mean data
 */
#define ISP_AE_B00_MEAN    0x000000FFU
#define ISP_AE_B00_MEAN_M  (ISP_AE_B00_MEAN_V << ISP_AE_B00_MEAN_S)
#define ISP_AE_B00_MEAN_V  0x000000FFU
#define ISP_AE_B00_MEAN_S  24

/** ISP_AE_BLOCK_MEAN_1_REG register
 *  ae statistic result register 1
 */
#define ISP_AE_BLOCK_MEAN_1_REG (DR_REG_ISP_BASE + 0xdc)
/** ISP_AE_B12_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field configures block12 Y mean data
 */
#define ISP_AE_B12_MEAN    0x000000FFU
#define ISP_AE_B12_MEAN_M  (ISP_AE_B12_MEAN_V << ISP_AE_B12_MEAN_S)
#define ISP_AE_B12_MEAN_V  0x000000FFU
#define ISP_AE_B12_MEAN_S  0
/** ISP_AE_B11_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field configures block11 Y mean data
 */
#define ISP_AE_B11_MEAN    0x000000FFU
#define ISP_AE_B11_MEAN_M  (ISP_AE_B11_MEAN_V << ISP_AE_B11_MEAN_S)
#define ISP_AE_B11_MEAN_V  0x000000FFU
#define ISP_AE_B11_MEAN_S  8
/** ISP_AE_B10_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field configures block10 Y mean data
 */
#define ISP_AE_B10_MEAN    0x000000FFU
#define ISP_AE_B10_MEAN_M  (ISP_AE_B10_MEAN_V << ISP_AE_B10_MEAN_S)
#define ISP_AE_B10_MEAN_V  0x000000FFU
#define ISP_AE_B10_MEAN_S  16
/** ISP_AE_B04_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block04 Y mean data
 */
#define ISP_AE_B04_MEAN    0x000000FFU
#define ISP_AE_B04_MEAN_M  (ISP_AE_B04_MEAN_V << ISP_AE_B04_MEAN_S)
#define ISP_AE_B04_MEAN_V  0x000000FFU
#define ISP_AE_B04_MEAN_S  24

/** ISP_AE_BLOCK_MEAN_2_REG register
 *  ae statistic result register 2
 */
#define ISP_AE_BLOCK_MEAN_2_REG (DR_REG_ISP_BASE + 0xe0)
/** ISP_AE_B21_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field configures block21 Y mean data
 */
#define ISP_AE_B21_MEAN    0x000000FFU
#define ISP_AE_B21_MEAN_M  (ISP_AE_B21_MEAN_V << ISP_AE_B21_MEAN_S)
#define ISP_AE_B21_MEAN_V  0x000000FFU
#define ISP_AE_B21_MEAN_S  0
/** ISP_AE_B20_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field configures block20 Y mean data
 */
#define ISP_AE_B20_MEAN    0x000000FFU
#define ISP_AE_B20_MEAN_M  (ISP_AE_B20_MEAN_V << ISP_AE_B20_MEAN_S)
#define ISP_AE_B20_MEAN_V  0x000000FFU
#define ISP_AE_B20_MEAN_S  8
/** ISP_AE_B14_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field configures block14 Y mean data
 */
#define ISP_AE_B14_MEAN    0x000000FFU
#define ISP_AE_B14_MEAN_M  (ISP_AE_B14_MEAN_V << ISP_AE_B14_MEAN_S)
#define ISP_AE_B14_MEAN_V  0x000000FFU
#define ISP_AE_B14_MEAN_S  16
/** ISP_AE_B13_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block13 Y mean data
 */
#define ISP_AE_B13_MEAN    0x000000FFU
#define ISP_AE_B13_MEAN_M  (ISP_AE_B13_MEAN_V << ISP_AE_B13_MEAN_S)
#define ISP_AE_B13_MEAN_V  0x000000FFU
#define ISP_AE_B13_MEAN_S  24

/** ISP_AE_BLOCK_MEAN_3_REG register
 *  ae statistic result register 3
 */
#define ISP_AE_BLOCK_MEAN_3_REG (DR_REG_ISP_BASE + 0xe4)
/** ISP_AE_B30_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field configures block30 Y mean data
 */
#define ISP_AE_B30_MEAN    0x000000FFU
#define ISP_AE_B30_MEAN_M  (ISP_AE_B30_MEAN_V << ISP_AE_B30_MEAN_S)
#define ISP_AE_B30_MEAN_V  0x000000FFU
#define ISP_AE_B30_MEAN_S  0
/** ISP_AE_B24_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field configures block24 Y mean data
 */
#define ISP_AE_B24_MEAN    0x000000FFU
#define ISP_AE_B24_MEAN_M  (ISP_AE_B24_MEAN_V << ISP_AE_B24_MEAN_S)
#define ISP_AE_B24_MEAN_V  0x000000FFU
#define ISP_AE_B24_MEAN_S  8
/** ISP_AE_B23_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field configures block23 Y mean data
 */
#define ISP_AE_B23_MEAN    0x000000FFU
#define ISP_AE_B23_MEAN_M  (ISP_AE_B23_MEAN_V << ISP_AE_B23_MEAN_S)
#define ISP_AE_B23_MEAN_V  0x000000FFU
#define ISP_AE_B23_MEAN_S  16
/** ISP_AE_B22_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block22 Y mean data
 */
#define ISP_AE_B22_MEAN    0x000000FFU
#define ISP_AE_B22_MEAN_M  (ISP_AE_B22_MEAN_V << ISP_AE_B22_MEAN_S)
#define ISP_AE_B22_MEAN_V  0x000000FFU
#define ISP_AE_B22_MEAN_S  24

/** ISP_AE_BLOCK_MEAN_4_REG register
 *  ae statistic result register 4
 */
#define ISP_AE_BLOCK_MEAN_4_REG (DR_REG_ISP_BASE + 0xe8)
/** ISP_AE_B34_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field configures block34 Y mean data
 */
#define ISP_AE_B34_MEAN    0x000000FFU
#define ISP_AE_B34_MEAN_M  (ISP_AE_B34_MEAN_V << ISP_AE_B34_MEAN_S)
#define ISP_AE_B34_MEAN_V  0x000000FFU
#define ISP_AE_B34_MEAN_S  0
/** ISP_AE_B33_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field configures block33 Y mean data
 */
#define ISP_AE_B33_MEAN    0x000000FFU
#define ISP_AE_B33_MEAN_M  (ISP_AE_B33_MEAN_V << ISP_AE_B33_MEAN_S)
#define ISP_AE_B33_MEAN_V  0x000000FFU
#define ISP_AE_B33_MEAN_S  8
/** ISP_AE_B32_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field configures block32 Y mean data
 */
#define ISP_AE_B32_MEAN    0x000000FFU
#define ISP_AE_B32_MEAN_M  (ISP_AE_B32_MEAN_V << ISP_AE_B32_MEAN_S)
#define ISP_AE_B32_MEAN_V  0x000000FFU
#define ISP_AE_B32_MEAN_S  16
/** ISP_AE_B31_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block31 Y mean data
 */
#define ISP_AE_B31_MEAN    0x000000FFU
#define ISP_AE_B31_MEAN_M  (ISP_AE_B31_MEAN_V << ISP_AE_B31_MEAN_S)
#define ISP_AE_B31_MEAN_V  0x000000FFU
#define ISP_AE_B31_MEAN_S  24

/** ISP_AE_BLOCK_MEAN_5_REG register
 *  ae statistic result register 5
 */
#define ISP_AE_BLOCK_MEAN_5_REG (DR_REG_ISP_BASE + 0xec)
/** ISP_AE_B43_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field configures block43 Y mean data
 */
#define ISP_AE_B43_MEAN    0x000000FFU
#define ISP_AE_B43_MEAN_M  (ISP_AE_B43_MEAN_V << ISP_AE_B43_MEAN_S)
#define ISP_AE_B43_MEAN_V  0x000000FFU
#define ISP_AE_B43_MEAN_S  0
/** ISP_AE_B42_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field configures block42 Y mean data
 */
#define ISP_AE_B42_MEAN    0x000000FFU
#define ISP_AE_B42_MEAN_M  (ISP_AE_B42_MEAN_V << ISP_AE_B42_MEAN_S)
#define ISP_AE_B42_MEAN_V  0x000000FFU
#define ISP_AE_B42_MEAN_S  8
/** ISP_AE_B41_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field configures block41 Y mean data
 */
#define ISP_AE_B41_MEAN    0x000000FFU
#define ISP_AE_B41_MEAN_M  (ISP_AE_B41_MEAN_V << ISP_AE_B41_MEAN_S)
#define ISP_AE_B41_MEAN_V  0x000000FFU
#define ISP_AE_B41_MEAN_S  16
/** ISP_AE_B40_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block40 Y mean data
 */
#define ISP_AE_B40_MEAN    0x000000FFU
#define ISP_AE_B40_MEAN_M  (ISP_AE_B40_MEAN_V << ISP_AE_B40_MEAN_S)
#define ISP_AE_B40_MEAN_V  0x000000FFU
#define ISP_AE_B40_MEAN_S  24

