espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_AE_BLOCK_MEAN_6_REG register
 *  ae statistic result register 6
 */
#define ISP_AE_BLOCK_MEAN_6_REG (DR_REG_ISP_BASE + 0xf0)
/** ISP_AE_B44_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field configures block44 Y mean data
 */
#define ISP_AE_B44_MEAN    0x000000FFU
#define ISP_AE_B44_MEAN_M  (ISP_AE_B44_MEAN_V << ISP_AE_B44_MEAN_S)
#define ISP_AE_B44_MEAN_V  0x000000FFU
#define ISP_AE_B44_MEAN_S  24

/** ISP_SHARP_CTRL0_REG register
 *  sharp control register 0
 */
#define ISP_SHARP_CTRL0_REG (DR_REG_ISP_BASE + 0xf4)
/** ISP_SHARP_THRESHOLD_LOW : R/W; bitpos: [7:0]; default: 0;
 *  this field configures sharpen threshold for detail
 */
#define ISP_SHARP_THRESHOLD_LOW    0x000000FFU
#define ISP_SHARP_THRESHOLD_LOW_M  (ISP_SHARP_THRESHOLD_LOW_V << ISP_SHARP_THRESHOLD_LOW_S)
#define ISP_SHARP_THRESHOLD_LOW_V  0x000000FFU
#define ISP_SHARP_THRESHOLD_LOW_S  0
/** ISP_SHARP_THRESHOLD_HIGH : R/W; bitpos: [15:8]; default: 0;
 *  this field configures sharpen threshold for edge
 */
#define ISP_SHARP_THRESHOLD_HIGH    0x000000FFU
#define ISP_SHARP_THRESHOLD_HIGH_M  (ISP_SHARP_THRESHOLD_HIGH_V << ISP_SHARP_THRESHOLD_HIGH_S)
#define ISP_SHARP_THRESHOLD_HIGH_V  0x000000FFU
#define ISP_SHARP_THRESHOLD_HIGH_S  8
/** ISP_SHARP_AMOUNT_LOW : R/W; bitpos: [23:16]; default: 0;
 *  this field configures sharpen amount for detail
 */
#define ISP_SHARP_AMOUNT_LOW    0x000000FFU
#define ISP_SHARP_AMOUNT_LOW_M  (ISP_SHARP_AMOUNT_LOW_V << ISP_SHARP_AMOUNT_LOW_S)
#define ISP_SHARP_AMOUNT_LOW_V  0x000000FFU
#define ISP_SHARP_AMOUNT_LOW_S  16
/** ISP_SHARP_AMOUNT_HIGH : R/W; bitpos: [31:24]; default: 0;
 *  this field configures sharpen amount for edge
 */
#define ISP_SHARP_AMOUNT_HIGH    0x000000FFU
#define ISP_SHARP_AMOUNT_HIGH_M  (ISP_SHARP_AMOUNT_HIGH_V << ISP_SHARP_AMOUNT_HIGH_S)
#define ISP_SHARP_AMOUNT_HIGH_V  0x000000FFU
#define ISP_SHARP_AMOUNT_HIGH_S  24

/** ISP_SHARP_FILTER0_REG register
 *  sharp usm config register 0
 */
#define ISP_SHARP_FILTER0_REG (DR_REG_ISP_BASE + 0xf8)
/** ISP_SHARP_FILTER_COE00 : R/W; bitpos: [4:0]; default: 1;
 *  this field configures unsharp masking(usm) filter coefficient
 */
#define ISP_SHARP_FILTER_COE00    0x0000001FU
#define ISP_SHARP_FILTER_COE00_M  (ISP_SHARP_FILTER_COE00_V << ISP_SHARP_FILTER_COE00_S)
#define ISP_SHARP_FILTER_COE00_V  0x0000001FU
#define ISP_SHARP_FILTER_COE00_S  0
/** ISP_SHARP_FILTER_COE01 : R/W; bitpos: [9:5]; default: 2;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE01    0x0000001FU
#define ISP_SHARP_FILTER_COE01_M  (ISP_SHARP_FILTER_COE01_V << ISP_SHARP_FILTER_COE01_S)
#define ISP_SHARP_FILTER_COE01_V  0x0000001FU
#define ISP_SHARP_FILTER_COE01_S  5
/** ISP_SHARP_FILTER_COE02 : R/W; bitpos: [14:10]; default: 1;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE02    0x0000001FU
#define ISP_SHARP_FILTER_COE02_M  (ISP_SHARP_FILTER_COE02_V << ISP_SHARP_FILTER_COE02_S)
#define ISP_SHARP_FILTER_COE02_V  0x0000001FU
#define ISP_SHARP_FILTER_COE02_S  10

/** ISP_SHARP_FILTER1_REG register
 *  sharp usm config register 1
 */
#define ISP_SHARP_FILTER1_REG (DR_REG_ISP_BASE + 0xfc)
/** ISP_SHARP_FILTER_COE10 : R/W; bitpos: [4:0]; default: 2;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE10    0x0000001FU
#define ISP_SHARP_FILTER_COE10_M  (ISP_SHARP_FILTER_COE10_V << ISP_SHARP_FILTER_COE10_S)
#define ISP_SHARP_FILTER_COE10_V  0x0000001FU
#define ISP_SHARP_FILTER_COE10_S  0
/** ISP_SHARP_FILTER_COE11 : R/W; bitpos: [9:5]; default: 4;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE11    0x0000001FU
#define ISP_SHARP_FILTER_COE11_M  (ISP_SHARP_FILTER_COE11_V << ISP_SHARP_FILTER_COE11_S)
#define ISP_SHARP_FILTER_COE11_V  0x0000001FU
#define ISP_SHARP_FILTER_COE11_S  5
/** ISP_SHARP_FILTER_COE12 : R/W; bitpos: [14:10]; default: 2;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE12    0x0000001FU
#define ISP_SHARP_FILTER_COE12_M  (ISP_SHARP_FILTER_COE12_V << ISP_SHARP_FILTER_COE12_S)
#define ISP_SHARP_FILTER_COE12_V  0x0000001FU
#define ISP_SHARP_FILTER_COE12_S  10

/** ISP_SHARP_FILTER2_REG register
 *  sharp usm config register 2
 */
#define ISP_SHARP_FILTER2_REG (DR_REG_ISP_BASE + 0x100)
/** ISP_SHARP_FILTER_COE20 : R/W; bitpos: [4:0]; default: 1;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE20    0x0000001FU
#define ISP_SHARP_FILTER_COE20_M  (ISP_SHARP_FILTER_COE20_V << ISP_SHARP_FILTER_COE20_S)
#define ISP_SHARP_FILTER_COE20_V  0x0000001FU
#define ISP_SHARP_FILTER_COE20_S  0
/** ISP_SHARP_FILTER_COE21 : R/W; bitpos: [9:5]; default: 2;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE21    0x0000001FU
#define ISP_SHARP_FILTER_COE21_M  (ISP_SHARP_FILTER_COE21_V << ISP_SHARP_FILTER_COE21_S)
#define ISP_SHARP_FILTER_COE21_V  0x0000001FU
#define ISP_SHARP_FILTER_COE21_S  5
/** ISP_SHARP_FILTER_COE22 : R/W; bitpos: [14:10]; default: 1;
 *  this field configures usm filter coefficient
 */
#define ISP_SHARP_FILTER_COE22    0x0000001FU
#define ISP_SHARP_FILTER_COE22_M  (ISP_SHARP_FILTER_COE22_V << ISP_SHARP_FILTER_COE22_S)
#define ISP_SHARP_FILTER_COE22_V  0x0000001FU
#define ISP_SHARP_FILTER_COE22_S  10

/** ISP_SHARP_MATRIX_CTRL_REG register
 *  sharp pix2matrix ctrl
 */
#define ISP_SHARP_MATRIX_CTRL_REG (DR_REG_ISP_BASE + 0x104)
/** ISP_SHARP_TAIL_PIXEN_PULSE_TL : R/W; bitpos: [7:0]; default: 0;
 *  matrix tail pixen low level threshold,  should not to large to prevent expanding to
 *  next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and
 *  reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th <
 *  reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function
 */
#define ISP_SHARP_TAIL_PIXEN_PULSE_TL    0x000000FFU
#define ISP_SHARP_TAIL_PIXEN_PULSE_TL_M  (ISP_SHARP_TAIL_PIXEN_PULSE_TL_V << ISP_SHARP_TAIL_PIXEN_PULSE_TL_S)
#define ISP_SHARP_TAIL_PIXEN_PULSE_TL_V  0x000000FFU
#define ISP_SHARP_TAIL_PIXEN_PULSE_TL_S  0
/** ISP_SHARP_TAIL_PIXEN_PULSE_TH : R/W; bitpos: [15:8]; default: 0;
 *  matrix tail pixen high level threshold, must < hnum-1, only
 *  reg_sharp_tail_pixen_pulse_th!=0 and reg_sharp_tail_pixen_pulse_tl!=0 and
 *  reg_sharp_tail_pixen_pulse_th < reg_sharp_tail_pixen_pulse_tl will enable tail
 *  pulse function
 */
#define ISP_SHARP_TAIL_PIXEN_PULSE_TH    0x000000FFU
#define ISP_SHARP_TAIL_PIXEN_PULSE_TH_M  (ISP_SHARP_TAIL_PIXEN_PULSE_TH_V << ISP_SHARP_TAIL_PIXEN_PULSE_TH_S)
#define ISP_SHARP_TAIL_PIXEN_PULSE_TH_V  0x000000FFU
#define ISP_SHARP_TAIL_PIXEN_PULSE_TH_S  8
/** ISP_SHARP_PADDING_DATA : R/W; bitpos: [23:16]; default: 0;
 *  this field configures sharp padding data
 */
#define ISP_SHARP_PADDING_DATA    0x000000FFU
#define ISP_SHARP_PADDING_DATA_M  (ISP_SHARP_PADDING_DATA_V << ISP_SHARP_PADDING_DATA_S)
#define ISP_SHARP_PADDING_DATA_V  0x000000FFU
#define ISP_SHARP_PADDING_DATA_S  16
/** ISP_SHARP_PADDING_MODE : R/W; bitpos: [24]; default: 0;
 *  this field configures sharp padding mode
 */
#define ISP_SHARP_PADDING_MODE    (BIT(24))
#define ISP_SHARP_PADDING_MODE_M  (ISP_SHARP_PADDING_MODE_V << ISP_SHARP_PADDING_MODE_S)
#define ISP_SHARP_PADDING_MODE_V  0x00000001U
#define ISP_SHARP_PADDING_MODE_S  24

/** ISP_SHARP_CTRL1_REG register
 *  sharp control register 1
 */
#define ISP_SHARP_CTRL1_REG (DR_REG_ISP_BASE + 0x108)
/** ISP_SHARP_GRADIENT_MAX : RO; bitpos: [7:0]; default: 0;
 *  this field configures sharp max gradient, refresh at the end of each frame end
 */
#define ISP_SHARP_GRADIENT_MAX    0x000000FFU
#define ISP_SHARP_GRADIENT_MAX_M  (ISP_SHARP_GRADIENT_MAX_V << ISP_SHARP_GRADIENT_MAX_S)
#define ISP_SHARP_GRADIENT_MAX_V  0x000000FFU
#define ISP_SHARP_GRADIENT_MAX_S  0

/** ISP_DMA_CNTL_REG register
 *  isp dma source trans control register
 */
#define ISP_DMA_CNTL_REG (DR_REG_ISP_BASE + 0x10c)
/** ISP_DMA_EN : WT; bitpos: [0]; default: 0;
 *  write 1 to trigger dma to get 1 frame
 */
#define ISP_DMA_EN    (BIT(0))
#define ISP_DMA_EN_M  (ISP_DMA_EN_V << ISP_DMA_EN_S)
#define ISP_DMA_EN_V  0x00000001U
#define ISP_DMA_EN_S  0
/** ISP_DMA_UPDATE_REG : R/W; bitpos: [1]; default: 0;
 *  write 1 to update reg_dma_burst_len & reg_dma_data_type
 */
#define ISP_DMA_UPDATE_REG    (BIT(1))
#define ISP_DMA_UPDATE_REG_M  (ISP_DMA_UPDATE_REG_V << ISP_DMA_UPDATE_REG_S)
#define ISP_DMA_UPDATE_REG_V  0x00000001U
#define ISP_DMA_UPDATE_REG_S  1
/** ISP_DMA_DATA_TYPE : R/W; bitpos: [7:2]; default: 42;
 *  this field configures the idi data type for image data
 */
#define ISP_DMA_DATA_TYPE    0x0000003FU
#define ISP_DMA_DATA_TYPE_M  (ISP_DMA_DATA_TYPE_V << ISP_DMA_DATA_TYPE_S)
#define ISP_DMA_DATA_TYPE_V  0x0000003FU
#define ISP_DMA_DATA_TYPE_S  2
/** ISP_DMA_BURST_LEN : R/W; bitpos: [19:8]; default: 128;
 *  this field configures dma burst len when data source is dma. set according to
 *  dma_msize, it is the number of 64bits in a dma transfer
 */
#define ISP_DMA_BURST_LEN    0x00000FFFU
#define ISP_DMA_BURST_LEN_M  (ISP_DMA_BURST_LEN_V << ISP_DMA_BURST_LEN_S)
#define ISP_DMA_BURST_LEN_V  0x00000FFFU
#define ISP_DMA_BURST_LEN_S  8
/** ISP_DMA_INTERVAL : R/W; bitpos: [31:20]; default: 1;
 *  this field configures dma req interval, 12'b1: 1 cycle, 12'b11 2 cycle ...
 */
#define ISP_DMA_INTERVAL    0x00000FFFU
#define ISP_DMA_INTERVAL_M  (ISP_DMA_INTERVAL_V << ISP_DMA_INTERVAL_S)
#define ISP_DMA_INTERVAL_V  0x00000FFFU
#define ISP_DMA_INTERVAL_S  20

/** ISP_DMA_RAW_DATA_REG register
 *  isp dma source total raw number set register
 */
#define ISP_DMA_RAW_DATA_REG (DR_REG_ISP_BASE + 0x110)
/** ISP_DMA_RAW_NUM_TOTAL : R/W; bitpos: [21:0]; default: 0;
 *  this field configures the the number of 64bits in a frame
 */
#define ISP_DMA_RAW_NUM_TOTAL    0x003FFFFFU
#define ISP_DMA_RAW_NUM_TOTAL_M  (ISP_DMA_RAW_NUM_TOTAL_V << ISP_DMA_RAW_NUM_TOTAL_S)
#define ISP_DMA_RAW_NUM_TOTAL_V  0x003FFFFFU
#define ISP_DMA_RAW_NUM_TOTAL_S  0
/** ISP_DMA_RAW_NUM_TOTAL_SET : WT; bitpos: [31]; default: 0;
 *  write 1 to update reg_dma_raw_num_total
 */
#define ISP_DMA_RAW_NUM_TOTAL_SET    (BIT(31))
#define ISP_DMA_RAW_NUM_TOTAL_SET_M  (ISP_DMA_RAW_NUM_TOTAL_SET_V << ISP_DMA_RAW_NUM_TOTAL_SET_S)
#define ISP_DMA_RAW_NUM_TOTAL_SET_V  0x00000001U
#define ISP_DMA_RAW_NUM_TOTAL_SET_S  31

/** ISP_CAM_CNTL_REG register
 *  isp cam source control register
 */
#define ISP_CAM_CNTL_REG (DR_REG_ISP_BASE + 0x114)
/** ISP_CAM_EN : R/W; bitpos: [0]; default: 0;
 *  write 1 to start receive camera data, write 0 to disable
 */
#define ISP_CAM_EN    (BIT(0))
#define ISP_CAM_EN_M  (ISP_CAM_EN_V << ISP_CAM_EN_S)
#define ISP_CAM_EN_V  0x00000001U
#define ISP_CAM_EN_S  0
/** ISP_CAM_UPDATE_REG : R/W; bitpos: [1]; default: 0;
 *  write 1 to update ISP_CAM_CONF
 */
#define ISP_CAM_UPDATE_REG    (BIT(1))
#define ISP_CAM_UPDATE_REG_M  (ISP_CAM_UPDATE_REG_V << ISP_CAM_UPDATE_REG_S)
#define ISP_CAM_UPDATE_REG_V  0x00000001U
#define ISP_CAM_UPDATE_REG_S  1
/** ISP_CAM_RESET : R/W; bitpos: [2]; default: 1;
 *  this bit configures cam clk domain reset, 1: reset cam input logic, 0: release reset
 */
#define ISP_CAM_RESET    (BIT(2))
#define ISP_CAM_RESET_M  (ISP_CAM_RESET_V << ISP_CAM_RESET_S)
#define ISP_CAM_RESET_V  0x00000001U
#define ISP_CAM_RESET_S  2
/** ISP_CAM_CLK_INV : R/W; bitpos: [3]; default: 0;
 *  this bit configures the inversion of cam clk from pad. 0: not invert cam clk, 1:
 *  invert cam clk
 */
#define ISP_CAM_CLK_INV    (BIT(3))
#define ISP_CAM_CLK_INV_M  (ISP_CAM_CLK_INV_V << ISP_CAM_CLK_INV_S)
#define ISP_CAM_CLK_INV_V  0x00000001U
#define ISP_CAM_CLK_INV_S  3

/** ISP_CAM_CONF_REG register
 *  isp cam source config register
 */
#define ISP_CAM_CONF_REG (DR_REG_ISP_BASE + 0x118)
/** ISP_CAM_DATA_ORDER : R/W; bitpos: [0]; default: 0;
 *  this field configures data order of cam port, 0: cam_data_in, 1:{cam_data_in[7:0],
 *  cam_data_in[15:8]}
 */
#define ISP_CAM_DATA_ORDER    (BIT(0))
#define ISP_CAM_DATA_ORDER_M  (ISP_CAM_DATA_ORDER_V << ISP_CAM_DATA_ORDER_S)
#define ISP_CAM_DATA_ORDER_V  0x00000001U
#define ISP_CAM_DATA_ORDER_S  0
/** ISP_CAM_2BYTE_MODE : R/W; bitpos: [1]; default: 0;
 *  this field configures enable of cam 2 byte mode(input 2 bytes each clock). 0:
 *  disable, 1: enable
 */
#define ISP_CAM_2BYTE_MODE    (BIT(1))
#define ISP_CAM_2BYTE_MODE_M  (ISP_CAM_2BYTE_MODE_V << ISP_CAM_2BYTE_MODE_S)
#define ISP_CAM_2BYTE_MODE_V  0x00000001U
#define ISP_CAM_2BYTE_MODE_S  1
/** ISP_CAM_DATA_TYPE : R/W; bitpos: [7:2]; default: 42;
 *  this field configures idi data type for image data, 0x2a: RAW8, 0x2b: RAW10, 0x2c:
 *  RAW12
 */
#define ISP_CAM_DATA_TYPE    0x0000003FU
#define ISP_CAM_DATA_TYPE_M  (ISP_CAM_DATA_TYPE_V << ISP_CAM_DATA_TYPE_S)
#define ISP_CAM_DATA_TYPE_V  0x0000003FU
#define ISP_CAM_DATA_TYPE_S  2
/** ISP_CAM_DE_INV : R/W; bitpos: [8]; default: 0;
 *  this bit configures cam data enable invert. 0: not invert, 1: invert
 */
#define ISP_CAM_DE_INV    (BIT(8))
#define ISP_CAM_DE_INV_M  (ISP_CAM_DE_INV_V << ISP_CAM_DE_INV_S)
#define ISP_CAM_DE_INV_V  0x00000001U
#define ISP_CAM_DE_INV_S  8
/** ISP_CAM_HSYNC_INV : R/W; bitpos: [9]; default: 0;
 *  this bit configures cam hsync invert. 0: not invert, 1: invert
 */
#define ISP_CAM_HSYNC_INV    (BIT(9))
#define ISP_CAM_HSYNC_INV_M  (ISP_CAM_HSYNC_INV_V << ISP_CAM_HSYNC_INV_S)
#define ISP_CAM_HSYNC_INV_V  0x00000001U
#define ISP_CAM_HSYNC_INV_S  9
/** ISP_CAM_VSYNC_INV : R/W; bitpos: [10]; default: 0;
 *  this bit configures cam vsync invert. 0: not invert, 1: invert
 */
#define ISP_CAM_VSYNC_INV    (BIT(10))
#define ISP_CAM_VSYNC_INV_M  (ISP_CAM_VSYNC_INV_V << ISP_CAM_VSYNC_INV_S)
#define ISP_CAM_VSYNC_INV_V  0x00000001U
#define ISP_CAM_VSYNC_INV_S  10
/** ISP_CAM_VSYNC_FILTER_THRES : R/W; bitpos: [13:11]; default: 0;
 *  this bit configures the number of clock of vsync filter length
 */
#define ISP_CAM_VSYNC_FILTER_THRES    0x00000007U
#define ISP_CAM_VSYNC_FILTER_THRES_M  (ISP_CAM_VSYNC_FILTER_THRES_V << ISP_CAM_VSYNC_FILTER_THRES_S)
#define ISP_CAM_VSYNC_FILTER_THRES_V  0x00000007U
#define ISP_CAM_VSYNC_FILTER_THRES_S  11
/** ISP_CAM_VSYNC_FILTER_EN : R/W; bitpos: [14]; default: 0;
 *  this bit configures vsync filter en
 */
#define ISP_CAM_VSYNC_FILTER_EN    (BIT(14))
#define ISP_CAM_VSYNC_FILTER_EN_M  (ISP_CAM_VSYNC_FILTER_EN_V << ISP_CAM_VSYNC_FILTER_EN_S)
#define ISP_CAM_VSYNC_FILTER_EN_V  0x00000001U
#define ISP_CAM_VSYNC_FILTER_EN_S  14

/** ISP_AF_CTRL0_REG register
 *  af control register 0
 */
#define ISP_AF_CTRL0_REG (DR_REG_ISP_BASE + 0x11c)
/** ISP_AF_AUTO_UPDATE : R/W; bitpos: [0]; default: 0;
 *  this bit configures auto_update enable. when set to 1, will update sum and lum each
 *  frame
 */
#define ISP_AF_AUTO_UPDATE    (BIT(0))
#define ISP_AF_AUTO_UPDATE_M  (ISP_AF_AUTO_UPDATE_V << ISP_AF_AUTO_UPDATE_S)
#define ISP_AF_AUTO_UPDATE_V  0x00000001U
#define ISP_AF_AUTO_UPDATE_S  0
/** ISP_AF_MANUAL_UPDATE : WT; bitpos: [4]; default: 0;
 *  write 1 to this bit will update the sum and lum once
 */
#define ISP_AF_MANUAL_UPDATE    (BIT(4))
#define ISP_AF_MANUAL_UPDATE_M  (ISP_AF_MANUAL_UPDATE_V << ISP_AF_MANUAL_UPDATE_S)
#define ISP_AF_MANUAL_UPDATE_V  0x00000001U
#define ISP_AF_MANUAL_UPDATE_S  4
/** ISP_AF_ENV_THRESHOLD : R/W; bitpos: [11:8]; default: 0;
 *  this field configures env threshold. when both sum and lum changes larger than this
 *  value, consider environment changes and need to trigger a new autofocus. 4Bit
 *  fractional
 */
#define ISP_AF_ENV_THRESHOLD    0x0000000FU
#define ISP_AF_ENV_THRESHOLD_M  (ISP_AF_ENV_THRESHOLD_V << ISP_AF_ENV_THRESHOLD_S)
#define ISP_AF_ENV_THRESHOLD_V  0x0000000FU
#define ISP_AF_ENV_THRESHOLD_S  8
/** ISP_AF_ENV_PERIOD : R/W; bitpos: [23:16]; default: 0;
 *  this field configures environment changes detection period (frame). When set to 0,
 *  disable this function
 */
#define ISP_AF_ENV_PERIOD    0x000000FFU
#define ISP_AF_ENV_PERIOD_M  (ISP_AF_ENV_PERIOD_V << ISP_AF_ENV_PERIOD_S)
#define ISP_AF_ENV_PERIOD_V  0x000000FFU
#define ISP_AF_ENV_PERIOD_S  16

