espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_AF_CTRL1_REG register
 *  af control register 1
 */
#define ISP_AF_CTRL1_REG (DR_REG_ISP_BASE + 0x120)
/** ISP_AF_THPIXNUM : R/W; bitpos: [21:0]; default: 0;
 *  this field configures pixnum used when calculating the autofocus threshold. Set to
 *  0 to disable threshold calculation
 */
#define ISP_AF_THPIXNUM    0x003FFFFFU
#define ISP_AF_THPIXNUM_M  (ISP_AF_THPIXNUM_V << ISP_AF_THPIXNUM_S)
#define ISP_AF_THPIXNUM_V  0x003FFFFFU
#define ISP_AF_THPIXNUM_S  0

/** ISP_AF_GEN_TH_CTRL_REG register
 *  af gen threshold control register
 */
#define ISP_AF_GEN_TH_CTRL_REG (DR_REG_ISP_BASE + 0x124)
/** ISP_AF_GEN_THRESHOLD_MIN : R/W; bitpos: [15:0]; default: 128;
 *  this field configures min threshold when use auto_threshold
 */
#define ISP_AF_GEN_THRESHOLD_MIN    0x0000FFFFU
#define ISP_AF_GEN_THRESHOLD_MIN_M  (ISP_AF_GEN_THRESHOLD_MIN_V << ISP_AF_GEN_THRESHOLD_MIN_S)
#define ISP_AF_GEN_THRESHOLD_MIN_V  0x0000FFFFU
#define ISP_AF_GEN_THRESHOLD_MIN_S  0
/** ISP_AF_GEN_THRESHOLD_MAX : R/W; bitpos: [31:16]; default: 1088;
 *  this field configures max threshold when use auto_threshold
 */
#define ISP_AF_GEN_THRESHOLD_MAX    0x0000FFFFU
#define ISP_AF_GEN_THRESHOLD_MAX_M  (ISP_AF_GEN_THRESHOLD_MAX_V << ISP_AF_GEN_THRESHOLD_MAX_S)
#define ISP_AF_GEN_THRESHOLD_MAX_V  0x0000FFFFU
#define ISP_AF_GEN_THRESHOLD_MAX_S  16

/** ISP_AF_ENV_USER_TH_SUM_REG register
 *  af monitor user sum threshold register
 */
#define ISP_AF_ENV_USER_TH_SUM_REG (DR_REG_ISP_BASE + 0x128)
/** ISP_AF_ENV_USER_THRESHOLD_SUM : R/W; bitpos: [31:0]; default: 0;
 *  this field configures user setup env detect sum threshold
 */
#define ISP_AF_ENV_USER_THRESHOLD_SUM    0xFFFFFFFFU
#define ISP_AF_ENV_USER_THRESHOLD_SUM_M  (ISP_AF_ENV_USER_THRESHOLD_SUM_V << ISP_AF_ENV_USER_THRESHOLD_SUM_S)
#define ISP_AF_ENV_USER_THRESHOLD_SUM_V  0xFFFFFFFFU
#define ISP_AF_ENV_USER_THRESHOLD_SUM_S  0

/** ISP_AF_ENV_USER_TH_LUM_REG register
 *  af monitor user lum threshold register
 */
#define ISP_AF_ENV_USER_TH_LUM_REG (DR_REG_ISP_BASE + 0x12c)
/** ISP_AF_ENV_USER_THRESHOLD_LUM : R/W; bitpos: [29:0]; default: 0;
 *  this field configures user setup env detect lum threshold
 */
#define ISP_AF_ENV_USER_THRESHOLD_LUM    0x3FFFFFFFU
#define ISP_AF_ENV_USER_THRESHOLD_LUM_M  (ISP_AF_ENV_USER_THRESHOLD_LUM_V << ISP_AF_ENV_USER_THRESHOLD_LUM_S)
#define ISP_AF_ENV_USER_THRESHOLD_LUM_V  0x3FFFFFFFU
#define ISP_AF_ENV_USER_THRESHOLD_LUM_S  0

/** ISP_AF_THRESHOLD_REG register
 *  af threshold register
 */
#define ISP_AF_THRESHOLD_REG (DR_REG_ISP_BASE + 0x130)
/** ISP_AF_THRESHOLD : R/W; bitpos: [15:0]; default: 256;
 *  this field configures user threshold. When set to non-zero, autofocus will use this
 *  threshold
 */
#define ISP_AF_THRESHOLD    0x0000FFFFU
#define ISP_AF_THRESHOLD_M  (ISP_AF_THRESHOLD_V << ISP_AF_THRESHOLD_S)
#define ISP_AF_THRESHOLD_V  0x0000FFFFU
#define ISP_AF_THRESHOLD_S  0
/** ISP_AF_GEN_THRESHOLD : RO; bitpos: [31:16]; default: 0;
 *  this field represents the last calculated threshold
 */
#define ISP_AF_GEN_THRESHOLD    0x0000FFFFU
#define ISP_AF_GEN_THRESHOLD_M  (ISP_AF_GEN_THRESHOLD_V << ISP_AF_GEN_THRESHOLD_S)
#define ISP_AF_GEN_THRESHOLD_V  0x0000FFFFU
#define ISP_AF_GEN_THRESHOLD_S  16

/** ISP_AF_HSCALE_A_REG register
 *  h-scale of af window a register
 */
#define ISP_AF_HSCALE_A_REG (DR_REG_ISP_BASE + 0x134)
/** ISP_AF_RPOINT_A : R/W; bitpos: [11:0]; default: 128;
 *  this field configures left coordinate of focus window a, must >= 2
 */
#define ISP_AF_RPOINT_A    0x00000FFFU
#define ISP_AF_RPOINT_A_M  (ISP_AF_RPOINT_A_V << ISP_AF_RPOINT_A_S)
#define ISP_AF_RPOINT_A_V  0x00000FFFU
#define ISP_AF_RPOINT_A_S  0
/** ISP_AF_LPOINT_A : R/W; bitpos: [27:16]; default: 1;
 *  this field configures top coordinate of focus window a, must >= 2
 */
#define ISP_AF_LPOINT_A    0x00000FFFU
#define ISP_AF_LPOINT_A_M  (ISP_AF_LPOINT_A_V << ISP_AF_LPOINT_A_S)
#define ISP_AF_LPOINT_A_V  0x00000FFFU
#define ISP_AF_LPOINT_A_S  16

/** ISP_AF_VSCALE_A_REG register
 *  v-scale of af window a register
 */
#define ISP_AF_VSCALE_A_REG (DR_REG_ISP_BASE + 0x138)
/** ISP_AF_BPOINT_A : R/W; bitpos: [11:0]; default: 128;
 *  this field configures right coordinate of focus window a, must <= hnum-2
 */
#define ISP_AF_BPOINT_A    0x00000FFFU
#define ISP_AF_BPOINT_A_M  (ISP_AF_BPOINT_A_V << ISP_AF_BPOINT_A_S)
#define ISP_AF_BPOINT_A_V  0x00000FFFU
#define ISP_AF_BPOINT_A_S  0
/** ISP_AF_TPOINT_A : R/W; bitpos: [27:16]; default: 1;
 *  this field configures bottom coordinate of focus window a, must <= hnum-2
 */
#define ISP_AF_TPOINT_A    0x00000FFFU
#define ISP_AF_TPOINT_A_M  (ISP_AF_TPOINT_A_V << ISP_AF_TPOINT_A_S)
#define ISP_AF_TPOINT_A_V  0x00000FFFU
#define ISP_AF_TPOINT_A_S  16

/** ISP_AF_HSCALE_B_REG register
 *  h-scale of af window b register
 */
#define ISP_AF_HSCALE_B_REG (DR_REG_ISP_BASE + 0x13c)
/** ISP_AF_RPOINT_B : R/W; bitpos: [11:0]; default: 128;
 *  this field configures left coordinate of focus window b, must >= 2
 */
#define ISP_AF_RPOINT_B    0x00000FFFU
#define ISP_AF_RPOINT_B_M  (ISP_AF_RPOINT_B_V << ISP_AF_RPOINT_B_S)
#define ISP_AF_RPOINT_B_V  0x00000FFFU
#define ISP_AF_RPOINT_B_S  0
/** ISP_AF_LPOINT_B : R/W; bitpos: [27:16]; default: 1;
 *  this field configures top coordinate of focus window b, must >= 2
 */
#define ISP_AF_LPOINT_B    0x00000FFFU
#define ISP_AF_LPOINT_B_M  (ISP_AF_LPOINT_B_V << ISP_AF_LPOINT_B_S)
#define ISP_AF_LPOINT_B_V  0x00000FFFU
#define ISP_AF_LPOINT_B_S  16

/** ISP_AF_VSCALE_B_REG register
 *  v-scale of af window b register
 */
#define ISP_AF_VSCALE_B_REG (DR_REG_ISP_BASE + 0x140)
/** ISP_AF_BPOINT_B : R/W; bitpos: [11:0]; default: 128;
 *  this field configures right coordinate of focus window b, must <= hnum-2
 */
#define ISP_AF_BPOINT_B    0x00000FFFU
#define ISP_AF_BPOINT_B_M  (ISP_AF_BPOINT_B_V << ISP_AF_BPOINT_B_S)
#define ISP_AF_BPOINT_B_V  0x00000FFFU
#define ISP_AF_BPOINT_B_S  0
/** ISP_AF_TPOINT_B : R/W; bitpos: [27:16]; default: 1;
 *  this field configures bottom coordinate of focus window b, must <= hnum-2
 */
#define ISP_AF_TPOINT_B    0x00000FFFU
#define ISP_AF_TPOINT_B_M  (ISP_AF_TPOINT_B_V << ISP_AF_TPOINT_B_S)
#define ISP_AF_TPOINT_B_V  0x00000FFFU
#define ISP_AF_TPOINT_B_S  16

/** ISP_AF_HSCALE_C_REG register
 *  v-scale of af window c register
 */
#define ISP_AF_HSCALE_C_REG (DR_REG_ISP_BASE + 0x144)
/** ISP_AF_RPOINT_C : R/W; bitpos: [11:0]; default: 128;
 *  this field configures left coordinate of focus window c, must >= 2
 */
#define ISP_AF_RPOINT_C    0x00000FFFU
#define ISP_AF_RPOINT_C_M  (ISP_AF_RPOINT_C_V << ISP_AF_RPOINT_C_S)
#define ISP_AF_RPOINT_C_V  0x00000FFFU
#define ISP_AF_RPOINT_C_S  0
/** ISP_AF_LPOINT_C : R/W; bitpos: [27:16]; default: 1;
 *  this field configures top coordinate of focus window c, must >= 2
 */
#define ISP_AF_LPOINT_C    0x00000FFFU
#define ISP_AF_LPOINT_C_M  (ISP_AF_LPOINT_C_V << ISP_AF_LPOINT_C_S)
#define ISP_AF_LPOINT_C_V  0x00000FFFU
#define ISP_AF_LPOINT_C_S  16

/** ISP_AF_VSCALE_C_REG register
 *  v-scale of af window c register
 */
#define ISP_AF_VSCALE_C_REG (DR_REG_ISP_BASE + 0x148)
/** ISP_AF_BPOINT_C : R/W; bitpos: [11:0]; default: 128;
 *  this field configures right coordinate of focus window c, must <= hnum-2
 */
#define ISP_AF_BPOINT_C    0x00000FFFU
#define ISP_AF_BPOINT_C_M  (ISP_AF_BPOINT_C_V << ISP_AF_BPOINT_C_S)
#define ISP_AF_BPOINT_C_V  0x00000FFFU
#define ISP_AF_BPOINT_C_S  0
/** ISP_AF_TPOINT_C : R/W; bitpos: [27:16]; default: 1;
 *  this field configures bottom coordinate of focus window c, must <= hnum-2
 */
#define ISP_AF_TPOINT_C    0x00000FFFU
#define ISP_AF_TPOINT_C_M  (ISP_AF_TPOINT_C_V << ISP_AF_TPOINT_C_S)
#define ISP_AF_TPOINT_C_V  0x00000FFFU
#define ISP_AF_TPOINT_C_S  16

