espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_AF_SUM_A_REG register
 *  result of sum of af window a
 */
#define ISP_AF_SUM_A_REG (DR_REG_ISP_BASE + 0x14c)
/** ISP_AF_SUMA : RO; bitpos: [29:0]; default: 0;
 *  this field represents the result of accumulation of pix grad of focus window a
 */
#define ISP_AF_SUMA    0x3FFFFFFFU
#define ISP_AF_SUMA_M  (ISP_AF_SUMA_V << ISP_AF_SUMA_S)
#define ISP_AF_SUMA_V  0x3FFFFFFFU
#define ISP_AF_SUMA_S  0

/** ISP_AF_SUM_B_REG register
 *  result of sum of af window b
 */
#define ISP_AF_SUM_B_REG (DR_REG_ISP_BASE + 0x150)
/** ISP_AF_SUMB : RO; bitpos: [29:0]; default: 0;
 *  this field represents the result of accumulation of pix grad of focus window b
 */
#define ISP_AF_SUMB    0x3FFFFFFFU
#define ISP_AF_SUMB_M  (ISP_AF_SUMB_V << ISP_AF_SUMB_S)
#define ISP_AF_SUMB_V  0x3FFFFFFFU
#define ISP_AF_SUMB_S  0

/** ISP_AF_SUM_C_REG register
 *  result of sum of af window c
 */
#define ISP_AF_SUM_C_REG (DR_REG_ISP_BASE + 0x154)
/** ISP_AF_SUMC : RO; bitpos: [29:0]; default: 0;
 *  this field represents the result of accumulation of pix grad of focus window c
 */
#define ISP_AF_SUMC    0x3FFFFFFFU
#define ISP_AF_SUMC_M  (ISP_AF_SUMC_V << ISP_AF_SUMC_S)
#define ISP_AF_SUMC_V  0x3FFFFFFFU
#define ISP_AF_SUMC_S  0

/** ISP_AF_LUM_A_REG register
 *  result of lum of af window a
 */
#define ISP_AF_LUM_A_REG (DR_REG_ISP_BASE + 0x158)
/** ISP_AF_LUMA : RO; bitpos: [27:0]; default: 0;
 *  this field represents the result of accumulation of pix light of focus window a
 */
#define ISP_AF_LUMA    0x0FFFFFFFU
#define ISP_AF_LUMA_M  (ISP_AF_LUMA_V << ISP_AF_LUMA_S)
#define ISP_AF_LUMA_V  0x0FFFFFFFU
#define ISP_AF_LUMA_S  0

/** ISP_AF_LUM_B_REG register
 *  result of lum of af window b
 */
#define ISP_AF_LUM_B_REG (DR_REG_ISP_BASE + 0x15c)
/** ISP_AF_LUMB : RO; bitpos: [27:0]; default: 0;
 *  this field represents the result of accumulation of pix light of focus window b
 */
#define ISP_AF_LUMB    0x0FFFFFFFU
#define ISP_AF_LUMB_M  (ISP_AF_LUMB_V << ISP_AF_LUMB_S)
#define ISP_AF_LUMB_V  0x0FFFFFFFU
#define ISP_AF_LUMB_S  0

/** ISP_AF_LUM_C_REG register
 *  result of lum of af window c
 */
#define ISP_AF_LUM_C_REG (DR_REG_ISP_BASE + 0x160)
/** ISP_AF_LUMC : RO; bitpos: [27:0]; default: 0;
 *  this field represents the result of accumulation of pix light of focus window c
 */
#define ISP_AF_LUMC    0x0FFFFFFFU
#define ISP_AF_LUMC_M  (ISP_AF_LUMC_V << ISP_AF_LUMC_S)
#define ISP_AF_LUMC_V  0x0FFFFFFFU
#define ISP_AF_LUMC_S  0

/** ISP_AWB_MODE_REG register
 *  awb mode control register
 */
#define ISP_AWB_MODE_REG (DR_REG_ISP_BASE + 0x164)
/** ISP_AWB_MODE : R/W; bitpos: [1:0]; default: 3;
 *  this field configures awb algo sel. 00: none selected. 01: sel algo0. 10: sel
 *  algo1. 11: sel both algo0 and algo1
 */
#define ISP_AWB_MODE    0x00000003U
#define ISP_AWB_MODE_M  (ISP_AWB_MODE_V << ISP_AWB_MODE_S)
#define ISP_AWB_MODE_V  0x00000003U
#define ISP_AWB_MODE_S  0
/** ISP_AWB_SAMPLE : R/W; bitpos: [4]; default: 0;
 *  this bit configures awb sample location, 0:before ccm, 1:after ccm
 */
#define ISP_AWB_SAMPLE    (BIT(4))
#define ISP_AWB_SAMPLE_M  (ISP_AWB_SAMPLE_V << ISP_AWB_SAMPLE_S)
#define ISP_AWB_SAMPLE_V  0x00000001U
#define ISP_AWB_SAMPLE_S  4

/** ISP_AWB_HSCALE_REG register
 *  h-scale of awb window
 */
#define ISP_AWB_HSCALE_REG (DR_REG_ISP_BASE + 0x168)
/** ISP_AWB_RPOINT : R/W; bitpos: [11:0]; default: 1919;
 *  this field configures awb window right coordinate
 */
#define ISP_AWB_RPOINT    0x00000FFFU
#define ISP_AWB_RPOINT_M  (ISP_AWB_RPOINT_V << ISP_AWB_RPOINT_S)
#define ISP_AWB_RPOINT_V  0x00000FFFU
#define ISP_AWB_RPOINT_S  0
/** ISP_AWB_LPOINT : R/W; bitpos: [27:16]; default: 0;
 *  this field configures awb window left coordinate
 */
#define ISP_AWB_LPOINT    0x00000FFFU
#define ISP_AWB_LPOINT_M  (ISP_AWB_LPOINT_V << ISP_AWB_LPOINT_S)
#define ISP_AWB_LPOINT_V  0x00000FFFU
#define ISP_AWB_LPOINT_S  16

/** ISP_AWB_VSCALE_REG register
 *  v-scale of awb window
 */
#define ISP_AWB_VSCALE_REG (DR_REG_ISP_BASE + 0x16c)
/** ISP_AWB_BPOINT : R/W; bitpos: [11:0]; default: 1079;
 *  this field configures awb window bottom coordinate
 */
#define ISP_AWB_BPOINT    0x00000FFFU
#define ISP_AWB_BPOINT_M  (ISP_AWB_BPOINT_V << ISP_AWB_BPOINT_S)
#define ISP_AWB_BPOINT_V  0x00000FFFU
#define ISP_AWB_BPOINT_S  0
/** ISP_AWB_TPOINT : R/W; bitpos: [27:16]; default: 0;
 *  this field configures awb window top coordinate
 */
#define ISP_AWB_TPOINT    0x00000FFFU
#define ISP_AWB_TPOINT_M  (ISP_AWB_TPOINT_V << ISP_AWB_TPOINT_S)
#define ISP_AWB_TPOINT_V  0x00000FFFU
#define ISP_AWB_TPOINT_S  16

/** ISP_AWB_TH_LUM_REG register
 *  awb lum threshold register
 */
#define ISP_AWB_TH_LUM_REG (DR_REG_ISP_BASE + 0x170)
/** ISP_AWB_MIN_LUM : R/W; bitpos: [9:0]; default: 0;
 *  this field configures lower threshold of r+g+b
 */
#define ISP_AWB_MIN_LUM    0x000003FFU
#define ISP_AWB_MIN_LUM_M  (ISP_AWB_MIN_LUM_V << ISP_AWB_MIN_LUM_S)
#define ISP_AWB_MIN_LUM_V  0x000003FFU
#define ISP_AWB_MIN_LUM_S  0
/** ISP_AWB_MAX_LUM : R/W; bitpos: [25:16]; default: 765;
 *  this field configures upper threshold of r+g+b
 */
#define ISP_AWB_MAX_LUM    0x000003FFU
#define ISP_AWB_MAX_LUM_M  (ISP_AWB_MAX_LUM_V << ISP_AWB_MAX_LUM_S)
#define ISP_AWB_MAX_LUM_V  0x000003FFU
#define ISP_AWB_MAX_LUM_S  16

/** ISP_AWB_TH_RG_REG register
 *  awb r/g threshold register
 */
#define ISP_AWB_TH_RG_REG (DR_REG_ISP_BASE + 0x174)
/** ISP_AWB_MIN_RG : R/W; bitpos: [9:0]; default: 0;
 *  this field configures lower threshold of r/g, 2bit integer and 8bit fraction
 */
#define ISP_AWB_MIN_RG    0x000003FFU
#define ISP_AWB_MIN_RG_M  (ISP_AWB_MIN_RG_V << ISP_AWB_MIN_RG_S)
#define ISP_AWB_MIN_RG_V  0x000003FFU
#define ISP_AWB_MIN_RG_S  0
/** ISP_AWB_MAX_RG : R/W; bitpos: [25:16]; default: 1023;
 *  this field configures upper threshold of r/g, 2bit integer and 8bit fraction
 */
#define ISP_AWB_MAX_RG    0x000003FFU
#define ISP_AWB_MAX_RG_M  (ISP_AWB_MAX_RG_V << ISP_AWB_MAX_RG_S)
#define ISP_AWB_MAX_RG_V  0x000003FFU
#define ISP_AWB_MAX_RG_S  16

/** ISP_AWB_TH_BG_REG register
 *  awb b/g threshold register
 */
#define ISP_AWB_TH_BG_REG (DR_REG_ISP_BASE + 0x178)
/** ISP_AWB_MIN_BG : R/W; bitpos: [9:0]; default: 0;
 *  this field configures lower threshold of b/g, 2bit integer and 8bit fraction
 */
#define ISP_AWB_MIN_BG    0x000003FFU
#define ISP_AWB_MIN_BG_M  (ISP_AWB_MIN_BG_V << ISP_AWB_MIN_BG_S)
#define ISP_AWB_MIN_BG_V  0x000003FFU
#define ISP_AWB_MIN_BG_S  0
/** ISP_AWB_MAX_BG : R/W; bitpos: [25:16]; default: 1023;
 *  this field configures upper threshold of b/g, 2bit integer and 8bit fraction
 */
#define ISP_AWB_MAX_BG    0x000003FFU
#define ISP_AWB_MAX_BG_M  (ISP_AWB_MAX_BG_V << ISP_AWB_MAX_BG_S)
#define ISP_AWB_MAX_BG_V  0x000003FFU
#define ISP_AWB_MAX_BG_S  16

