espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_AWB0_WHITE_CNT_REG register
 *  result of awb white point number
 */
#define ISP_AWB0_WHITE_CNT_REG (DR_REG_ISP_BASE + 0x17c)
/** ISP_AWB0_WHITE_CNT : RO; bitpos: [23:0]; default: 0;
 *  this field configures number of white point detected of algo0
 */
#define ISP_AWB0_WHITE_CNT    0x00FFFFFFU
#define ISP_AWB0_WHITE_CNT_M  (ISP_AWB0_WHITE_CNT_V << ISP_AWB0_WHITE_CNT_S)
#define ISP_AWB0_WHITE_CNT_V  0x00FFFFFFU
#define ISP_AWB0_WHITE_CNT_S  0

/** ISP_AWB0_ACC_R_REG register
 *  result of accumulate of r channel of all white points
 */
#define ISP_AWB0_ACC_R_REG (DR_REG_ISP_BASE + 0x180)
/** ISP_AWB0_ACC_R : RO; bitpos: [31:0]; default: 0;
 *  this field represents accumulate of channel r of all white point of algo0
 */
#define ISP_AWB0_ACC_R    0xFFFFFFFFU
#define ISP_AWB0_ACC_R_M  (ISP_AWB0_ACC_R_V << ISP_AWB0_ACC_R_S)
#define ISP_AWB0_ACC_R_V  0xFFFFFFFFU
#define ISP_AWB0_ACC_R_S  0

/** ISP_AWB0_ACC_G_REG register
 *  result of accumulate of g channel of all white points
 */
#define ISP_AWB0_ACC_G_REG (DR_REG_ISP_BASE + 0x184)
/** ISP_AWB0_ACC_G : RO; bitpos: [31:0]; default: 0;
 *  this field represents accumulate of channel g of all white point of algo0
 */
#define ISP_AWB0_ACC_G    0xFFFFFFFFU
#define ISP_AWB0_ACC_G_M  (ISP_AWB0_ACC_G_V << ISP_AWB0_ACC_G_S)
#define ISP_AWB0_ACC_G_V  0xFFFFFFFFU
#define ISP_AWB0_ACC_G_S  0

/** ISP_AWB0_ACC_B_REG register
 *  result of accumulate of b channel of all white points
 */
#define ISP_AWB0_ACC_B_REG (DR_REG_ISP_BASE + 0x188)
/** ISP_AWB0_ACC_B : RO; bitpos: [31:0]; default: 0;
 *  this field represents accumulate of channel b of all white point of algo0
 */
#define ISP_AWB0_ACC_B    0xFFFFFFFFU
#define ISP_AWB0_ACC_B_M  (ISP_AWB0_ACC_B_V << ISP_AWB0_ACC_B_S)
#define ISP_AWB0_ACC_B_V  0xFFFFFFFFU
#define ISP_AWB0_ACC_B_S  0

/** ISP_COLOR_CTRL_REG register
 *  color control register
 */
#define ISP_COLOR_CTRL_REG (DR_REG_ISP_BASE + 0x18c)
/** ISP_COLOR_SATURATION : R/W; bitpos: [7:0]; default: 128;
 *  this field configures the color saturation value
 */
#define ISP_COLOR_SATURATION    0x000000FFU
#define ISP_COLOR_SATURATION_M  (ISP_COLOR_SATURATION_V << ISP_COLOR_SATURATION_S)
#define ISP_COLOR_SATURATION_V  0x000000FFU
#define ISP_COLOR_SATURATION_S  0
/** ISP_COLOR_HUE : R/W; bitpos: [15:8]; default: 0;
 *  this field configures the color hue angle
 */
#define ISP_COLOR_HUE    0x000000FFU
#define ISP_COLOR_HUE_M  (ISP_COLOR_HUE_V << ISP_COLOR_HUE_S)
#define ISP_COLOR_HUE_V  0x000000FFU
#define ISP_COLOR_HUE_S  8
/** ISP_COLOR_CONTRAST : R/W; bitpos: [23:16]; default: 128;
 *  this field configures the color contrast value
 */
#define ISP_COLOR_CONTRAST    0x000000FFU
#define ISP_COLOR_CONTRAST_M  (ISP_COLOR_CONTRAST_V << ISP_COLOR_CONTRAST_S)
#define ISP_COLOR_CONTRAST_V  0x000000FFU
#define ISP_COLOR_CONTRAST_S  16
/** ISP_COLOR_BRIGHTNESS : R/W; bitpos: [31:24]; default: 0;
 *  this field configures the color brightness value, signed 2's complement
 */
#define ISP_COLOR_BRIGHTNESS    0x000000FFU
#define ISP_COLOR_BRIGHTNESS_M  (ISP_COLOR_BRIGHTNESS_V << ISP_COLOR_BRIGHTNESS_S)
#define ISP_COLOR_BRIGHTNESS_V  0x000000FFU
#define ISP_COLOR_BRIGHTNESS_S  24

/** ISP_BLC_VALUE_REG register
 *  blc black level register
 */
#define ISP_BLC_VALUE_REG (DR_REG_ISP_BASE + 0x190)
/** ISP_BLC_R3_VALUE : R/W; bitpos: [7:0]; default: 0;
 *  this field configures the black level of bottom right channel of bayer img
 */
#define ISP_BLC_R3_VALUE    0x000000FFU
#define ISP_BLC_R3_VALUE_M  (ISP_BLC_R3_VALUE_V << ISP_BLC_R3_VALUE_S)
#define ISP_BLC_R3_VALUE_V  0x000000FFU
#define ISP_BLC_R3_VALUE_S  0
/** ISP_BLC_R2_VALUE : R/W; bitpos: [15:8]; default: 0;
 *  this field configures the black level of bottom left channel of bayer img
 */
#define ISP_BLC_R2_VALUE    0x000000FFU
#define ISP_BLC_R2_VALUE_M  (ISP_BLC_R2_VALUE_V << ISP_BLC_R2_VALUE_S)
#define ISP_BLC_R2_VALUE_V  0x000000FFU
#define ISP_BLC_R2_VALUE_S  8
/** ISP_BLC_R1_VALUE : R/W; bitpos: [23:16]; default: 0;
 *  this field configures the black level of top right channel of bayer img
 */
#define ISP_BLC_R1_VALUE    0x000000FFU
#define ISP_BLC_R1_VALUE_M  (ISP_BLC_R1_VALUE_V << ISP_BLC_R1_VALUE_S)
#define ISP_BLC_R1_VALUE_V  0x000000FFU
#define ISP_BLC_R1_VALUE_S  16
/** ISP_BLC_R0_VALUE : R/W; bitpos: [31:24]; default: 0;
 *  this field configures the black level of top left channel of bayer img
 */
#define ISP_BLC_R0_VALUE    0x000000FFU
#define ISP_BLC_R0_VALUE_M  (ISP_BLC_R0_VALUE_V << ISP_BLC_R0_VALUE_S)
#define ISP_BLC_R0_VALUE_V  0x000000FFU
#define ISP_BLC_R0_VALUE_S  24

/** ISP_BLC_CTRL0_REG register
 *  blc stretch control register
 */
#define ISP_BLC_CTRL0_REG (DR_REG_ISP_BASE + 0x194)
/** ISP_BLC_R3_STRETCH : R/W; bitpos: [0]; default: 0;
 *  this bit configures the stretch feature of bottom right channel. 0: stretch
 *  disable, 1: stretch enable
 */
#define ISP_BLC_R3_STRETCH    (BIT(0))
#define ISP_BLC_R3_STRETCH_M  (ISP_BLC_R3_STRETCH_V << ISP_BLC_R3_STRETCH_S)
#define ISP_BLC_R3_STRETCH_V  0x00000001U
#define ISP_BLC_R3_STRETCH_S  0
/** ISP_BLC_R2_STRETCH : R/W; bitpos: [1]; default: 0;
 *  this bit configures the stretch feature of bottom left channel. 0: stretch disable,
 *  1: stretch enable
 */
#define ISP_BLC_R2_STRETCH    (BIT(1))
#define ISP_BLC_R2_STRETCH_M  (ISP_BLC_R2_STRETCH_V << ISP_BLC_R2_STRETCH_S)
#define ISP_BLC_R2_STRETCH_V  0x00000001U
#define ISP_BLC_R2_STRETCH_S  1
/** ISP_BLC_R1_STRETCH : R/W; bitpos: [2]; default: 0;
 *  this bit configures the stretch feature of top right channel. 0: stretch disable,
 *  1: stretch enable
 */
#define ISP_BLC_R1_STRETCH    (BIT(2))
#define ISP_BLC_R1_STRETCH_M  (ISP_BLC_R1_STRETCH_V << ISP_BLC_R1_STRETCH_S)
#define ISP_BLC_R1_STRETCH_V  0x00000001U
#define ISP_BLC_R1_STRETCH_S  2
/** ISP_BLC_R0_STRETCH : R/W; bitpos: [3]; default: 0;
 *  this bit configures the stretch feature of top left channel. 0: stretch disable, 1:
 *  stretch enable
 */
#define ISP_BLC_R0_STRETCH    (BIT(3))
#define ISP_BLC_R0_STRETCH_M  (ISP_BLC_R0_STRETCH_V << ISP_BLC_R0_STRETCH_S)
#define ISP_BLC_R0_STRETCH_V  0x00000001U
#define ISP_BLC_R0_STRETCH_S  3

/** ISP_BLC_CTRL1_REG register
 *  blc window control register
 */
#define ISP_BLC_CTRL1_REG (DR_REG_ISP_BASE + 0x198)
/** ISP_BLC_WINDOW_TOP : R/W; bitpos: [10:0]; default: 0;
 *  this field configures blc average calculation window top
 */
#define ISP_BLC_WINDOW_TOP    0x000007FFU
#define ISP_BLC_WINDOW_TOP_M  (ISP_BLC_WINDOW_TOP_V << ISP_BLC_WINDOW_TOP_S)
#define ISP_BLC_WINDOW_TOP_V  0x000007FFU
#define ISP_BLC_WINDOW_TOP_S  0
/** ISP_BLC_WINDOW_LEFT : R/W; bitpos: [21:11]; default: 0;
 *  this field configures blc average calculation window left
 */
#define ISP_BLC_WINDOW_LEFT    0x000007FFU
#define ISP_BLC_WINDOW_LEFT_M  (ISP_BLC_WINDOW_LEFT_V << ISP_BLC_WINDOW_LEFT_S)
#define ISP_BLC_WINDOW_LEFT_V  0x000007FFU
#define ISP_BLC_WINDOW_LEFT_S  11
/** ISP_BLC_WINDOW_VNUM : R/W; bitpos: [25:22]; default: 0;
 *  this field configures blc average calculation window vnum
 */
#define ISP_BLC_WINDOW_VNUM    0x0000000FU
#define ISP_BLC_WINDOW_VNUM_M  (ISP_BLC_WINDOW_VNUM_V << ISP_BLC_WINDOW_VNUM_S)
#define ISP_BLC_WINDOW_VNUM_V  0x0000000FU
#define ISP_BLC_WINDOW_VNUM_S  22
/** ISP_BLC_WINDOW_HNUM : R/W; bitpos: [29:26]; default: 0;
 *  this field configures blc average calculation window hnum
 */
#define ISP_BLC_WINDOW_HNUM    0x0000000FU
#define ISP_BLC_WINDOW_HNUM_M  (ISP_BLC_WINDOW_HNUM_V << ISP_BLC_WINDOW_HNUM_S)
#define ISP_BLC_WINDOW_HNUM_V  0x0000000FU
#define ISP_BLC_WINDOW_HNUM_S  26
/** ISP_BLC_FILTER_EN : R/W; bitpos: [30]; default: 0;
 *  this bit configures enable blc average input filter. 0: disable, 1: enable
 */
#define ISP_BLC_FILTER_EN    (BIT(30))
#define ISP_BLC_FILTER_EN_M  (ISP_BLC_FILTER_EN_V << ISP_BLC_FILTER_EN_S)
#define ISP_BLC_FILTER_EN_V  0x00000001U
#define ISP_BLC_FILTER_EN_S  30

