espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_BLC_CTRL2_REG register
 *  blc black threshold control register
 */
#define ISP_BLC_CTRL2_REG (DR_REG_ISP_BASE + 0x19c)
/** ISP_BLC_R3_TH : R/W; bitpos: [7:0]; default: 0;
 *  this field configures black threshold when get blc average of bottom right channel
 */
#define ISP_BLC_R3_TH    0x000000FFU
#define ISP_BLC_R3_TH_M  (ISP_BLC_R3_TH_V << ISP_BLC_R3_TH_S)
#define ISP_BLC_R3_TH_V  0x000000FFU
#define ISP_BLC_R3_TH_S  0
/** ISP_BLC_R2_TH : R/W; bitpos: [15:8]; default: 0;
 *  this field configures black threshold when get blc average of bottom left channel
 */
#define ISP_BLC_R2_TH    0x000000FFU
#define ISP_BLC_R2_TH_M  (ISP_BLC_R2_TH_V << ISP_BLC_R2_TH_S)
#define ISP_BLC_R2_TH_V  0x000000FFU
#define ISP_BLC_R2_TH_S  8
/** ISP_BLC_R1_TH : R/W; bitpos: [23:16]; default: 0;
 *  this field configures black threshold when get blc average of top right channel
 */
#define ISP_BLC_R1_TH    0x000000FFU
#define ISP_BLC_R1_TH_M  (ISP_BLC_R1_TH_V << ISP_BLC_R1_TH_S)
#define ISP_BLC_R1_TH_V  0x000000FFU
#define ISP_BLC_R1_TH_S  16
/** ISP_BLC_R0_TH : R/W; bitpos: [31:24]; default: 0;
 *  this field configures black threshold when get blc average of top left channel
 */
#define ISP_BLC_R0_TH    0x000000FFU
#define ISP_BLC_R0_TH_M  (ISP_BLC_R0_TH_V << ISP_BLC_R0_TH_S)
#define ISP_BLC_R0_TH_V  0x000000FFU
#define ISP_BLC_R0_TH_S  24

/** ISP_BLC_MEAN_REG register
 *  results of the average of black window
 */
#define ISP_BLC_MEAN_REG (DR_REG_ISP_BASE + 0x1a0)
/** ISP_BLC_R3_MEAN : RO; bitpos: [7:0]; default: 0;
 *  this field represents the average black value of bottom right channel
 */
#define ISP_BLC_R3_MEAN    0x000000FFU
#define ISP_BLC_R3_MEAN_M  (ISP_BLC_R3_MEAN_V << ISP_BLC_R3_MEAN_S)
#define ISP_BLC_R3_MEAN_V  0x000000FFU
#define ISP_BLC_R3_MEAN_S  0
/** ISP_BLC_R2_MEAN : RO; bitpos: [15:8]; default: 0;
 *  this field represents the average black value of bottom left channel
 */
#define ISP_BLC_R2_MEAN    0x000000FFU
#define ISP_BLC_R2_MEAN_M  (ISP_BLC_R2_MEAN_V << ISP_BLC_R2_MEAN_S)
#define ISP_BLC_R2_MEAN_V  0x000000FFU
#define ISP_BLC_R2_MEAN_S  8
/** ISP_BLC_R1_MEAN : RO; bitpos: [23:16]; default: 0;
 *  this field represents the average black value of top right channel
 */
#define ISP_BLC_R1_MEAN    0x000000FFU
#define ISP_BLC_R1_MEAN_M  (ISP_BLC_R1_MEAN_V << ISP_BLC_R1_MEAN_S)
#define ISP_BLC_R1_MEAN_V  0x000000FFU
#define ISP_BLC_R1_MEAN_S  16
/** ISP_BLC_R0_MEAN : RO; bitpos: [31:24]; default: 0;
 *  this field represents the average black value of top left channel
 */
#define ISP_BLC_R0_MEAN    0x000000FFU
#define ISP_BLC_R0_MEAN_M  (ISP_BLC_R0_MEAN_V << ISP_BLC_R0_MEAN_S)
#define ISP_BLC_R0_MEAN_V  0x000000FFU
#define ISP_BLC_R0_MEAN_S  24

/** ISP_HIST_MODE_REG register
 *  histogram mode control register
 */
#define ISP_HIST_MODE_REG (DR_REG_ISP_BASE + 0x1a4)
/** ISP_HIST_MODE : R/W; bitpos: [2:0]; default: 4;
 *  this field configures statistic mode. 0: RAW_B, 1: RAW_GB, 2: RAW_GR 3: RAW_R, 4:
 *  RGB, 5:YUV_Y, 6:YUV_U, 7:YUV_V
 */
#define ISP_HIST_MODE    0x00000007U
#define ISP_HIST_MODE_M  (ISP_HIST_MODE_V << ISP_HIST_MODE_S)
#define ISP_HIST_MODE_V  0x00000007U
#define ISP_HIST_MODE_S  0

/** ISP_HIST_COEFF_REG register
 *  histogram rgb to gray coefficients register
 */
#define ISP_HIST_COEFF_REG (DR_REG_ISP_BASE + 0x1a8)
/** ISP_HIST_COEFF_B : R/W; bitpos: [7:0]; default: 85;
 *  this field configures coefficient of B when set hist_mode to RGB, sum of coeff_r
 *  and coeff_g and coeff_b should be 256
 */
#define ISP_HIST_COEFF_B    0x000000FFU
#define ISP_HIST_COEFF_B_M  (ISP_HIST_COEFF_B_V << ISP_HIST_COEFF_B_S)
#define ISP_HIST_COEFF_B_V  0x000000FFU
#define ISP_HIST_COEFF_B_S  0
/** ISP_HIST_COEFF_G : R/W; bitpos: [15:8]; default: 85;
 *  this field configures coefficient of G when set hist_mode to RGB, sum of coeff_r
 *  and coeff_g and coeff_b should be 256
 */
#define ISP_HIST_COEFF_G    0x000000FFU
#define ISP_HIST_COEFF_G_M  (ISP_HIST_COEFF_G_V << ISP_HIST_COEFF_G_S)
#define ISP_HIST_COEFF_G_V  0x000000FFU
#define ISP_HIST_COEFF_G_S  8
/** ISP_HIST_COEFF_R : R/W; bitpos: [23:16]; default: 85;
 *  this field configures coefficient of R when set hist_mode to RGB, sum of coeff_r
 *  and coeff_g and coeff_b should be 256
 */
#define ISP_HIST_COEFF_R    0x000000FFU
#define ISP_HIST_COEFF_R_M  (ISP_HIST_COEFF_R_V << ISP_HIST_COEFF_R_S)
#define ISP_HIST_COEFF_R_V  0x000000FFU
#define ISP_HIST_COEFF_R_S  16

/** ISP_HIST_OFFS_REG register
 *  histogram window offsets register
 */
#define ISP_HIST_OFFS_REG (DR_REG_ISP_BASE + 0x1ac)
/** ISP_HIST_Y_OFFS : R/W; bitpos: [11:0]; default: 0;
 *  this field configures y coordinate of first window
 */
#define ISP_HIST_Y_OFFS    0x00000FFFU
#define ISP_HIST_Y_OFFS_M  (ISP_HIST_Y_OFFS_V << ISP_HIST_Y_OFFS_S)
#define ISP_HIST_Y_OFFS_V  0x00000FFFU
#define ISP_HIST_Y_OFFS_S  0
/** ISP_HIST_X_OFFS : R/W; bitpos: [27:16]; default: 0;
 *  this field configures x coordinate of first window
 */
#define ISP_HIST_X_OFFS    0x00000FFFU
#define ISP_HIST_X_OFFS_M  (ISP_HIST_X_OFFS_V << ISP_HIST_X_OFFS_S)
#define ISP_HIST_X_OFFS_V  0x00000FFFU
#define ISP_HIST_X_OFFS_S  16

/** ISP_HIST_SIZE_REG register
 *  histogram sub-window size register
 */
#define ISP_HIST_SIZE_REG (DR_REG_ISP_BASE + 0x1b0)
/** ISP_HIST_Y_SIZE : R/W; bitpos: [8:0]; default: 32;
 *  this field configures y direction size of subwindow
 */
#define ISP_HIST_Y_SIZE    0x000001FFU
#define ISP_HIST_Y_SIZE_M  (ISP_HIST_Y_SIZE_V << ISP_HIST_Y_SIZE_S)
#define ISP_HIST_Y_SIZE_V  0x000001FFU
#define ISP_HIST_Y_SIZE_S  0
/** ISP_HIST_X_SIZE : R/W; bitpos: [24:16]; default: 18;
 *  this field configures x direction size of subwindow
 */
#define ISP_HIST_X_SIZE    0x000001FFU
#define ISP_HIST_X_SIZE_M  (ISP_HIST_X_SIZE_V << ISP_HIST_X_SIZE_S)
#define ISP_HIST_X_SIZE_V  0x000001FFU
#define ISP_HIST_X_SIZE_S  16

/** ISP_HIST_SEG0_REG register
 *  histogram bin control register 0
 */
#define ISP_HIST_SEG0_REG (DR_REG_ISP_BASE + 0x1b4)
/** ISP_HIST_SEG_3_4 : R/W; bitpos: [7:0]; default: 64;
 *  this field configures threshold of histogram bin 3 and bin 4
 */
#define ISP_HIST_SEG_3_4    0x000000FFU
#define ISP_HIST_SEG_3_4_M  (ISP_HIST_SEG_3_4_V << ISP_HIST_SEG_3_4_S)
#define ISP_HIST_SEG_3_4_V  0x000000FFU
#define ISP_HIST_SEG_3_4_S  0
/** ISP_HIST_SEG_2_3 : R/W; bitpos: [15:8]; default: 48;
 *  this field configures threshold of histogram bin 2 and bin 3
 */
#define ISP_HIST_SEG_2_3    0x000000FFU
#define ISP_HIST_SEG_2_3_M  (ISP_HIST_SEG_2_3_V << ISP_HIST_SEG_2_3_S)
#define ISP_HIST_SEG_2_3_V  0x000000FFU
#define ISP_HIST_SEG_2_3_S  8
/** ISP_HIST_SEG_1_2 : R/W; bitpos: [23:16]; default: 32;
 *  this field configures threshold of histogram bin 1 and bin 2
 */
#define ISP_HIST_SEG_1_2    0x000000FFU
#define ISP_HIST_SEG_1_2_M  (ISP_HIST_SEG_1_2_V << ISP_HIST_SEG_1_2_S)
#define ISP_HIST_SEG_1_2_V  0x000000FFU
#define ISP_HIST_SEG_1_2_S  16
/** ISP_HIST_SEG_0_1 : R/W; bitpos: [31:24]; default: 16;
 *  this field configures threshold of histogram bin 0 and bin 1
 */
#define ISP_HIST_SEG_0_1    0x000000FFU
#define ISP_HIST_SEG_0_1_M  (ISP_HIST_SEG_0_1_V << ISP_HIST_SEG_0_1_S)
#define ISP_HIST_SEG_0_1_V  0x000000FFU
#define ISP_HIST_SEG_0_1_S  24

/** ISP_HIST_SEG1_REG register
 *  histogram bin control register 1
 */
#define ISP_HIST_SEG1_REG (DR_REG_ISP_BASE + 0x1b8)
/** ISP_HIST_SEG_7_8 : R/W; bitpos: [7:0]; default: 128;
 *  this field configures threshold of histogram bin 7 and bin 8
 */
#define ISP_HIST_SEG_7_8    0x000000FFU
#define ISP_HIST_SEG_7_8_M  (ISP_HIST_SEG_7_8_V << ISP_HIST_SEG_7_8_S)
#define ISP_HIST_SEG_7_8_V  0x000000FFU
#define ISP_HIST_SEG_7_8_S  0
/** ISP_HIST_SEG_6_7 : R/W; bitpos: [15:8]; default: 112;
 *  this field configures threshold of histogram bin 6 and bin 7
 */
#define ISP_HIST_SEG_6_7    0x000000FFU
#define ISP_HIST_SEG_6_7_M  (ISP_HIST_SEG_6_7_V << ISP_HIST_SEG_6_7_S)
#define ISP_HIST_SEG_6_7_V  0x000000FFU
#define ISP_HIST_SEG_6_7_S  8
/** ISP_HIST_SEG_5_6 : R/W; bitpos: [23:16]; default: 96;
 *  this field configures threshold of histogram bin 5 and bin 6
 */
#define ISP_HIST_SEG_5_6    0x000000FFU
#define ISP_HIST_SEG_5_6_M  (ISP_HIST_SEG_5_6_V << ISP_HIST_SEG_5_6_S)
#define ISP_HIST_SEG_5_6_V  0x000000FFU
#define ISP_HIST_SEG_5_6_S  16
/** ISP_HIST_SEG_4_5 : R/W; bitpos: [31:24]; default: 80;
 *  this field configures threshold of histogram bin 4 and bin 5
 */
#define ISP_HIST_SEG_4_5    0x000000FFU
#define ISP_HIST_SEG_4_5_M  (ISP_HIST_SEG_4_5_V << ISP_HIST_SEG_4_5_S)
#define ISP_HIST_SEG_4_5_V  0x000000FFU
#define ISP_HIST_SEG_4_5_S  24

