espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_HIST_SEG2_REG register
 *  histogram bin control register 2
 */
#define ISP_HIST_SEG2_REG (DR_REG_ISP_BASE + 0x1bc)
/** ISP_HIST_SEG_11_12 : R/W; bitpos: [7:0]; default: 192;
 *  this field configures threshold of histogram bin 11 and bin 12
 */
#define ISP_HIST_SEG_11_12    0x000000FFU
#define ISP_HIST_SEG_11_12_M  (ISP_HIST_SEG_11_12_V << ISP_HIST_SEG_11_12_S)
#define ISP_HIST_SEG_11_12_V  0x000000FFU
#define ISP_HIST_SEG_11_12_S  0
/** ISP_HIST_SEG_10_11 : R/W; bitpos: [15:8]; default: 176;
 *  this field configures threshold of histogram bin 10 and bin 11
 */
#define ISP_HIST_SEG_10_11    0x000000FFU
#define ISP_HIST_SEG_10_11_M  (ISP_HIST_SEG_10_11_V << ISP_HIST_SEG_10_11_S)
#define ISP_HIST_SEG_10_11_V  0x000000FFU
#define ISP_HIST_SEG_10_11_S  8
/** ISP_HIST_SEG_9_10 : R/W; bitpos: [23:16]; default: 160;
 *  this field configures threshold of histogram bin 9 and bin 10
 */
#define ISP_HIST_SEG_9_10    0x000000FFU
#define ISP_HIST_SEG_9_10_M  (ISP_HIST_SEG_9_10_V << ISP_HIST_SEG_9_10_S)
#define ISP_HIST_SEG_9_10_V  0x000000FFU
#define ISP_HIST_SEG_9_10_S  16
/** ISP_HIST_SEG_8_9 : R/W; bitpos: [31:24]; default: 144;
 *  this field configures threshold of histogram bin 8 and bin 9
 */
#define ISP_HIST_SEG_8_9    0x000000FFU
#define ISP_HIST_SEG_8_9_M  (ISP_HIST_SEG_8_9_V << ISP_HIST_SEG_8_9_S)
#define ISP_HIST_SEG_8_9_V  0x000000FFU
#define ISP_HIST_SEG_8_9_S  24

/** ISP_HIST_SEG3_REG register
 *  histogram bin control register 3
 */
#define ISP_HIST_SEG3_REG (DR_REG_ISP_BASE + 0x1c0)
/** ISP_HIST_SEG_14_15 : R/W; bitpos: [7:0]; default: 240;
 *  this field configures threshold of histogram bin 14 and bin 15
 */
#define ISP_HIST_SEG_14_15    0x000000FFU
#define ISP_HIST_SEG_14_15_M  (ISP_HIST_SEG_14_15_V << ISP_HIST_SEG_14_15_S)
#define ISP_HIST_SEG_14_15_V  0x000000FFU
#define ISP_HIST_SEG_14_15_S  0
/** ISP_HIST_SEG_13_14 : R/W; bitpos: [15:8]; default: 224;
 *  this field configures threshold of histogram bin 13 and bin 14
 */
#define ISP_HIST_SEG_13_14    0x000000FFU
#define ISP_HIST_SEG_13_14_M  (ISP_HIST_SEG_13_14_V << ISP_HIST_SEG_13_14_S)
#define ISP_HIST_SEG_13_14_V  0x000000FFU
#define ISP_HIST_SEG_13_14_S  8
/** ISP_HIST_SEG_12_13 : R/W; bitpos: [23:16]; default: 208;
 *  this field configures threshold of histogram bin 12 and bin 13
 */
#define ISP_HIST_SEG_12_13    0x000000FFU
#define ISP_HIST_SEG_12_13_M  (ISP_HIST_SEG_12_13_V << ISP_HIST_SEG_12_13_S)
#define ISP_HIST_SEG_12_13_V  0x000000FFU
#define ISP_HIST_SEG_12_13_S  16

/** ISP_HIST_WEIGHT0_REG register
 *  histogram sub-window weight register 0
 */
#define ISP_HIST_WEIGHT0_REG (DR_REG_ISP_BASE + 0x1c4)
/** ISP_HIST_WEIGHT_03 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 03
 */
#define ISP_HIST_WEIGHT_03    0x000000FFU
#define ISP_HIST_WEIGHT_03_M  (ISP_HIST_WEIGHT_03_V << ISP_HIST_WEIGHT_03_S)
#define ISP_HIST_WEIGHT_03_V  0x000000FFU
#define ISP_HIST_WEIGHT_03_S  0
/** ISP_HIST_WEIGHT_02 : R/W; bitpos: [15:8]; default: 1;
 *  this field configures weight of subwindow 02
 */
#define ISP_HIST_WEIGHT_02    0x000000FFU
#define ISP_HIST_WEIGHT_02_M  (ISP_HIST_WEIGHT_02_V << ISP_HIST_WEIGHT_02_S)
#define ISP_HIST_WEIGHT_02_V  0x000000FFU
#define ISP_HIST_WEIGHT_02_S  8
/** ISP_HIST_WEIGHT_01 : R/W; bitpos: [23:16]; default: 1;
 *  this field configures weight of subwindow 01
 */
#define ISP_HIST_WEIGHT_01    0x000000FFU
#define ISP_HIST_WEIGHT_01_M  (ISP_HIST_WEIGHT_01_V << ISP_HIST_WEIGHT_01_S)
#define ISP_HIST_WEIGHT_01_V  0x000000FFU
#define ISP_HIST_WEIGHT_01_S  16
/** ISP_HIST_WEIGHT_00 : R/W; bitpos: [31:24]; default: 1;
 *  this field configures weight of subwindow 00 and sum of all weight should be 256
 */
#define ISP_HIST_WEIGHT_00    0x000000FFU
#define ISP_HIST_WEIGHT_00_M  (ISP_HIST_WEIGHT_00_V << ISP_HIST_WEIGHT_00_S)
#define ISP_HIST_WEIGHT_00_V  0x000000FFU
#define ISP_HIST_WEIGHT_00_S  24

/** ISP_HIST_WEIGHT1_REG register
 *  histogram sub-window weight register 1
 */
#define ISP_HIST_WEIGHT1_REG (DR_REG_ISP_BASE + 0x1c8)
/** ISP_HIST_WEIGHT_12 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 12
 */
#define ISP_HIST_WEIGHT_12    0x000000FFU
#define ISP_HIST_WEIGHT_12_M  (ISP_HIST_WEIGHT_12_V << ISP_HIST_WEIGHT_12_S)
#define ISP_HIST_WEIGHT_12_V  0x000000FFU
#define ISP_HIST_WEIGHT_12_S  0
/** ISP_HIST_WEIGHT_11 : R/W; bitpos: [15:8]; default: 1;
 *  this field configures weight of subwindow 11
 */
#define ISP_HIST_WEIGHT_11    0x000000FFU
#define ISP_HIST_WEIGHT_11_M  (ISP_HIST_WEIGHT_11_V << ISP_HIST_WEIGHT_11_S)
#define ISP_HIST_WEIGHT_11_V  0x000000FFU
#define ISP_HIST_WEIGHT_11_S  8
/** ISP_HIST_WEIGHT_10 : R/W; bitpos: [23:16]; default: 1;
 *  this field configures weight of subwindow 10
 */
#define ISP_HIST_WEIGHT_10    0x000000FFU
#define ISP_HIST_WEIGHT_10_M  (ISP_HIST_WEIGHT_10_V << ISP_HIST_WEIGHT_10_S)
#define ISP_HIST_WEIGHT_10_V  0x000000FFU
#define ISP_HIST_WEIGHT_10_S  16
/** ISP_HIST_WEIGHT_04 : R/W; bitpos: [31:24]; default: 1;
 *  this field configures weight of subwindow 04
 */
#define ISP_HIST_WEIGHT_04    0x000000FFU
#define ISP_HIST_WEIGHT_04_M  (ISP_HIST_WEIGHT_04_V << ISP_HIST_WEIGHT_04_S)
#define ISP_HIST_WEIGHT_04_V  0x000000FFU
#define ISP_HIST_WEIGHT_04_S  24

/** ISP_HIST_WEIGHT2_REG register
 *  histogram sub-window weight register 2
 */
#define ISP_HIST_WEIGHT2_REG (DR_REG_ISP_BASE + 0x1cc)
/** ISP_HIST_WEIGHT_21 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 21
 */
#define ISP_HIST_WEIGHT_21    0x000000FFU
#define ISP_HIST_WEIGHT_21_M  (ISP_HIST_WEIGHT_21_V << ISP_HIST_WEIGHT_21_S)
#define ISP_HIST_WEIGHT_21_V  0x000000FFU
#define ISP_HIST_WEIGHT_21_S  0
/** ISP_HIST_WEIGHT_20 : R/W; bitpos: [15:8]; default: 1;
 *  this field configures weight of subwindow 20
 */
#define ISP_HIST_WEIGHT_20    0x000000FFU
#define ISP_HIST_WEIGHT_20_M  (ISP_HIST_WEIGHT_20_V << ISP_HIST_WEIGHT_20_S)
#define ISP_HIST_WEIGHT_20_V  0x000000FFU
#define ISP_HIST_WEIGHT_20_S  8
/** ISP_HIST_WEIGHT_14 : R/W; bitpos: [23:16]; default: 1;
 *  this field configures weight of subwindow 04
 */
#define ISP_HIST_WEIGHT_14    0x000000FFU
#define ISP_HIST_WEIGHT_14_M  (ISP_HIST_WEIGHT_14_V << ISP_HIST_WEIGHT_14_S)
#define ISP_HIST_WEIGHT_14_V  0x000000FFU
#define ISP_HIST_WEIGHT_14_S  16
/** ISP_HIST_WEIGHT_13 : R/W; bitpos: [31:24]; default: 1;
 *  this field configures weight of subwindow 13
 */
#define ISP_HIST_WEIGHT_13    0x000000FFU
#define ISP_HIST_WEIGHT_13_M  (ISP_HIST_WEIGHT_13_V << ISP_HIST_WEIGHT_13_S)
#define ISP_HIST_WEIGHT_13_V  0x000000FFU
#define ISP_HIST_WEIGHT_13_S  24

/** ISP_HIST_WEIGHT3_REG register
 *  histogram sub-window weight register 3
 */
#define ISP_HIST_WEIGHT3_REG (DR_REG_ISP_BASE + 0x1d0)
/** ISP_HIST_WEIGHT_30 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 30
 */
#define ISP_HIST_WEIGHT_30    0x000000FFU
#define ISP_HIST_WEIGHT_30_M  (ISP_HIST_WEIGHT_30_V << ISP_HIST_WEIGHT_30_S)
#define ISP_HIST_WEIGHT_30_V  0x000000FFU
#define ISP_HIST_WEIGHT_30_S  0
/** ISP_HIST_WEIGHT_24 : R/W; bitpos: [15:8]; default: 1;
 *  this field configures weight of subwindow 24
 */
#define ISP_HIST_WEIGHT_24    0x000000FFU
#define ISP_HIST_WEIGHT_24_M  (ISP_HIST_WEIGHT_24_V << ISP_HIST_WEIGHT_24_S)
#define ISP_HIST_WEIGHT_24_V  0x000000FFU
#define ISP_HIST_WEIGHT_24_S  8
/** ISP_HIST_WEIGHT_23 : R/W; bitpos: [23:16]; default: 1;
 *  this field configures weight of subwindow 23
 */
#define ISP_HIST_WEIGHT_23    0x000000FFU
#define ISP_HIST_WEIGHT_23_M  (ISP_HIST_WEIGHT_23_V << ISP_HIST_WEIGHT_23_S)
#define ISP_HIST_WEIGHT_23_V  0x000000FFU
#define ISP_HIST_WEIGHT_23_S  16
/** ISP_HIST_WEIGHT_22 : R/W; bitpos: [31:24]; default: 232;
 *  this field configures weight of subwindow 22
 */
#define ISP_HIST_WEIGHT_22    0x000000FFU
#define ISP_HIST_WEIGHT_22_M  (ISP_HIST_WEIGHT_22_V << ISP_HIST_WEIGHT_22_S)
#define ISP_HIST_WEIGHT_22_V  0x000000FFU
#define ISP_HIST_WEIGHT_22_S  24

/** ISP_HIST_WEIGHT4_REG register
 *  histogram sub-window weight register 4
 */
#define ISP_HIST_WEIGHT4_REG (DR_REG_ISP_BASE + 0x1d4)
/** ISP_HIST_WEIGHT_34 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 34
 */
#define ISP_HIST_WEIGHT_34    0x000000FFU
#define ISP_HIST_WEIGHT_34_M  (ISP_HIST_WEIGHT_34_V << ISP_HIST_WEIGHT_34_S)
#define ISP_HIST_WEIGHT_34_V  0x000000FFU
#define ISP_HIST_WEIGHT_34_S  0
/** ISP_HIST_WEIGHT_33 : R/W; bitpos: [15:8]; default: 1;
 *  this field configures weight of subwindow 33
 */
#define ISP_HIST_WEIGHT_33    0x000000FFU
#define ISP_HIST_WEIGHT_33_M  (ISP_HIST_WEIGHT_33_V << ISP_HIST_WEIGHT_33_S)
#define ISP_HIST_WEIGHT_33_V  0x000000FFU
#define ISP_HIST_WEIGHT_33_S  8
/** ISP_HIST_WEIGHT_32 : R/W; bitpos: [23:16]; default: 1;
 *  this field configures weight of subwindow 32
 */
#define ISP_HIST_WEIGHT_32    0x000000FFU
#define ISP_HIST_WEIGHT_32_M  (ISP_HIST_WEIGHT_32_V << ISP_HIST_WEIGHT_32_S)
#define ISP_HIST_WEIGHT_32_V  0x000000FFU
#define ISP_HIST_WEIGHT_32_S  16
/** ISP_HIST_WEIGHT_31 : R/W; bitpos: [31:24]; default: 1;
 *  this field configures weight of subwindow 31
 */
#define ISP_HIST_WEIGHT_31    0x000000FFU
#define ISP_HIST_WEIGHT_31_M  (ISP_HIST_WEIGHT_31_V << ISP_HIST_WEIGHT_31_S)
#define ISP_HIST_WEIGHT_31_V  0x000000FFU
#define ISP_HIST_WEIGHT_31_S  24

/** ISP_HIST_WEIGHT5_REG register
 *  histogram sub-window weight register 5
 */
#define ISP_HIST_WEIGHT5_REG (DR_REG_ISP_BASE + 0x1d8)
/** ISP_HIST_WEIGHT_43 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 43
 */
#define ISP_HIST_WEIGHT_43    0x000000FFU
#define ISP_HIST_WEIGHT_43_M  (ISP_HIST_WEIGHT_43_V << ISP_HIST_WEIGHT_43_S)
#define ISP_HIST_WEIGHT_43_V  0x000000FFU
#define ISP_HIST_WEIGHT_43_S  0
/** ISP_HIST_WEIGHT_42 : R/W; bitpos: [15:8]; default: 1;
 *  this field configures weight of subwindow 42
 */
#define ISP_HIST_WEIGHT_42    0x000000FFU
#define ISP_HIST_WEIGHT_42_M  (ISP_HIST_WEIGHT_42_V << ISP_HIST_WEIGHT_42_S)
#define ISP_HIST_WEIGHT_42_V  0x000000FFU
#define ISP_HIST_WEIGHT_42_S  8
/** ISP_HIST_WEIGHT_41 : R/W; bitpos: [23:16]; default: 1;
 *  this field configures weight of subwindow 41
 */
#define ISP_HIST_WEIGHT_41    0x000000FFU
#define ISP_HIST_WEIGHT_41_M  (ISP_HIST_WEIGHT_41_V << ISP_HIST_WEIGHT_41_S)
#define ISP_HIST_WEIGHT_41_V  0x000000FFU
#define ISP_HIST_WEIGHT_41_S  16
/** ISP_HIST_WEIGHT_40 : R/W; bitpos: [31:24]; default: 1;
 *  this field configures weight of subwindow 40
 */
#define ISP_HIST_WEIGHT_40    0x000000FFU
#define ISP_HIST_WEIGHT_40_M  (ISP_HIST_WEIGHT_40_V << ISP_HIST_WEIGHT_40_S)
#define ISP_HIST_WEIGHT_40_V  0x000000FFU
#define ISP_HIST_WEIGHT_40_S  24

/** ISP_HIST_WEIGHT6_REG register
 *  histogram sub-window weight register 6
 */
#define ISP_HIST_WEIGHT6_REG (DR_REG_ISP_BASE + 0x1dc)
/** ISP_HIST_WEIGHT_44 : R/W; bitpos: [7:0]; default: 1;
 *  this field configures weight of subwindow 44
 */
#define ISP_HIST_WEIGHT_44    0x000000FFU
#define ISP_HIST_WEIGHT_44_M  (ISP_HIST_WEIGHT_44_V << ISP_HIST_WEIGHT_44_S)
#define ISP_HIST_WEIGHT_44_V  0x000000FFU
#define ISP_HIST_WEIGHT_44_S  0

