espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_HIST_BIN0_REG register
 *  result of histogram bin 0
 */
#define ISP_HIST_BIN0_REG (DR_REG_ISP_BASE + 0x1e0)
/** ISP_HIST_BIN_0 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 0
 */
#define ISP_HIST_BIN_0    0x0001FFFFU
#define ISP_HIST_BIN_0_M  (ISP_HIST_BIN_0_V << ISP_HIST_BIN_0_S)
#define ISP_HIST_BIN_0_V  0x0001FFFFU
#define ISP_HIST_BIN_0_S  0

/** ISP_HIST_BIN1_REG register
 *  result of histogram bin 1
 */
#define ISP_HIST_BIN1_REG (DR_REG_ISP_BASE + 0x1e4)
/** ISP_HIST_BIN_1 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 1
 */
#define ISP_HIST_BIN_1    0x0001FFFFU
#define ISP_HIST_BIN_1_M  (ISP_HIST_BIN_1_V << ISP_HIST_BIN_1_S)
#define ISP_HIST_BIN_1_V  0x0001FFFFU
#define ISP_HIST_BIN_1_S  0

/** ISP_HIST_BIN2_REG register
 *  result of histogram bin 2
 */
#define ISP_HIST_BIN2_REG (DR_REG_ISP_BASE + 0x1e8)
/** ISP_HIST_BIN_2 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 2
 */
#define ISP_HIST_BIN_2    0x0001FFFFU
#define ISP_HIST_BIN_2_M  (ISP_HIST_BIN_2_V << ISP_HIST_BIN_2_S)
#define ISP_HIST_BIN_2_V  0x0001FFFFU
#define ISP_HIST_BIN_2_S  0

/** ISP_HIST_BIN3_REG register
 *  result of histogram bin 3
 */
#define ISP_HIST_BIN3_REG (DR_REG_ISP_BASE + 0x1ec)
/** ISP_HIST_BIN_3 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 3
 */
#define ISP_HIST_BIN_3    0x0001FFFFU
#define ISP_HIST_BIN_3_M  (ISP_HIST_BIN_3_V << ISP_HIST_BIN_3_S)
#define ISP_HIST_BIN_3_V  0x0001FFFFU
#define ISP_HIST_BIN_3_S  0

/** ISP_HIST_BIN4_REG register
 *  result of histogram bin 4
 */
#define ISP_HIST_BIN4_REG (DR_REG_ISP_BASE + 0x1f0)
/** ISP_HIST_BIN_4 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 4
 */
#define ISP_HIST_BIN_4    0x0001FFFFU
#define ISP_HIST_BIN_4_M  (ISP_HIST_BIN_4_V << ISP_HIST_BIN_4_S)
#define ISP_HIST_BIN_4_V  0x0001FFFFU
#define ISP_HIST_BIN_4_S  0

/** ISP_HIST_BIN5_REG register
 *  result of histogram bin 5
 */
#define ISP_HIST_BIN5_REG (DR_REG_ISP_BASE + 0x1f4)
/** ISP_HIST_BIN_5 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 5
 */
#define ISP_HIST_BIN_5    0x0001FFFFU
#define ISP_HIST_BIN_5_M  (ISP_HIST_BIN_5_V << ISP_HIST_BIN_5_S)
#define ISP_HIST_BIN_5_V  0x0001FFFFU
#define ISP_HIST_BIN_5_S  0

/** ISP_HIST_BIN6_REG register
 *  result of histogram bin 6
 */
#define ISP_HIST_BIN6_REG (DR_REG_ISP_BASE + 0x1f8)
/** ISP_HIST_BIN_6 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 6
 */
#define ISP_HIST_BIN_6    0x0001FFFFU
#define ISP_HIST_BIN_6_M  (ISP_HIST_BIN_6_V << ISP_HIST_BIN_6_S)
#define ISP_HIST_BIN_6_V  0x0001FFFFU
#define ISP_HIST_BIN_6_S  0

/** ISP_HIST_BIN7_REG register
 *  result of histogram bin 7
 */
#define ISP_HIST_BIN7_REG (DR_REG_ISP_BASE + 0x1fc)
/** ISP_HIST_BIN_7 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 7
 */
#define ISP_HIST_BIN_7    0x0001FFFFU
#define ISP_HIST_BIN_7_M  (ISP_HIST_BIN_7_V << ISP_HIST_BIN_7_S)
#define ISP_HIST_BIN_7_V  0x0001FFFFU
#define ISP_HIST_BIN_7_S  0

/** ISP_HIST_BIN8_REG register
 *  result of histogram bin 8
 */
#define ISP_HIST_BIN8_REG (DR_REG_ISP_BASE + 0x200)
/** ISP_HIST_BIN_8 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 8
 */
#define ISP_HIST_BIN_8    0x0001FFFFU
#define ISP_HIST_BIN_8_M  (ISP_HIST_BIN_8_V << ISP_HIST_BIN_8_S)
#define ISP_HIST_BIN_8_V  0x0001FFFFU
#define ISP_HIST_BIN_8_S  0

/** ISP_HIST_BIN9_REG register
 *  result of histogram bin 9
 */
#define ISP_HIST_BIN9_REG (DR_REG_ISP_BASE + 0x204)
/** ISP_HIST_BIN_9 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 9
 */
#define ISP_HIST_BIN_9    0x0001FFFFU
#define ISP_HIST_BIN_9_M  (ISP_HIST_BIN_9_V << ISP_HIST_BIN_9_S)
#define ISP_HIST_BIN_9_V  0x0001FFFFU
#define ISP_HIST_BIN_9_S  0

/** ISP_HIST_BIN10_REG register
 *  result of histogram bin 10
 */
#define ISP_HIST_BIN10_REG (DR_REG_ISP_BASE + 0x208)
/** ISP_HIST_BIN_10 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 10
 */
#define ISP_HIST_BIN_10    0x0001FFFFU
#define ISP_HIST_BIN_10_M  (ISP_HIST_BIN_10_V << ISP_HIST_BIN_10_S)
#define ISP_HIST_BIN_10_V  0x0001FFFFU
#define ISP_HIST_BIN_10_S  0

/** ISP_HIST_BIN11_REG register
 *  result of histogram bin 11
 */
#define ISP_HIST_BIN11_REG (DR_REG_ISP_BASE + 0x20c)
/** ISP_HIST_BIN_11 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 11
 */
#define ISP_HIST_BIN_11    0x0001FFFFU
#define ISP_HIST_BIN_11_M  (ISP_HIST_BIN_11_V << ISP_HIST_BIN_11_S)
#define ISP_HIST_BIN_11_V  0x0001FFFFU
#define ISP_HIST_BIN_11_S  0

/** ISP_HIST_BIN12_REG register
 *  result of histogram bin 12
 */
#define ISP_HIST_BIN12_REG (DR_REG_ISP_BASE + 0x210)
/** ISP_HIST_BIN_12 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 12
 */
#define ISP_HIST_BIN_12    0x0001FFFFU
#define ISP_HIST_BIN_12_M  (ISP_HIST_BIN_12_V << ISP_HIST_BIN_12_S)
#define ISP_HIST_BIN_12_V  0x0001FFFFU
#define ISP_HIST_BIN_12_S  0

/** ISP_HIST_BIN13_REG register
 *  result of histogram bin 13
 */
#define ISP_HIST_BIN13_REG (DR_REG_ISP_BASE + 0x214)
/** ISP_HIST_BIN_13 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 13
 */
#define ISP_HIST_BIN_13    0x0001FFFFU
#define ISP_HIST_BIN_13_M  (ISP_HIST_BIN_13_V << ISP_HIST_BIN_13_S)
#define ISP_HIST_BIN_13_V  0x0001FFFFU
#define ISP_HIST_BIN_13_S  0

/** ISP_HIST_BIN14_REG register
 *  result of histogram bin 14
 */
#define ISP_HIST_BIN14_REG (DR_REG_ISP_BASE + 0x218)
/** ISP_HIST_BIN_14 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 14
 */
#define ISP_HIST_BIN_14    0x0001FFFFU
#define ISP_HIST_BIN_14_M  (ISP_HIST_BIN_14_V << ISP_HIST_BIN_14_S)
#define ISP_HIST_BIN_14_V  0x0001FFFFU
#define ISP_HIST_BIN_14_S  0

/** ISP_HIST_BIN15_REG register
 *  result of histogram bin 15
 */
#define ISP_HIST_BIN15_REG (DR_REG_ISP_BASE + 0x21c)
/** ISP_HIST_BIN_15 : RO; bitpos: [16:0]; default: 0;
 *  this field represents result of histogram bin 15
 */
#define ISP_HIST_BIN_15    0x0001FFFFU
#define ISP_HIST_BIN_15_M  (ISP_HIST_BIN_15_V << ISP_HIST_BIN_15_S)
#define ISP_HIST_BIN_15_V  0x0001FFFFU
#define ISP_HIST_BIN_15_S  0

