espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/isp_reg.h
/** ISP_MEM_AUX_CTRL_0_REG register
 *  mem aux control register 0
 */
#define ISP_MEM_AUX_CTRL_0_REG (DR_REG_ISP_BASE + 0x220)
/** ISP_HEADER_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  this field configures the mem_aux of isp input buffer memory
 */
#define ISP_HEADER_MEM_AUX_CTRL    0x00003FFFU
#define ISP_HEADER_MEM_AUX_CTRL_M  (ISP_HEADER_MEM_AUX_CTRL_V << ISP_HEADER_MEM_AUX_CTRL_S)
#define ISP_HEADER_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_HEADER_MEM_AUX_CTRL_S  0
/** ISP_DPC_LUT_MEM_AUX_CTRL : R/W; bitpos: [29:16]; default: 4896;
 *  this field represents this field configures the mem_aux of dpc lut memory
 */
#define ISP_DPC_LUT_MEM_AUX_CTRL    0x00003FFFU
#define ISP_DPC_LUT_MEM_AUX_CTRL_M  (ISP_DPC_LUT_MEM_AUX_CTRL_V << ISP_DPC_LUT_MEM_AUX_CTRL_S)
#define ISP_DPC_LUT_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_DPC_LUT_MEM_AUX_CTRL_S  16

/** ISP_MEM_AUX_CTRL_1_REG register
 *  mem aux control register 1
 */
#define ISP_MEM_AUX_CTRL_1_REG (DR_REG_ISP_BASE + 0x224)
/** ISP_LSC_LUT_R_GR_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  this field configures the mem_aux of lsc r gr lut memory
 */
#define ISP_LSC_LUT_R_GR_MEM_AUX_CTRL    0x00003FFFU
#define ISP_LSC_LUT_R_GR_MEM_AUX_CTRL_M  (ISP_LSC_LUT_R_GR_MEM_AUX_CTRL_V << ISP_LSC_LUT_R_GR_MEM_AUX_CTRL_S)
#define ISP_LSC_LUT_R_GR_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_LSC_LUT_R_GR_MEM_AUX_CTRL_S  0
/** ISP_LSC_LUT_GB_B_MEM_AUX_CTRL : R/W; bitpos: [29:16]; default: 4896;
 *  this field configures the mem_aux of lsc gb b lut memory
 */
#define ISP_LSC_LUT_GB_B_MEM_AUX_CTRL    0x00003FFFU
#define ISP_LSC_LUT_GB_B_MEM_AUX_CTRL_M  (ISP_LSC_LUT_GB_B_MEM_AUX_CTRL_V << ISP_LSC_LUT_GB_B_MEM_AUX_CTRL_S)
#define ISP_LSC_LUT_GB_B_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_LSC_LUT_GB_B_MEM_AUX_CTRL_S  16

/** ISP_MEM_AUX_CTRL_2_REG register
 *  mem aux control register 2
 */
#define ISP_MEM_AUX_CTRL_2_REG (DR_REG_ISP_BASE + 0x228)
/** ISP_BF_MATRIX_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  this field configures the mem_aux of bf line buffer memory
 */
#define ISP_BF_MATRIX_MEM_AUX_CTRL    0x00003FFFU
#define ISP_BF_MATRIX_MEM_AUX_CTRL_M  (ISP_BF_MATRIX_MEM_AUX_CTRL_V << ISP_BF_MATRIX_MEM_AUX_CTRL_S)
#define ISP_BF_MATRIX_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_BF_MATRIX_MEM_AUX_CTRL_S  0
/** ISP_DPC_MATRIX_MEM_AUX_CTRL : R/W; bitpos: [29:16]; default: 4896;
 *  this field configures the mem_aux of dpc line buffer memory
 */
#define ISP_DPC_MATRIX_MEM_AUX_CTRL    0x00003FFFU
#define ISP_DPC_MATRIX_MEM_AUX_CTRL_M  (ISP_DPC_MATRIX_MEM_AUX_CTRL_V << ISP_DPC_MATRIX_MEM_AUX_CTRL_S)
#define ISP_DPC_MATRIX_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_DPC_MATRIX_MEM_AUX_CTRL_S  16

/** ISP_MEM_AUX_CTRL_3_REG register
 *  mem aux control register 3
 */
#define ISP_MEM_AUX_CTRL_3_REG (DR_REG_ISP_BASE + 0x22c)
/** ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  this field configures the mem_aux of sharp y line buffer memory
 */
#define ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL    0x00003FFFU
#define ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL_M  (ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL_V << ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL_S)
#define ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_SHARP_MATRIX_Y_MEM_AUX_CTRL_S  0
/** ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL : R/W; bitpos: [29:16]; default: 4896;
 *  this field configures the mem_aux of demosaic line buffer memory
 */
#define ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL    0x00003FFFU
#define ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL_M  (ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL_V << ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL_S)
#define ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_DEMOSAIC_MATRIX_MEM_AUX_CTRL_S  16

/** ISP_MEM_AUX_CTRL_4_REG register
 *  mem aux control register 4
 */
#define ISP_MEM_AUX_CTRL_4_REG (DR_REG_ISP_BASE + 0x230)
/** ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  this field configures the mem_aux of sharp uv line buffer memory
 */
#define ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL    0x00003FFFU
#define ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL_M  (ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL_V << ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL_S)
#define ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL_V  0x00003FFFU
#define ISP_SHARP_MATRIX_UV_MEM_AUX_CTRL_S  0

/** ISP_YUV_FORMAT_REG register
 *  yuv format control register
 */
#define ISP_YUV_FORMAT_REG (DR_REG_ISP_BASE + 0x234)
/** ISP_YUV_MODE : R/W; bitpos: [0]; default: 0;
 *  this bit configures the yuv mode. 0: ITU-R BT.601, 1: ITU-R BT.709
 */
#define ISP_YUV_MODE    (BIT(0))
#define ISP_YUV_MODE_M  (ISP_YUV_MODE_V << ISP_YUV_MODE_S)
#define ISP_YUV_MODE_V  0x00000001U
#define ISP_YUV_MODE_S  0
/** ISP_YUV_RANGE : R/W; bitpos: [1]; default: 0;
 *  this bit configures the yuv range. 0: full range, 1: limit range
 */
#define ISP_YUV_RANGE    (BIT(1))
#define ISP_YUV_RANGE_M  (ISP_YUV_RANGE_V << ISP_YUV_RANGE_S)
#define ISP_YUV_RANGE_V  0x00000001U
#define ISP_YUV_RANGE_S  1

/** ISP_RDN_ECO_CS_REG register
 *  rdn eco cs register
 */
#define ISP_RDN_ECO_CS_REG (DR_REG_ISP_BASE + 0x238)
/** ISP_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  rdn_eco_en
 */
#define ISP_RDN_ECO_EN    (BIT(0))
#define ISP_RDN_ECO_EN_M  (ISP_RDN_ECO_EN_V << ISP_RDN_ECO_EN_S)
#define ISP_RDN_ECO_EN_V  0x00000001U
#define ISP_RDN_ECO_EN_S  0
/** ISP_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  rdn_eco_result
 */
#define ISP_RDN_ECO_RESULT    (BIT(1))
#define ISP_RDN_ECO_RESULT_M  (ISP_RDN_ECO_RESULT_V << ISP_RDN_ECO_RESULT_S)
#define ISP_RDN_ECO_RESULT_V  0x00000001U
#define ISP_RDN_ECO_RESULT_S  1

/** ISP_RDN_ECO_LOW_REG register
 *  rdn eco all low register
 */
#define ISP_RDN_ECO_LOW_REG (DR_REG_ISP_BASE + 0x23c)
/** ISP_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  rdn_eco_low
 */
#define ISP_RDN_ECO_LOW    0xFFFFFFFFU
#define ISP_RDN_ECO_LOW_M  (ISP_RDN_ECO_LOW_V << ISP_RDN_ECO_LOW_S)
#define ISP_RDN_ECO_LOW_V  0xFFFFFFFFU
#define ISP_RDN_ECO_LOW_S  0

/** ISP_RDN_ECO_HIGH_REG register
 *  rdn eco all high register
 */
#define ISP_RDN_ECO_HIGH_REG (DR_REG_ISP_BASE + 0x240)
/** ISP_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  rdn_eco_high
 */
#define ISP_RDN_ECO_HIGH    0xFFFFFFFFU
#define ISP_RDN_ECO_HIGH_M  (ISP_RDN_ECO_HIGH_V << ISP_RDN_ECO_HIGH_S)
#define ISP_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define ISP_RDN_ECO_HIGH_S  0

#ifdef __cplusplus
}
#endif
